hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/**
 *******************************************************************************
 * @file  HC32F120.h
 * @brief Headerfile for HC32F120 series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-08-22       chengy          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2017, Huada Semiconductor Co.,Ltd All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file HC32F120.h
 **
 ** Auto generate.
 ** Headerfile for HC32F120 series MCU
 **
 ** History:
 **
 **   - 2019-08-22  1.0   First version for Device Driver Library of HC32F120 series MCU.
 **
 ******************************************************************************/

#ifndef __HC32F120_H__
#define __HC32F120_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M0+ Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             0       /*!< HC32F120 provides an MPU                             */
#define __VTOR_PRESENT            1       /*!< HC32F120 supported vector table registers            */
#define __NVIC_PRIO_BITS          2       /*!< HC32F120 uses 2 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum IRQn
{
    NMI_IRQn            = -14, /*  2 Non Maskable                            */
    HardFault_IRQn      = -13, /*  3 Hard Fault                              */
    SVC_IRQn            = -5,  /* 11 SV Call                                 */
    PendSV_IRQn         = -2,  /* 14 Pend SV                                 */
    SysTick_IRQn        = -1,  /* 15 System Tick                             */
    EXINT00_IRQn        = 0,
    EXINT01_IRQn        = 1,
    EXINT02_IRQn        = 2,
    EXINT03_IRQn        = 3,
    EXINT04_IRQn        = 4,
    EXINT05_IRQn        = 5,
    EXINT06_IRQn        = 6,
    EXINT07_IRQn        = 7,
    Int008_IRQn         = 8,
    Int009_IRQn         = 9,
    Int010_IRQn         = 10,
    Int011_IRQn         = 11,
    Int012_IRQn         = 12,
    Int013_IRQn         = 13,
    Int014_IRQn         = 14,
    Int015_IRQn         = 15,
    Int016_IRQn         = 16,
    Int017_IRQn         = 17,
    Int018_IRQn         = 18,
    Int019_IRQn         = 19,
    Int020_IRQn         = 20,
    Int021_IRQn         = 21,
    Int022_IRQn         = 22,
    Int023_IRQn         = 23,
    Int024_IRQn         = 24,
    Int025_IRQn         = 25,
    Int026_IRQn         = 26,
    Int027_IRQn         = 27,
    Int028_IRQn         = 28,
    Int029_IRQn         = 29,
    Int030_IRQn         = 30,
    Int031_IRQn         = 31,

} IRQn_Type;

#include <core_cm0plus.h>
#include <stdint.h>

/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum en_event_src
{
    EVT_PORT_EIRQ0          = 0u,
    EVT_PORT_EIRQ8          = 1u,
    EVT_TMRB_7_OVF          = 8u,
    EVT_TMRB_7_UDF          = 9u,
    EVT_TMRB_8_CMP          = 10u,
    EVT_PORT_EIRQ1          = 16u,
    EVT_PORT_EIRQ9          = 17u,
    EVT_TMRB_8_OVF          = 24u,
    EVT_TMRB_8_UDF          = 25u,
    EVT_TMRB_7_CMP          = 26u,
    EVT_PORT_EIRQ2          = 32u,
    EVT_TMRB_5_OVF          = 40u,
    EVT_TMRB_5_UDF          = 41u,
    EVT_TMRB_6_CMP          = 42u,
    EVT_PORT_EIRQ3          = 48u,
    EVT_TMR0_GCMP           = 50u,
    EVT_TMRB_6_OVF          = 56u,
    EVT_TMRB_6_UDF          = 57u,
    EVT_TMRB_5_CMP          = 58u,
    EVT_AOS_STRG            = 59u,
    EVT_PORT_EIRQ4          = 64u,
    EVT_TMRB_3_OVF          = 72u,
    EVT_TMRB_3_UDF          = 73u,
    EVT_TMRB_4_CMP          = 74u,
    EVT_ADC_EOCA            = 75u,
    EVT_PORT_EIRQ5          = 80u,
    EVT_TMRB_4_OVF          = 88u,
    EVT_TMRB_4_UDF          = 89u,
    EVT_TMRB_3_CMP          = 90u,
    EVT_ADC_EOCB            = 91u,
    EVT_PORT_EIRQ6          = 96u,
    EVT_TMRB_1_OVF          = 104u,
    EVT_TMRB_1_UDF          = 105u,
    EVT_TMRB_2_CMP          = 106u,
    EVT_ADC_CMP0            = 107u,
    EVT_PORT_EIRQ7          = 112u,
    EVT_FMC_OPTEND          = 116u,
    EVT_RTC_ALM             = 117u,
    EVT_RTC_PRD             = 118u,
    EVT_TMRB_2_OVF          = 120u,
    EVT_TMRB_2_UDF          = 121u,
    EVT_TMRB_1_CMP          = 122u,
    EVT_ADC_CMP1            = 123u,
} en_event_src_t;

/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum en_int_src
{
    INT_PORT_EIRQ0          = 0u,
    INT_PORT_EIRQ8          = 1u,
    INT_EFM_PEERR           = 4u,
    INT_EFM_RDCOL           = 5u,
    INT_XTAL_STOP           = 6u,
    INT_SWDT_NMIUNDF        = 7u,
    INT_TMRB_7_OVF          = 8u,
    INT_TMRB_7_UDF          = 9u,
    INT_TMRB_8_CMP          = 10u,
    INT_USART_1_EI          = 12u,
    INT_IIC_EE1             = 13u,
    INT_SPI_SPEI            = 14u,
    INT_USART_4_EI          = 15u,
    INT_PORT_EIRQ1          = 16u,
    INT_PORT_EIRQ9          = 17u,
    INT_CTC_ERR             = 20u,
    INT_TMRB_8_OVF          = 24u,
    INT_TMRB_8_UDF          = 25u,
    INT_TMRB_7_CMP          = 26u,
    INT_USART_1_RI          = 28u,
    INT_USART_4_RI          = 31u,
    INT_PORT_EIRQ2          = 32u,
    INT_TMRB_5_OVF          = 40u,
    INT_TMRB_5_UDF          = 41u,
    INT_TMRB_6_CMP          = 42u,
    INT_USART_1_TI          = 44u,
    INT_USART_3_EI          = 45u,
    INT_PORT_EIRQ3          = 48u,
    INT_PORT_EKEY           = 49u,
    INT_TMR0_GCMP           = 50u,
    INT_TMRB_6_OVF          = 56u,
    INT_TMRB_6_UDF          = 57u,
    INT_TMRB_5_CMP          = 58u,
    INT_USART_1_TCI         = 60u,
    INT_USART_3_RI          = 61u,
    INT_SPI_SPRI            = 62u,
    INT_PORT_EIRQ4          = 64u,
    INT_TMRB_3_OVF          = 72u,
    INT_TMRB_3_UDF          = 73u,
    INT_TMRB_4_CMP          = 74u,
    INT_ADC_EOCA            = 75u,
    INT_USART_2_EI          = 76u,
    INT_USART_3_TI          = 77u,
    INT_IIC_TEI             = 78u,
    INT_SPI_SPII            = 79u,
    INT_PORT_EIRQ5          = 80u,
    INT_TMRB_4_OVF          = 88u,
    INT_TMRB_4_UDF          = 89u,
    INT_TMRB_3_CMP          = 90u,
    INT_ADC_EOCB            = 91u,
    INT_USART_2_RI          = 92u,
    INT_USART_3_TCI         = 93u,
    INT_IIC_RXI             = 94u,
    INT_PORT_EIRQ6          = 96u,
    INT_TMRB_1_OVF          = 104u,
    INT_TMRB_1_UDF          = 105u,
    INT_TMRB_2_CMP          = 106u,
    INT_ADC_CMP0            = 107u,
    INT_USART_2_TI          = 108u,
    INT_IIC_TXI             = 109u,
    INT_USART_4_TI          = 111u,
    INT_PORT_EIRQ7          = 112u,
    INT_PVD_DET             = 114u,
    INT_FMC_OPTEND          = 116u,
    INT_RTC_ALM             = 117u,
    INT_RTC_PRD             = 118u,
    INT_RTC_IT              = 119u,
    INT_TMRB_2_OVF          = 120u,
    INT_TMRB_2_UDF          = 121u,
    INT_TMRB_1_CMP          = 122u,
    INT_ADC_CMP1            = 123u,
    INT_USART_2_TCI         = 124u,
    INT_SPI_SPTI            = 125u,
    INT_USART_4_TCI         = 127u,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

typedef struct
{
    __IO uint8_t STRT                       : 1;
    uint8_t RESERVED1                       : 7;
} stc_adc_str_field_t;

typedef struct
{
    __IO uint16_t MS                        : 2;
    uint16_t RESERVED2                      : 2;
    __IO uint16_t ACCSEL                    : 2;
    __IO uint16_t CLREN                     : 1;
    __IO uint16_t DFMT                      : 1;
    uint16_t RESERVED8                      : 8;
} stc_adc_cr0_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 2;
    __IO uint16_t RSCHSEL                   : 1;
    uint16_t RESERVED3                      :13;
} stc_adc_cr1_field_t;

typedef struct
{
    __IO uint16_t TRGSELA                   : 2;
    uint16_t RESERVED2                      : 5;
    __IO uint16_t TRGENA                    : 1;
    __IO uint16_t TRGSELB                   : 2;
    uint16_t RESERVED10                     : 5;
    __IO uint16_t TRGENB                    : 1;
} stc_adc_trgsr_field_t;

typedef struct
{
    __IO uint16_t CHSELA                    :12;
    uint16_t RESERVED12                     : 4;
} stc_adc_chselra0_field_t;

typedef struct
{
    __IO uint16_t CHSELB                    :12;
    uint16_t RESERVED12                     : 4;
} stc_adc_chselrb0_field_t;

typedef struct
{
    __IO uint8_t EXCHSEL                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_adc_exchselr_field_t;

typedef struct
{
    __IO uint8_t EOCAF                      : 1;
    __IO uint8_t EOCBF                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_isr_field_t;

typedef struct
{
    __IO uint8_t EOCAIEN                    : 1;
    __IO uint8_t EOCBIEN                    : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_icr_field_t;

typedef struct
{
    __IO uint8_t CLREOCAF                   : 1;
    __IO uint8_t CLREOCBF                   : 1;
    uint8_t RESERVED2                       : 6;
} stc_adc_isclrr_field_t;

typedef struct
{
    __IO uint16_t AWD0EN                    : 1;
    __IO uint16_t AWD0IEN                   : 1;
    __IO uint16_t AWD0MD                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t AWD1EN                    : 1;
    __IO uint16_t AWD1IEN                   : 1;
    __IO uint16_t AWD1MD                    : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t AWDCM                     : 2;
    uint16_t RESERVED10                     : 6;
} stc_adc_awdcr_field_t;

typedef struct
{
    __IO uint8_t AWD0F                      : 1;
    __IO uint8_t AWD1F                      : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t AWDCMF                     : 1;
    uint8_t RESERVED5                       : 3;
} stc_adc_awdsr_field_t;

typedef struct
{
    __IO uint8_t CLRAWD0F                   : 1;
    __IO uint8_t CLRAWD1F                   : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t CLRAWDCMF                  : 1;
    uint8_t RESERVED5                       : 3;
} stc_adc_awdsclrr_field_t;

typedef struct
{
    __IO uint8_t AWDCH                      : 5;
    uint8_t RESERVED5                       : 3;
} stc_adc_awd0chsr_field_t;

typedef struct
{
    __IO uint8_t AWDCH                      : 5;
    uint8_t RESERVED5                       : 3;
} stc_adc_awd1chsr_field_t;

typedef struct
{
    __IO uint32_t STRG                      : 1;
    uint32_t RESERVED1                      :31;
} stc_aos_intc_strgcr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_tmr0_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_tmrb_htssr_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_adc_itrgselr0_field_t;

typedef struct
{
    __IO uint32_t TRGSEL                    : 7;
    uint32_t RESERVED7                      :25;
} stc_aos_adc_itrgselr1_field_t;

typedef struct
{
    __IO uint8_t PERICKSEL                  : 3;
    uint8_t RESERVED3                       : 5;
} stc_cmu_pericksel_field_t;

typedef struct
{
    __IO uint8_t XTALSTDF                   : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_xtalstdsr_field_t;

typedef struct
{
    __IO uint8_t SCKDIV                     : 3;
    uint8_t RESERVED3                       : 5;
} stc_cmu_sckdivr_field_t;

typedef struct
{
    __IO uint8_t CKSW                       : 2;
    uint8_t RESERVED2                       : 6;
} stc_cmu_ckswr_field_t;

typedef struct
{
    __IO uint8_t XTALSTP                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_xtalcr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t XTALDRV                    : 2;
    __IO uint8_t XTALMS                     : 1;
    __IO uint8_t SUPDRV                     : 1;
} stc_cmu_xtalcfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTB                    : 3;
    uint8_t RESERVED3                       : 5;
} stc_cmu_xtalstbcr_field_t;

typedef struct
{
    __IO uint8_t HRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_hrccr_field_t;

typedef struct
{
    __IO uint8_t HRCSTBF                    : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t XTALSTBF                   : 1;
    __IO uint8_t XTAL32STBF                 : 1;
    uint8_t RESERVED5                       : 3;
} stc_cmu_oscstbsr_field_t;

typedef struct
{
    __IO uint8_t MCO1SEL                    : 4;
    __IO uint8_t MCO1DIV                    : 3;
    __IO uint8_t MCO1EN                     : 1;
} stc_cmu_mco1cfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDIE                  : 1;
    __IO uint8_t XTALSTDRE                  : 1;
    __IO uint8_t XTALSTDRIS                 : 1;
    uint8_t RESERVED3                       : 4;
    __IO uint8_t XTALSTDE                   : 1;
} stc_cmu_xtalstdcr_field_t;

typedef struct
{
    __IO uint32_t ADC                       : 1;
    __IO uint32_t CTC                       : 1;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t AOS                       : 1;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t CRC                       : 1;
    __IO uint32_t TIMB1                     : 1;
    __IO uint32_t TIMB2                     : 1;
    __IO uint32_t TIMB3                     : 1;
    __IO uint32_t TIMB4                     : 1;
    __IO uint32_t TIMB5                     : 1;
    __IO uint32_t TIMB6                     : 1;
    __IO uint32_t TIMB7                     : 1;
    __IO uint32_t TIMB8                     : 1;
    __IO uint32_t TIM0                      : 1;
    uint32_t RESERVED17                     : 6;
    __IO uint32_t RTC                       : 1;
    __IO uint32_t UART1                     : 1;
    __IO uint32_t UART2                     : 1;
    __IO uint32_t UART3                     : 1;
    __IO uint32_t UART4                     : 1;
    __IO uint32_t IIC                       : 1;
    __IO uint32_t SPI                       : 1;
    uint32_t RESERVED30                     : 2;
} stc_cmu_fcg_field_t;

typedef struct
{
    __IO uint8_t XTAL32STP                  : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_xtal32cr_field_t;

typedef struct
{
    __IO uint8_t XTAL32DRV                  : 2;
    __IO uint8_t XTAL32SUPDRV               : 1;
    uint8_t RESERVED3                       : 5;
} stc_cmu_xtal32cfgr_field_t;

typedef struct
{
    __IO uint8_t XTAL32NF                   : 2;
    uint8_t RESERVED2                       : 6;
} stc_cmu_xtal32nfr_field_t;

typedef struct
{
    __IO uint8_t LRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_cmu_lrccr_field_t;

typedef struct
{
    __IO uint32_t CR                        : 1;
    __IO uint32_t FLAG                      : 1;
    uint32_t RESERVED2                      :30;
} stc_crc_cr_field_t;

typedef struct
{
    __IO uint32_t REFPSC                    : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t REFCKS                    : 2;
    __IO uint32_t ERRIE                     : 1;
    __IO uint32_t CTCEN                     : 1;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t TRMVAL                    : 6;
    uint32_t RESERVED22                     :10;
} stc_ctc_cr1_field_t;

typedef struct
{
    __IO uint32_t OFSVAL                    : 8;
    uint32_t RESERVED8                      : 8;
    __IO uint32_t RLDVAL                    :16;
} stc_ctc_cr2_field_t;

typedef struct
{
    __IO uint32_t TRIMOK                    : 1;
    __IO uint32_t TRMOVF                    : 1;
    __IO uint32_t TRMUDF                    : 1;
    __IO uint32_t CTCBSY                    : 1;
    uint32_t RESERVED4                      :28;
} stc_ctc_str_field_t;

typedef struct
{
    __IO uint32_t CDBGPWRUPREQ              : 1;
    __IO uint32_t CDBGPWRUPACK              : 1;
    uint32_t RESERVED2                      :30;
} stc_dbgc_mcudbgstat_field_t;

typedef struct
{
    __IO uint32_t SWDTSTP                   : 1;
    uint32_t RESERVED1                      : 1;
    __IO uint32_t RTCSTP                    : 1;
    __IO uint32_t PVDSTP                    : 1;
    uint32_t RESERVED4                      :10;
    __IO uint32_t TMR01STP                  : 1;
    uint32_t RESERVED15                     : 2;
    __IO uint32_t TMR21STP                  : 1;
    uint32_t RESERVED18                     : 2;
    __IO uint32_t TMR41STP                  : 1;
    uint32_t RESERVED21                     : 2;
    __IO uint32_t TMRA1STP                  : 1;
    __IO uint32_t TMRB1STP                  : 1;
    __IO uint32_t TMRB2STP                  : 1;
    __IO uint32_t TMRB3STP                  : 1;
    __IO uint32_t TMRB4STP                  : 1;
    __IO uint32_t TMRB5STP                  : 1;
    __IO uint32_t TMRB6STP                  : 1;
    __IO uint32_t TMRB7STP                  : 1;
    __IO uint32_t TMRB8STP                  : 1;
} stc_dbgc_mcustpctl_field_t;

typedef struct
{
    __IO uint32_t FAPRT                     :16;
    uint32_t RESERVED16                     :16;
} stc_efm_faprt_field_t;

typedef struct
{
    __IO uint32_t FSTP                      : 1;
    uint32_t RESERVED1                      :31;
} stc_efm_fstp_field_t;

typedef struct
{
    __IO uint32_t FLWT                      : 1;
    uint32_t RESERVED1                      :16;
    __IO uint32_t PREFETE                   : 1;
    uint32_t RESERVED18                     :14;
} stc_efm_frmc_field_t;

typedef struct
{
    __IO uint32_t PEMODE                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t PEMOD                     : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t BUSHLDCTL                 : 1;
    uint32_t RESERVED9                      :23;
} stc_efm_fwmc_field_t;

typedef struct
{
    __IO uint32_t PEWERR                    : 1;
    __IO uint32_t PEPRTERR                  : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PGMISMTCH                 : 1;
    __IO uint32_t OPTEND                    : 1;
    __IO uint32_t RDCOLERR                  : 1;
    uint32_t RESERVED6                      : 2;
    __IO uint32_t RDY                       : 1;
    uint32_t RESERVED9                      :23;
} stc_efm_fsr_field_t;

typedef struct
{
    __IO uint32_t PEWERRCLR                 : 1;
    __IO uint32_t PEPRTERRCLR               : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t PGMISMTCHCLR              : 1;
    __IO uint32_t OPTENDCLR                 : 1;
    __IO uint32_t RDCOLERRCLR               : 1;
    uint32_t RESERVED6                      :26;
} stc_efm_fsclr_field_t;

typedef struct
{
    __IO uint32_t PEERRITE                  : 1;
    __IO uint32_t OPTENDITE                 : 1;
    __IO uint32_t RDCOLERRITE               : 1;
    uint32_t RESERVED3                      :29;
} stc_efm_fite_field_t;

typedef struct
{
    __IO uint32_t FPMTSW                    :16;
    uint32_t RESERVED16                     :16;
} stc_efm_fpmtsw_field_t;

typedef struct
{
    __IO uint32_t FPMTEW                    :16;
    uint32_t RESERVED16                     :16;
} stc_efm_fpmtew_field_t;

typedef struct
{
    __IO uint8_t HRCFREQS                   : 4;
    uint8_t RESERVED4                       : 4;
} stc_efm_hrccfgr_field_t;

typedef struct
{
    __IO uint16_t DFS                       : 2;
    __IO uint16_t DFDIS                     : 1;
    uint16_t RESERVED3                      : 5;
    __IO uint16_t LVDLVL                    : 4;
    __IO uint16_t NMIS                      : 1;
    __IO uint16_t IRS                       : 1;
    __IO uint16_t IRDIS                     : 1;
    __IO uint16_t LVDDIS                    : 1;
} stc_efm_lvdicgcr_field_t;

typedef struct
{
    __IO uint32_t PE                        : 1;
    __IO uint32_t SMBUS                     : 1;
    __IO uint32_t SMBALRTEN                 : 1;
    __IO uint32_t SMBDEFAULTEN              : 1;
    __IO uint32_t SMBHOSTEN                 : 1;
    __IO uint32_t FACKEN                    : 1;
    __IO uint32_t GCEN                      : 1;
    __IO uint32_t RESTART                   : 1;
    __IO uint32_t START                     : 1;
    __IO uint32_t STOP                      : 1;
    __IO uint32_t ACK                       : 1;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t SWRST                     : 1;
    uint32_t RESERVED16                     :16;
} stc_i2c_cr1_field_t;

