hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
typedef struct
{
    __IO uint32_t STARTIE                   : 1;
    __IO uint32_t SLADDR0IE                 : 1;
    __IO uint32_t SLADDR1IE                 : 1;
    __IO uint32_t TENDIE                    : 1;
    __IO uint32_t STOPIE                    : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLIE                   : 1;
    __IO uint32_t TEMPTYIE                  : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOIE                    : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKIE                    : 1;
    uint32_t RESERVED13                     : 7;
    __IO uint32_t GENCALLIE                 : 1;
    __IO uint32_t SMBDEFAULTIE              : 1;
    __IO uint32_t SMBHOSTIE                 : 1;
    __IO uint32_t SMBALRTIE                 : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_cr2_field_t;

typedef struct
{
    __IO uint32_t SLADDR0                   :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SLADDR0EN                 : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t ADDRMOD0                  : 1;
    uint32_t RESERVED16                     :16;
} stc_i2c_slr0_field_t;

typedef struct
{
    __IO uint32_t SLADDR1                   :10;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t SLADDR1EN                 : 1;
    uint32_t RESERVED13                     : 2;
    __IO uint32_t ADDRMOD1                  : 1;
    uint32_t RESERVED16                     :16;
} stc_i2c_slr1_field_t;

typedef struct
{
    __IO uint32_t STARTF                    : 1;
    __IO uint32_t SLADDR0F                  : 1;
    __IO uint32_t SLADDR1F                  : 1;
    __IO uint32_t TENDF                     : 1;
    __IO uint32_t STOPF                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLF                    : 1;
    __IO uint32_t TEMPTYF                   : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOF                     : 1;
    __IO uint32_t ACKRF                     : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t NACKF                     : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t MSL                       : 1;
    __IO uint32_t BUSY                      : 1;
    __IO uint32_t TRA                       : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t GENCALLF                  : 1;
    __IO uint32_t SMBDEFAULTF               : 1;
    __IO uint32_t SMBHOSTF                  : 1;
    __IO uint32_t SMBALRTF                  : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_sr_field_t;

typedef struct
{
    __IO uint32_t STARTFCLR                 : 1;
    __IO uint32_t SLADDR0FCLR               : 1;
    __IO uint32_t SLADDR1FCLR               : 1;
    __IO uint32_t TENDFCLR                  : 1;
    __IO uint32_t STOPFCLR                  : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t RFULLFCLR                 : 1;
    __IO uint32_t TEMPTYFCLR                : 1;
    uint32_t RESERVED8                      : 1;
    __IO uint32_t ARLOFCLR                  : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NACKFCLR                  : 1;
    uint32_t RESERVED13                     : 7;
    __IO uint32_t GENCALLFCLR               : 1;
    __IO uint32_t SMBDEFAULTFCLR            : 1;
    __IO uint32_t SMBHOSTFCLR               : 1;
    __IO uint32_t SMBALRTFCLR               : 1;
    uint32_t RESERVED24                     : 8;
} stc_i2c_clr_field_t;

typedef struct
{
    __IO uint8_t DT                         : 8;
} stc_i2c_dtr_field_t;

typedef struct
{
    __IO uint8_t DR                         : 8;
} stc_i2c_drr_field_t;

typedef struct
{
    __IO uint32_t SLOWW                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t SHIGHW                    : 5;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t CKDIV                     : 3;
    uint32_t RESERVED19                     :13;
} stc_i2c_ccr_field_t;

typedef struct
{
    __IO uint32_t DNF                       : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t DNFEN                     : 1;
    __IO uint32_t ANFEN                     : 1;
    uint32_t RESERVED6                      :26;
} stc_i2c_fltr_field_t;

typedef struct
{
    __IO uint32_t SWDTAUTS                  : 1;
    __IO uint32_t SWDTITS                   : 1;
    __IO uint32_t SWDTPERI                  : 2;
    __IO uint32_t SWDTCKS                   : 4;
    __IO uint32_t SWDTWDPT                  : 4;
    __IO uint32_t SWDTSLPOFF                : 1;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t HRCREQS                   : 4;
    uint32_t RESERVED20                     : 6;
    __IO uint32_t NMIFCLK                   : 2;
    __IO uint32_t NMIFEN                    : 1;
    __IO uint32_t NMITRG                    : 1;
    __IO uint32_t NMIEN                     : 1;
    __IO uint32_t NMIICGENA                 : 1;
} stc_icg_icg0_field_t;

typedef struct
{
    __IO uint32_t DFS                       : 2;
    __IO uint32_t DFDIS                     : 1;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t LVDLVL                    : 4;
    __IO uint32_t NMIS                      : 1;
    __IO uint32_t IRS                       : 1;
    __IO uint32_t IRDIS                     : 1;
    __IO uint32_t LVDDIS                    : 1;
    uint32_t RESERVED16                     :16;
} stc_icg_icg1_field_t;

typedef struct
{
    __IO uint32_t NMITRG                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t NMIFCLK                   : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t NMIFEN                    : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_nmicr_field_t;

typedef struct
{
    __IO uint32_t NMIEN                     : 1;
    __IO uint32_t XTALSTPEN                 : 1;
    __IO uint32_t SWDTEN                    : 1;
    __IO uint32_t PVDEN                     : 1;
    uint32_t RESERVED4                      :28;
} stc_intc_nmier_field_t;

typedef struct
{
    __IO uint32_t NMIF                      : 1;
    __IO uint32_t XTALSTPF                  : 1;
    __IO uint32_t SWDTF                     : 1;
    __IO uint32_t PVDF                      : 1;
    uint32_t RESERVED4                      :28;
} stc_intc_nmifr_field_t;

typedef struct
{
    __IO uint32_t NMICL                     : 1;
    __IO uint32_t XTALSTPCL                 : 1;
    __IO uint32_t SWDTCL                    : 1;
    __IO uint32_t PVDCL                     : 1;
    uint32_t RESERVED4                      :28;
} stc_intc_nmiclr_field_t;

typedef struct
{
    __IO uint32_t EVTEN0                    : 1;
    __IO uint32_t EVTEN1                    : 1;
    __IO uint32_t EVTEN2                    : 1;
    __IO uint32_t EVTEN3                    : 1;
    __IO uint32_t EVTEN4                    : 1;
    __IO uint32_t EVTEN5                    : 1;
    __IO uint32_t EVTEN6                    : 1;
    __IO uint32_t EVTEN7                    : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_evter_field_t;

typedef struct
{
    __IO uint32_t EKEY0EN                   : 1;
    __IO uint32_t EKEY1EN                   : 1;
    __IO uint32_t EKEY2EN                   : 1;
    __IO uint32_t EKEY3EN                   : 1;
    __IO uint32_t EKEY4EN                   : 1;
    __IO uint32_t EKEY5EN                   : 1;
    uint32_t RESERVED6                      :26;
} stc_intc_ekeycr_field_t;

typedef struct
{
    __IO uint32_t FPRC                      : 8;
    uint32_t RESERVED8                      :24;
} stc_intc_fprcr_field_t;

typedef struct
{
    __IO uint32_t EIRQTRG                   : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t EIRQFCLK                  : 2;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t EIRQFEN                   : 1;
    uint32_t RESERVED8                      :24;
} stc_intc_eirqcr_field_t;

typedef struct
{
    __IO uint32_t EIRQWUEN                  :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t SWDTWUEN                  : 1;
    __IO uint32_t EKEYWUEN                  : 1;
    __IO uint32_t TMR0CMPWUEN               : 1;
    uint32_t RESERVED19                     : 3;
    __IO uint32_t PVDWUEN                   : 1;
    __IO uint32_t RTCALMWUEN                : 1;
    __IO uint32_t RTCPRDWUEN                : 1;
    uint32_t RESERVED25                     : 7;
} stc_intc_wupenr_field_t;

typedef struct
{
    __IO uint32_t EIRQF                     :10;
    uint32_t RESERVED10                     :22;
} stc_intc_eirqfr_field_t;

typedef struct
{
    __IO uint32_t EIRQCL                    :10;
    uint32_t RESERVED10                     :22;
} stc_intc_eirqclr_field_t;

typedef struct
{
    __IO uint32_t ISEL                      : 4;
    uint32_t RESERVED4                      :28;
} stc_intc_iselar_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t ISEL                      :15;
    uint32_t RESERVED16                     :16;
} stc_intc_iselbr_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr0_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    __IO uint8_t PIN5                       : 1;
    __IO uint8_t PIN6                       : 1;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr1_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    __IO uint8_t PIN5                       : 1;
    __IO uint8_t PIN6                       : 1;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr2_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr3_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr4_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_pidr5_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_pidr6_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_pidr7_field_t;

typedef struct
{
    __IO uint8_t PIN0                       : 1;
    __IO uint8_t PIN1                       : 1;
    __IO uint8_t PIN2                       : 1;
    __IO uint8_t PIN3                       : 1;
    __IO uint8_t PIN4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_pidr12_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr13_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t PIN6                       : 1;
    __IO uint8_t PIN7                       : 1;
} stc_port_pidr14_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr0_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    __IO uint8_t POUT5                      : 1;
    __IO uint8_t POUT6                      : 1;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr1_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    __IO uint8_t POUT5                      : 1;
    __IO uint8_t POUT6                      : 1;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr2_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr3_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr4_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_podr5_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_podr6_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_podr7_field_t;

typedef struct
{
    __IO uint8_t POUT0                      : 1;
    __IO uint8_t POUT1                      : 1;
    __IO uint8_t POUT2                      : 1;
    __IO uint8_t POUT3                      : 1;
    __IO uint8_t POUT4                      : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_podr12_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr13_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t POUT6                      : 1;
    __IO uint8_t POUT7                      : 1;
} stc_port_podr14_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer0_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    __IO uint8_t POUTE5                     : 1;
    __IO uint8_t POUTE6                     : 1;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer1_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    __IO uint8_t POUTE5                     : 1;
    __IO uint8_t POUTE6                     : 1;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer2_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer3_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer4_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_poer5_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_poer6_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_poer7_field_t;

typedef struct
{
    __IO uint8_t POUTE0                     : 1;
    __IO uint8_t POUTE1                     : 1;
    __IO uint8_t POUTE2                     : 1;
    __IO uint8_t POUTE3                     : 1;
    __IO uint8_t POUTE4                     : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_poer12_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer13_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t POUTE6                     : 1;
    __IO uint8_t POUTE7                     : 1;
} stc_port_poer14_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr0_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    __IO uint8_t POS5                       : 1;
    __IO uint8_t POS6                       : 1;
    __IO uint8_t POS7                       : 1;
} stc_port_posr1_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    __IO uint8_t POS5                       : 1;
    __IO uint8_t POS6                       : 1;
    __IO uint8_t POS7                       : 1;
} stc_port_posr2_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr3_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr4_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_posr5_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_posr6_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_posr7_field_t;

typedef struct
{
    __IO uint8_t POS0                       : 1;
    __IO uint8_t POS1                       : 1;
    __IO uint8_t POS2                       : 1;
    __IO uint8_t POS3                       : 1;
    __IO uint8_t POS4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_posr12_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t POS7                       : 1;
} stc_port_posr13_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t POS6                       : 1;
    __IO uint8_t POS7                       : 1;
} stc_port_posr14_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr0_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    __IO uint8_t POR5                       : 1;
    __IO uint8_t POR6                       : 1;
    __IO uint8_t POR7                       : 1;
} stc_port_porr1_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    __IO uint8_t POR5                       : 1;
    __IO uint8_t POR6                       : 1;
    __IO uint8_t POR7                       : 1;
} stc_port_porr2_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr3_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr4_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    uint8_t RESERVED2                       : 6;
} stc_port_porr5_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_porr6_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_port_porr7_field_t;

typedef struct
{
    __IO uint8_t POR0                       : 1;
    __IO uint8_t POR1                       : 1;
    __IO uint8_t POR2                       : 1;
    __IO uint8_t POR3                       : 1;
    __IO uint8_t POR4                       : 1;
    uint8_t RESERVED5                       : 3;
} stc_port_porr12_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t POR7                       : 1;
} stc_port_porr13_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 6;
    __IO uint8_t POR6                       : 1;
    __IO uint8_t POR7                       : 1;
} stc_port_porr14_field_t;

