hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/**
 * @brief AOS
 */
typedef struct
{
    union
    {
        __IO uint32_t INTC_STRGCR;
        stc_aos_intc_strgcr_field_t INTC_STRGCR_f;
    };
    uint8_t RESERVED0[28];
    union
    {
        __IO uint32_t TMR0_HTSSR;
        stc_aos_tmr0_htssr_field_t TMR0_HTSSR_f;
    };
    uint8_t RESERVED1[44];
    union
    {
        __IO uint32_t TMRB_HTSSR;
        stc_aos_tmrb_htssr_field_t TMRB_HTSSR_f;
    };
    uint8_t RESERVED2[12];
    union
    {
        __IO uint32_t ADC_ITRGSELR0;
        stc_aos_adc_itrgselr0_field_t ADC_ITRGSELR0_f;
    };
    union
    {
        __IO uint32_t ADC_ITRGSELR1;
        stc_aos_adc_itrgselr1_field_t ADC_ITRGSELR1_f;
    };
} M0P_AOS_TypeDef;

/**
 * @brief CMU
 */
typedef struct
{
    union
    {
        __IO uint8_t PERICKSEL;
        stc_cmu_pericksel_field_t PERICKSEL_f;
    };
    uint8_t RESERVED0[3];
    union
    {
        __IO uint8_t XTALSTDSR;
        stc_cmu_xtalstdsr_field_t XTALSTDSR_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint8_t SCKDIVR;
        stc_cmu_sckdivr_field_t SCKDIVR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t CKSWR;
        stc_cmu_ckswr_field_t CKSWR_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint8_t XTALCR;
        stc_cmu_xtalcr_field_t XTALCR_f;
    };
    uint8_t RESERVED4[3];
    union
    {
        __IO uint8_t XTALCFGR;
        stc_cmu_xtalcfgr_field_t XTALCFGR_f;
    };
    union
    {
        __IO uint8_t XTALSTBCR;
        stc_cmu_xtalstbcr_field_t XTALSTBCR_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint8_t HRCCR;
        stc_cmu_hrccr_field_t HRCCR_f;
    };
    uint8_t RESERVED6[7];
    union
    {
        __IO uint8_t OSCSTBSR;
        stc_cmu_oscstbsr_field_t OSCSTBSR_f;
    };
    uint8_t RESERVED7[3];
    union
    {
        __IO uint8_t MCO1CFGR;
        stc_cmu_mco1cfgr_field_t MCO1CFGR_f;
    };
    uint8_t RESERVED8[3];
    union
    {
        __IO uint8_t XTALSTDCR;
        stc_cmu_xtalstdcr_field_t XTALSTDCR_f;
    };
    uint8_t RESERVED9[7];
    union
    {
        __IO uint32_t FCG;
        stc_cmu_fcg_field_t FCG_f;
    };
    union
    {
        __IO uint8_t XTAL32CR;
        stc_cmu_xtal32cr_field_t XTAL32CR_f;
    };
    uint8_t RESERVED10[3];
    union
    {
        __IO uint8_t XTAL32CFGR;
        stc_cmu_xtal32cfgr_field_t XTAL32CFGR_f;
    };
    union
    {
        __IO uint8_t XTAL32NFR;
        stc_cmu_xtal32nfr_field_t XTAL32NFR_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint8_t LRCCR;
        stc_cmu_lrccr_field_t LRCCR_f;
    };
} M0P_CMU_TypeDef;

/**
 * @brief CRC
 */
typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_crc_cr_field_t CR_f;
    };
    __IO uint32_t RESLT;
    uint8_t RESERVED0[120];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
} M0P_CRC_TypeDef;

/**
 * @brief CTC
 */
typedef struct
{
    union
    {
        __IO uint32_t CR1;
        stc_ctc_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR2;
        stc_ctc_cr2_field_t CR2_f;
    };
    union
    {
        __IO uint32_t STR;
        stc_ctc_str_field_t STR_f;
    };
} M0P_CTC_TypeDef;

/**
 * @brief DBGC
 */
typedef struct
{
    union
    {
        __IO uint32_t MCUDBGSTAT;
        stc_dbgc_mcudbgstat_field_t MCUDBGSTAT_f;
    };
    union
    {
        __IO uint32_t MCUSTPCTL;
        stc_dbgc_mcustpctl_field_t MCUSTPCTL_f;
    };
} M0P_DBGC_TypeDef;

/**
 * @brief EFM
 */
typedef struct
{
    union
    {
        __IO uint32_t FAPRT;
        stc_efm_faprt_field_t FAPRT_f;
    };
    union
    {
        __IO uint32_t FSTP;
        stc_efm_fstp_field_t FSTP_f;
    };
    union
    {
        __IO uint32_t FRMC;
        stc_efm_frmc_field_t FRMC_f;
    };
    union
    {
        __IO uint32_t FWMC;
        stc_efm_fwmc_field_t FWMC_f;
    };
    union
    {
        __IO uint32_t FSR;
        stc_efm_fsr_field_t FSR_f;
    };
    union
    {
        __IO uint32_t FSCLR;
        stc_efm_fsclr_field_t FSCLR_f;
    };
    union
    {
        __IO uint32_t FITE;
        stc_efm_fite_field_t FITE_f;
    };
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t FPMTSW;
        stc_efm_fpmtsw_field_t FPMTSW_f;
    };
    union
    {
        __IO uint32_t FPMTEW;
        stc_efm_fpmtew_field_t FPMTEW_f;
    };
    uint8_t RESERVED1[40];
    __IO uint32_t UQID0;
    __IO uint32_t UQID1;
    __IO uint32_t UQID2;
    uint8_t RESERVED2[550];
    union
    {
        __IO uint8_t HRCCFGR;
        stc_efm_hrccfgr_field_t HRCCFGR_f;
    };
    uint8_t RESERVED3[1];
    union
    {
        __IO uint16_t LVDICGCR;
        stc_efm_lvdicgcr_field_t LVDICGCR_f;
    };
} M0P_EFM_TypeDef;

/**
 * @brief I2C
 */
typedef struct
{
    union
    {
        __IO uint32_t CR1;
        stc_i2c_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR2;
        stc_i2c_cr2_field_t CR2_f;
    };
    uint8_t RESERVED0[8];
    union
    {
        __IO uint32_t SLR0;
        stc_i2c_slr0_field_t SLR0_f;
    };
    union
    {
        __IO uint32_t SLR1;
        stc_i2c_slr1_field_t SLR1_f;
    };
    uint8_t RESERVED1[4];
    union
    {
        __IO uint32_t SR;
        stc_i2c_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t CLR;
        stc_i2c_clr_field_t CLR_f;
    };
    union
    {
        __IO uint8_t DTR;
        stc_i2c_dtr_field_t DTR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t DRR;
        stc_i2c_drr_field_t DRR_f;
    };
    uint8_t RESERVED3[3];
    union
    {
        __IO uint32_t CCR;
        stc_i2c_ccr_field_t CCR_f;
    };
    union
    {
        __IO uint32_t FLTR;
        stc_i2c_fltr_field_t FLTR_f;
    };
} M0P_I2C_TypeDef;

/**
 * @brief ICG
 */
typedef struct
{
    union
    {
        __IO uint32_t ICG0;
        stc_icg_icg0_field_t ICG0_f;
    };
    union
    {
        __IO uint32_t ICG1;
        stc_icg_icg1_field_t ICG1_f;
    };
    __IO uint32_t ICG2;
    __IO uint32_t ICG3;
    __IO uint32_t ICG4;
    __IO uint32_t ICG5;
    __IO uint32_t ICG6;
} M0P_ICG_TypeDef;

/**
 * @brief INTC
 */
typedef struct
{
    union
    {
        __IO uint32_t NMICR;
        stc_intc_nmicr_field_t NMICR_f;
    };
    union
    {
        __IO uint32_t NMIER;
        stc_intc_nmier_field_t NMIER_f;
    };
    union
    {
        __IO uint32_t NMIFR;
        stc_intc_nmifr_field_t NMIFR_f;
    };
    union
    {
        __IO uint32_t NMICLR;
        stc_intc_nmiclr_field_t NMICLR_f;
    };
    uint8_t RESERVED0[16];
    union
    {
        __IO uint32_t EVTER;
        stc_intc_evter_field_t EVTER_f;
    };
    union
    {
        __IO uint32_t EKEYCR;
        stc_intc_ekeycr_field_t EKEYCR_f;
    };
    uint8_t RESERVED1[20];
    union
    {
        __IO uint32_t FPRCR;
        stc_intc_fprcr_field_t FPRCR_f;
    };
    union
    {
        __IO uint32_t EIRQCR0;
        stc_intc_eirqcr_field_t EIRQCR0_f;
    };
    union
    {
        __IO uint32_t EIRQCR1;
        stc_intc_eirqcr_field_t EIRQCR1_f;
    };
    union
    {
        __IO uint32_t EIRQCR2;
        stc_intc_eirqcr_field_t EIRQCR2_f;
    };
    union
    {
        __IO uint32_t EIRQCR3;
        stc_intc_eirqcr_field_t EIRQCR3_f;
    };
    union
    {
        __IO uint32_t EIRQCR4;
        stc_intc_eirqcr_field_t EIRQCR4_f;
    };
    union
    {
        __IO uint32_t EIRQCR5;
        stc_intc_eirqcr_field_t EIRQCR5_f;
    };
    union
    {
        __IO uint32_t EIRQCR6;
        stc_intc_eirqcr_field_t EIRQCR6_f;
    };
    union
    {
        __IO uint32_t EIRQCR7;
        stc_intc_eirqcr_field_t EIRQCR7_f;
    };
    union
    {
        __IO uint32_t EIRQCR8;
        stc_intc_eirqcr_field_t EIRQCR8_f;
    };
    union
    {
        __IO uint32_t EIRQCR9;
        stc_intc_eirqcr_field_t EIRQCR9_f;
    };
    uint8_t RESERVED2[8];
    union
    {
        __IO uint32_t WUPENR;
        stc_intc_wupenr_field_t WUPENR_f;
    };
    union
    {
        __IO uint32_t EIRQFR;
        stc_intc_eirqfr_field_t EIRQFR_f;
    };
    union
    {
        __IO uint32_t EIRQCLR;
        stc_intc_eirqclr_field_t EIRQCLR_f;
    };
    uint8_t RESERVED3[36];
    union
    {
        __IO uint32_t ISELAR8;
        stc_intc_iselar_field_t ISELAR8_f;
    };
    union
    {
        __IO uint32_t ISELAR9;
        stc_intc_iselar_field_t ISELAR9_f;
    };
    union
    {
        __IO uint32_t ISELAR10;
        stc_intc_iselar_field_t ISELAR10_f;
    };
    union
    {
        __IO uint32_t ISELAR11;
        stc_intc_iselar_field_t ISELAR11_f;
    };
    union
    {
        __IO uint32_t ISELAR12;
        stc_intc_iselar_field_t ISELAR12_f;
    };
    union
    {
        __IO uint32_t ISELAR13;
        stc_intc_iselar_field_t ISELAR13_f;
    };
    union
    {
        __IO uint32_t ISELAR14;
        stc_intc_iselar_field_t ISELAR14_f;
    };
    union
    {
        __IO uint32_t ISELAR15;
        stc_intc_iselar_field_t ISELAR15_f;
    };
    union
    {
        __IO uint32_t ISELAR16;
        stc_intc_iselar_field_t ISELAR16_f;
    };
    union
    {
        __IO uint32_t ISELAR17;
        stc_intc_iselar_field_t ISELAR17_f;
    };
    union
    {
        __IO uint32_t ISELAR18;
        stc_intc_iselar_field_t ISELAR18_f;
    };
    union
    {
        __IO uint32_t ISELAR19;
        stc_intc_iselar_field_t ISELAR19_f;
    };
    union
    {
        __IO uint32_t ISELAR20;
        stc_intc_iselar_field_t ISELAR20_f;
    };
    union
    {
        __IO uint32_t ISELAR21;
        stc_intc_iselar_field_t ISELAR21_f;
    };
    union
    {
        __IO uint32_t ISELAR22;
        stc_intc_iselar_field_t ISELAR22_f;
    };
    union
    {
        __IO uint32_t ISELAR23;
        stc_intc_iselar_field_t ISELAR23_f;
    };
    union
    {
        __IO uint32_t ISELBR24;
        stc_intc_iselbr_field_t ISELBR24_f;
    };
    union
    {
        __IO uint32_t ISELBR25;
        stc_intc_iselbr_field_t ISELBR25_f;
    };
    union
    {
        __IO uint32_t ISELBR26;
        stc_intc_iselbr_field_t ISELBR26_f;
    };
    union
    {
        __IO uint32_t ISELBR27;
        stc_intc_iselbr_field_t ISELBR27_f;
    };
    union
    {
        __IO uint32_t ISELBR28;
        stc_intc_iselbr_field_t ISELBR28_f;
    };
    union
    {
        __IO uint32_t ISELBR29;
        stc_intc_iselbr_field_t ISELBR29_f;
    };
    union
    {
        __IO uint32_t ISELBR30;
        stc_intc_iselbr_field_t ISELBR30_f;
    };
    union
    {
        __IO uint32_t ISELBR31;
        stc_intc_iselbr_field_t ISELBR31_f;
    };
} M0P_INTC_TypeDef;

/**
 * @brief PORT
 */
typedef struct
{
    union
    {
        __IO uint8_t PIDR0;
        stc_port_pidr0_field_t PIDR0_f;
    };
    union
    {
        __IO uint8_t PIDR1;
        stc_port_pidr1_field_t PIDR1_f;
    };
    union
    {
        __IO uint8_t PIDR2;
        stc_port_pidr2_field_t PIDR2_f;
    };
    union
    {
        __IO uint8_t PIDR3;
        stc_port_pidr3_field_t PIDR3_f;
    };
    union
    {
        __IO uint8_t PIDR4;
        stc_port_pidr4_field_t PIDR4_f;
    };
    union
    {
        __IO uint8_t PIDR5;
        stc_port_pidr5_field_t PIDR5_f;
    };
    union
    {
        __IO uint8_t PIDR6;
        stc_port_pidr6_field_t PIDR6_f;
    };
    union
    {
        __IO uint8_t PIDR7;
        stc_port_pidr7_field_t PIDR7_f;
    };
    uint8_t RESERVED0[4];
    union
    {
        __IO uint8_t PIDR12;
        stc_port_pidr12_field_t PIDR12_f;
    };
    union
    {
        __IO uint8_t PIDR13;
        stc_port_pidr13_field_t PIDR13_f;
    };
    union
    {
        __IO uint8_t PIDR14;
        stc_port_pidr14_field_t PIDR14_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint8_t PODR0;
        stc_port_podr0_field_t PODR0_f;
    };
    union
    {
        __IO uint8_t PODR1;
        stc_port_podr1_field_t PODR1_f;
    };
    union
    {
        __IO uint8_t PODR2;
        stc_port_podr2_field_t PODR2_f;
    };
    union
    {
        __IO uint8_t PODR3;
        stc_port_podr3_field_t PODR3_f;
    };
    union
    {
        __IO uint8_t PODR4;
        stc_port_podr4_field_t PODR4_f;
    };
    union
    {
        __IO uint8_t PODR5;
        stc_port_podr5_field_t PODR5_f;
    };
    union
    {
        __IO uint8_t PODR6;
        stc_port_podr6_field_t PODR6_f;
    };
    union
    {
        __IO uint8_t PODR7;
        stc_port_podr7_field_t PODR7_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint8_t PODR12;
        stc_port_podr12_field_t PODR12_f;
    };
    union
    {
        __IO uint8_t PODR13;
        stc_port_podr13_field_t PODR13_f;
    };
    union
    {
        __IO uint8_t PODR14;
        stc_port_podr14_field_t PODR14_f;
    };
    uint8_t RESERVED3[1];
    union
    {
        __IO uint8_t POER0;
        stc_port_poer0_field_t POER0_f;
    };
    union
    {
        __IO uint8_t POER1;
        stc_port_poer1_field_t POER1_f;
    };
    union
    {
        __IO uint8_t POER2;
        stc_port_poer2_field_t POER2_f;
    };
    union
    {
        __IO uint8_t POER3;
        stc_port_poer3_field_t POER3_f;
    };
    union
    {
        __IO uint8_t POER4;
        stc_port_poer4_field_t POER4_f;
    };
    union
    {
        __IO uint8_t POER5;
        stc_port_poer5_field_t POER5_f;
    };
    union
    {
        __IO uint8_t POER6;
        stc_port_poer6_field_t POER6_f;
    };
    union
    {
        __IO uint8_t POER7;
        stc_port_poer7_field_t POER7_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint8_t POER12;
        stc_port_poer12_field_t POER12_f;
    };
    union
    {
        __IO uint8_t POER13;
        stc_port_poer13_field_t POER13_f;
    };
    union
    {
        __IO uint8_t POER14;
        stc_port_poer14_field_t POER14_f;
    };
    uint8_t RESERVED5[1];
    union
    {
        __IO uint8_t POSR0;
        stc_port_posr0_field_t POSR0_f;
    };
    union
    {
        __IO uint8_t POSR1;
        stc_port_posr1_field_t POSR1_f;
    };
    union
    {
        __IO uint8_t POSR2;
        stc_port_posr2_field_t POSR2_f;
    };
    union
    {
        __IO uint8_t POSR3;
        stc_port_posr3_field_t POSR3_f;
    };
    union
    {
        __IO uint8_t POSR4;
        stc_port_posr4_field_t POSR4_f;
    };
    union
    {
        __IO uint8_t POSR5;
        stc_port_posr5_field_t POSR5_f;
    };
    union
    {
        __IO uint8_t POSR6;
        stc_port_posr6_field_t POSR6_f;
    };
    union
    {
        __IO uint8_t POSR7;
        stc_port_posr7_field_t POSR7_f;
    };
    uint8_t RESERVED6[4];
    union
    {
        __IO uint8_t POSR12;
        stc_port_posr12_field_t POSR12_f;
    };
    union
    {
        __IO uint8_t POSR13;
        stc_port_posr13_field_t POSR13_f;
    };
    union
    {
        __IO uint8_t POSR14;
        stc_port_posr14_field_t POSR14_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint8_t PORR0;
        stc_port_porr0_field_t PORR0_f;
    };
    union
    {
        __IO uint8_t PORR1;
        stc_port_porr1_field_t PORR1_f;
    };
    union
    {
        __IO uint8_t PORR2;
        stc_port_porr2_field_t PORR2_f;
    };
    union
    {
        __IO uint8_t PORR3;
        stc_port_porr3_field_t PORR3_f;
    };
    union
    {
        __IO uint8_t PORR4;
        stc_port_porr4_field_t PORR4_f;
    };
    union
    {
        __IO uint8_t PORR5;
        stc_port_porr5_field_t PORR5_f;
    };
    union
    {
        __IO uint8_t PORR6;
        stc_port_porr6_field_t PORR6_f;
    };
    union
    {
        __IO uint8_t PORR7;
        stc_port_porr7_field_t PORR7_f;
    };
    uint8_t RESERVED8[4];
    union
    {
        __IO uint8_t PORR12;
        stc_port_porr12_field_t PORR12_f;
    };
    union
    {
        __IO uint8_t PORR13;
        stc_port_porr13_field_t PORR13_f;
    };
    union
    {
        __IO uint8_t PORR14;
        stc_port_porr14_field_t PORR14_f;
    };
    uint8_t RESERVED9[1];
    union
    {
        __IO uint8_t POTR0;
        stc_port_potr0_field_t POTR0_f;
    };
    union
    {
        __IO uint8_t POTR1;
        stc_port_potr1_field_t POTR1_f;
    };
    union
    {
        __IO uint8_t POTR2;
        stc_port_potr2_field_t POTR2_f;
    };
    union
    {
        __IO uint8_t POTR3;
        stc_port_potr3_field_t POTR3_f;
    };
    union
    {
        __IO uint8_t POTR4;
        stc_port_potr4_field_t POTR4_f;
    };
    union
    {
        __IO uint8_t POTR5;
        stc_port_potr5_field_t POTR5_f;
    };
    union
    {
        __IO uint8_t POTR6;
        stc_port_potr6_field_t POTR6_f;
    };
    union
    {
        __IO uint8_t POTR7;
        stc_port_potr7_field_t POTR7_f;
    };
    uint8_t RESERVED10[4];
    union
    {
        __IO uint8_t POTR12;
        stc_port_potr12_field_t POTR12_f;
    };
    union
    {
        __IO uint8_t POTR13;
        stc_port_potr13_field_t POTR13_f;
    };
    union
    {
        __IO uint8_t POTR14;
        stc_port_potr14_field_t POTR14_f;
    };
    uint8_t RESERVED11[929];
    union
    {
        __IO uint16_t PCR00;
        stc_port_pcr_field_t PCR00_f;
    };
    union
    {
        __IO uint16_t PCR01;
        stc_port_pcr_field_t PCR01_f;
    };
    uint8_t RESERVED12[12];
    union
    {
        __IO uint16_t PCR10;
        stc_port_pcr_field_t PCR10_f;
    };
    union
    {
        __IO uint16_t PCR11;
        stc_port_pcr_field_t PCR11_f;
    };
    union
    {
        __IO uint16_t PCR12;
        stc_port_pcr_field_t PCR12_f;
    };
    union
    {
        __IO uint16_t PCR13;
        stc_port_pcr_field_t PCR13_f;
    };
    union
    {
        __IO uint16_t PCR14;
        stc_port_pcr_field_t PCR14_f;
    };
    union
    {
        __IO uint16_t PCR15;
        stc_port_pcr_field_t PCR15_f;
    };
    union
    {
        __IO uint16_t PCR16;
        stc_port_pcr_field_t PCR16_f;
    };
    union
    {
        __IO uint16_t PCR17;
        stc_port_pcr_field_t PCR17_f;
    };
    union
    {
        __IO uint16_t PCR20;
        stc_port_pcr_field_t PCR20_f;
    };
    union
    {
        __IO uint16_t PCR21;
        stc_port_pcr_field_t PCR21_f;
    };
    union
    {
        __IO uint16_t PCR22;
        stc_port_pcr_field_t PCR22_f;
    };
    union
    {
        __IO uint16_t PCR23;
        stc_port_pcr_field_t PCR23_f;
    };
    union
    {
        __IO uint16_t PCR24;
        stc_port_pcr_field_t PCR24_f;
    };
    union
    {
        __IO uint16_t PCR25;
        stc_port_pcr_field_t PCR25_f;
    };
    union
    {
        __IO uint16_t PCR26;
        stc_port_pcr_field_t PCR26_f;
    };
    union
    {
        __IO uint16_t PCR27;
        stc_port_pcr_field_t PCR27_f;
    };
    union
    {
        __IO uint16_t PCR30;
        stc_port_pcr_field_t PCR30_f;
    };
    union
    {
        __IO uint16_t PCR31;
        stc_port_pcr_field_t PCR31_f;
    };
    uint8_t RESERVED13[12];
    union
    {
        __IO uint16_t PCR40;
        stc_port_pcr_field_t PCR40_f;
    };
    union
    {
        __IO uint16_t PCR41;
        stc_port_pcr_field_t PCR41_f;
    };
    uint8_t RESERVED14[12];
    union
    {
        __IO uint16_t PCR50;
        stc_port_pcr_field_t PCR50_f;
    };
    union
    {
        __IO uint16_t PCR51;
        stc_port_pcr_field_t PCR51_f;
    };
    uint8_t RESERVED15[12];
    union
    {
        __IO uint16_t PCR60;
        stc_port_pcr_field_t PCR60_f;
    };
    union
    {
        __IO uint16_t PCR61;
        stc_port_pcr_field_t PCR61_f;
    };
    union
    {
        __IO uint16_t PCR62;
        stc_port_pcr_field_t PCR62_f;
    };
    union
    {
        __IO uint16_t PCR63;
        stc_port_pcr_field_t PCR63_f;
    };
    uint8_t RESERVED16[8];
    union
    {
        __IO uint16_t PCR70;
        stc_port_pcr_field_t PCR70_f;
    };
    union
    {
        __IO uint16_t PCR71;
        stc_port_pcr_field_t PCR71_f;
    };
    union
    {
        __IO uint16_t PCR72;
        stc_port_pcr_field_t PCR72_f;
    };
    union
    {
        __IO uint16_t PCR73;
        stc_port_pcr_field_t PCR73_f;
    };
    uint8_t RESERVED17[72];
    union
    {
        __IO uint16_t PCR120;
        stc_port_pcr_field_t PCR120_f;
    };
    union
    {
        __IO uint16_t PCR121;
        stc_port_pcr_field_t PCR121_f;
    };
    union
    {
        __IO uint16_t PCR122;
        stc_port_pcr_field_t PCR122_f;
    };
    union
    {
        __IO uint16_t PCR123;
        stc_port_pcr_field_t PCR123_f;
    };
    union
    {
        __IO uint16_t PCR124;
        stc_port_pcr_field_t PCR124_f;
    };
    uint8_t RESERVED18[20];
    union
    {
        __IO uint16_t PCR137;
        stc_port_pcr_field_t PCR137_f;
    };
    uint8_t RESERVED19[12];
    union
    {
        __IO uint16_t PCR146;
        stc_port_pcr_field_t PCR146_f;
    };
    union
    {
        __IO uint16_t PCR147;
        stc_port_pcr_field_t PCR147_f;
    };
    uint8_t RESERVED20[16];
    union
    {
        __IO uint16_t PSPCR;
        stc_port_pspcr_field_t PSPCR_f;
    };
    uint8_t RESERVED21[2];
    union
    {
        __IO uint16_t PCCR;
        stc_port_pccr_field_t PCCR_f;
    };
    union
    {
        __IO uint16_t PINAER;
        stc_port_pinaer_field_t PINAER_f;
    };
    union
    {
        __IO uint16_t PWPR;
        stc_port_pwpr_field_t PWPR_f;
    };
} M0P_PORT_TypeDef;

/**
 * @brief PWC
 */
typedef struct
{
    union
    {
        __IO uint8_t STPMCR;
        stc_pwc_stpmcr_field_t STPMCR_f;
    };
    uint8_t RESERVED0[3];
    union
    {
        __IO uint8_t PWRC;
        stc_pwc_pwrc_field_t PWRC_f;
    };
    uint8_t RESERVED1[7];
    union
    {
        __IO uint8_t RAMCR;
        stc_pwc_ramcr_field_t RAMCR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t LVDCSR;
        stc_pwc_lvdcsr_field_t LVDCSR_f;
    };
    uint8_t RESERVED3[15];
    union
    {
        __IO uint16_t FPRC;
        stc_pwc_fprc_field_t FPRC_f;
    };
    uint8_t RESERVED4[30];
    union
    {
        __IO uint8_t DBGC;
        stc_pwc_dbgc_field_t DBGC_f;
    };
} M0P_PWC_TypeDef;

/**
 * @brief RMU
 */
typedef struct
{
    union
    {
        __IO uint16_t RSTF0;
        stc_rmu_rstf0_field_t RSTF0_f;
    };
} M0P_RMU_TypeDef;

