hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*******************************************************************************
                Bit definition for Peripheral ADC
*******************************************************************************/
/*  Bit definition for ADC_STR register  */
#define ADC_STR_STRT_POS                     (0U)
#define ADC_STR_STRT                         ((uint8_t)0x01U)

/*  Bit definition for ADC_CR0 register  */
#define ADC_CR0_MS_POS                       (0U)
#define ADC_CR0_MS                           ((uint16_t)0x0003U)
#define ADC_CR0_MS_0                         ((uint16_t)0x0001U)
#define ADC_CR0_MS_1                         ((uint16_t)0x0002U)
#define ADC_CR0_ACCSEL_POS                   (4U)
#define ADC_CR0_ACCSEL                       ((uint16_t)0x0030U)
#define ADC_CR0_ACCSEL_0                     ((uint16_t)0x0010U)
#define ADC_CR0_ACCSEL_1                     ((uint16_t)0x0020U)
#define ADC_CR0_CLREN_POS                    (6U)
#define ADC_CR0_CLREN                        ((uint16_t)0x0040U)
#define ADC_CR0_DFMT_POS                     (7U)
#define ADC_CR0_DFMT                         ((uint16_t)0x0080U)

/*  Bit definition for ADC_CR1 register  */
#define ADC_CR1_RSCHSEL_POS                  (2U)
#define ADC_CR1_RSCHSEL                      ((uint16_t)0x0004U)

/*  Bit definition for ADC_TRGSR register  */
#define ADC_TRGSR_TRGSELA_POS                (0U)
#define ADC_TRGSR_TRGSELA                    ((uint16_t)0x0003U)
#define ADC_TRGSR_TRGSELA_0                  ((uint16_t)0x0001U)
#define ADC_TRGSR_TRGSELA_1                  ((uint16_t)0x0002U)
#define ADC_TRGSR_TRGENA_POS                 (7U)
#define ADC_TRGSR_TRGENA                     ((uint16_t)0x0080U)
#define ADC_TRGSR_TRGSELB_POS                (8U)
#define ADC_TRGSR_TRGSELB                    ((uint16_t)0x0300U)
#define ADC_TRGSR_TRGSELB_0                  ((uint16_t)0x0100U)
#define ADC_TRGSR_TRGSELB_1                  ((uint16_t)0x0200U)
#define ADC_TRGSR_TRGENB_POS                 (15U)
#define ADC_TRGSR_TRGENB                     ((uint16_t)0x8000U)

/*  Bit definition for ADC_CHSELRA0 register  */
#define ADC_CHSELRA0_CHSELA_POS              (0U)
#define ADC_CHSELRA0_CHSELA                  ((uint16_t)0x0FFFU)
#define ADC_CHSELRA0_CHSELA_0                ((uint16_t)0x0001U)
#define ADC_CHSELRA0_CHSELA_1                ((uint16_t)0x0002U)
#define ADC_CHSELRA0_CHSELA_2                ((uint16_t)0x0004U)
#define ADC_CHSELRA0_CHSELA_3                ((uint16_t)0x0008U)
#define ADC_CHSELRA0_CHSELA_4                ((uint16_t)0x0010U)
#define ADC_CHSELRA0_CHSELA_5                ((uint16_t)0x0020U)
#define ADC_CHSELRA0_CHSELA_6                ((uint16_t)0x0040U)
#define ADC_CHSELRA0_CHSELA_7                ((uint16_t)0x0080U)
#define ADC_CHSELRA0_CHSELA_8                ((uint16_t)0x0100U)
#define ADC_CHSELRA0_CHSELA_9                ((uint16_t)0x0200U)
#define ADC_CHSELRA0_CHSELA_10               ((uint16_t)0x0400U)
#define ADC_CHSELRA0_CHSELA_11               ((uint16_t)0x0800U)

/*  Bit definition for ADC_CHSELRB0 register  */
#define ADC_CHSELRB0_CHSELB_POS              (0U)
#define ADC_CHSELRB0_CHSELB                  ((uint16_t)0x0FFFU)
#define ADC_CHSELRB0_CHSELB_0                ((uint16_t)0x0001U)
#define ADC_CHSELRB0_CHSELB_1                ((uint16_t)0x0002U)
#define ADC_CHSELRB0_CHSELB_2                ((uint16_t)0x0004U)
#define ADC_CHSELRB0_CHSELB_3                ((uint16_t)0x0008U)
#define ADC_CHSELRB0_CHSELB_4                ((uint16_t)0x0010U)
#define ADC_CHSELRB0_CHSELB_5                ((uint16_t)0x0020U)
#define ADC_CHSELRB0_CHSELB_6                ((uint16_t)0x0040U)
#define ADC_CHSELRB0_CHSELB_7                ((uint16_t)0x0080U)
#define ADC_CHSELRB0_CHSELB_8                ((uint16_t)0x0100U)
#define ADC_CHSELRB0_CHSELB_9                ((uint16_t)0x0200U)
#define ADC_CHSELRB0_CHSELB_10               ((uint16_t)0x0400U)
#define ADC_CHSELRB0_CHSELB_11               ((uint16_t)0x0800U)

/*  Bit definition for ADC_EXCHSELR register  */
#define ADC_EXCHSELR_EXCHSEL_POS             (0U)
#define ADC_EXCHSELR_EXCHSEL                 ((uint8_t)0x01U)

/*  Bit definition for ADC_SSTR register  */
#define ADC_SSTR_SSTR                        ((uint8_t)0xFFU)

/*  Bit definition for ADC_ISR register  */
#define ADC_ISR_EOCAF_POS                    (0U)
#define ADC_ISR_EOCAF                        ((uint8_t)0x01U)
#define ADC_ISR_EOCBF_POS                    (1U)
#define ADC_ISR_EOCBF                        ((uint8_t)0x02U)

/*  Bit definition for ADC_ICR register  */
#define ADC_ICR_EOCAIEN_POS                  (0U)
#define ADC_ICR_EOCAIEN                      ((uint8_t)0x01U)
#define ADC_ICR_EOCBIEN_POS                  (1U)
#define ADC_ICR_EOCBIEN                      ((uint8_t)0x02U)

/*  Bit definition for ADC_ISCLRR register  */
#define ADC_ISCLRR_CLREOCAF_POS              (0U)
#define ADC_ISCLRR_CLREOCAF                  ((uint8_t)0x01U)
#define ADC_ISCLRR_CLREOCBF_POS              (1U)
#define ADC_ISCLRR_CLREOCBF                  ((uint8_t)0x02U)

/*  Bit definition for ADC_DR0 register  */
#define ADC_DR0_DR0                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR1 register  */
#define ADC_DR1_DR1                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR2 register  */
#define ADC_DR2_DR2                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR3 register  */
#define ADC_DR3_DR3                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR4 register  */
#define ADC_DR4_DR4                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR5 register  */
#define ADC_DR5_DR5                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR6 register  */
#define ADC_DR6_DR6                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR7 register  */
#define ADC_DR7_DR7                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR8 register  */
#define ADC_DR8_DR8                          ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR9 register  */
#define ADC_DR9_DR9                          ((uint16_t)0xFFFFU)

