hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for ADC_DR10 register  */
#define ADC_DR10_DR10                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR11 register  */
#define ADC_DR11_DR11                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWDCR register  */
#define ADC_AWDCR_AWD0EN_POS                 (0U)
#define ADC_AWDCR_AWD0EN                     ((uint16_t)0x0001U)
#define ADC_AWDCR_AWD0IEN_POS                (1U)
#define ADC_AWDCR_AWD0IEN                    ((uint16_t)0x0002U)
#define ADC_AWDCR_AWD0MD_POS                 (2U)
#define ADC_AWDCR_AWD0MD                     ((uint16_t)0x0004U)
#define ADC_AWDCR_AWD1EN_POS                 (4U)
#define ADC_AWDCR_AWD1EN                     ((uint16_t)0x0010U)
#define ADC_AWDCR_AWD1IEN_POS                (5U)
#define ADC_AWDCR_AWD1IEN                    ((uint16_t)0x0020U)
#define ADC_AWDCR_AWD1MD_POS                 (6U)
#define ADC_AWDCR_AWD1MD                     ((uint16_t)0x0040U)
#define ADC_AWDCR_AWDCM_POS                  (8U)
#define ADC_AWDCR_AWDCM                      ((uint16_t)0x0300U)
#define ADC_AWDCR_AWDCM_0                    ((uint16_t)0x0100U)
#define ADC_AWDCR_AWDCM_1                    ((uint16_t)0x0200U)

/*  Bit definition for ADC_AWDSR register  */
#define ADC_AWDSR_AWD0F_POS                  (0U)
#define ADC_AWDSR_AWD0F                      ((uint8_t)0x01U)
#define ADC_AWDSR_AWD1F_POS                  (1U)
#define ADC_AWDSR_AWD1F                      ((uint8_t)0x02U)
#define ADC_AWDSR_AWDCMF_POS                 (4U)
#define ADC_AWDSR_AWDCMF                     ((uint8_t)0x10U)

/*  Bit definition for ADC_AWDSCLRR register  */
#define ADC_AWDSCLRR_CLRAWD0F_POS            (0U)
#define ADC_AWDSCLRR_CLRAWD0F                ((uint8_t)0x01U)
#define ADC_AWDSCLRR_CLRAWD1F_POS            (1U)
#define ADC_AWDSCLRR_CLRAWD1F                ((uint8_t)0x02U)
#define ADC_AWDSCLRR_CLRAWDCMF_POS           (4U)
#define ADC_AWDSCLRR_CLRAWDCMF               ((uint8_t)0x10U)

/*  Bit definition for ADC_AWD0DR0 register  */
#define ADC_AWD0DR0_AWD0DR0                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD0DR1 register  */
#define ADC_AWD0DR1_AWD0DR1                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD0CHSR register  */
#define ADC_AWD0CHSR_AWDCH_POS               (0U)
#define ADC_AWD0CHSR_AWDCH                   ((uint8_t)0x1FU)
#define ADC_AWD0CHSR_AWDCH_0                 ((uint8_t)0x01U)
#define ADC_AWD0CHSR_AWDCH_1                 ((uint8_t)0x02U)
#define ADC_AWD0CHSR_AWDCH_2                 ((uint8_t)0x04U)
#define ADC_AWD0CHSR_AWDCH_3                 ((uint8_t)0x08U)
#define ADC_AWD0CHSR_AWDCH_4                 ((uint8_t)0x10U)

/*  Bit definition for ADC_AWD1DR0 register  */
#define ADC_AWD1DR0_AWD1DR0                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD1DR1 register  */
#define ADC_AWD1DR1_AWD1DR1                  ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_AWD1CHSR register  */
#define ADC_AWD1CHSR_AWDCH_POS               (0U)
#define ADC_AWD1CHSR_AWDCH                   ((uint8_t)0x1FU)
#define ADC_AWD1CHSR_AWDCH_0                 ((uint8_t)0x01U)
#define ADC_AWD1CHSR_AWDCH_1                 ((uint8_t)0x02U)
#define ADC_AWD1CHSR_AWDCH_2                 ((uint8_t)0x04U)
#define ADC_AWD1CHSR_AWDCH_3                 ((uint8_t)0x08U)
#define ADC_AWD1CHSR_AWDCH_4                 ((uint8_t)0x10U)


/*******************************************************************************
                Bit definition for Peripheral AOS
*******************************************************************************/
/*  Bit definition for AOS_INTC_STRGCR register  */
#define AOS_INTC_STRGCR_STRG_POS             (0U)
#define AOS_INTC_STRGCR_STRG                 ((uint32_t)0x00000001U)

/*  Bit definition for AOS_TMR0_HTSSR register  */
#define AOS_TMR0_HTSSR_TRGSEL_POS            (0U)
#define AOS_TMR0_HTSSR_TRGSEL                ((uint32_t)0x0000007FU)
#define AOS_TMR0_HTSSR_TRGSEL_0              ((uint32_t)0x00000001U)
#define AOS_TMR0_HTSSR_TRGSEL_1              ((uint32_t)0x00000002U)
#define AOS_TMR0_HTSSR_TRGSEL_2              ((uint32_t)0x00000004U)
#define AOS_TMR0_HTSSR_TRGSEL_3              ((uint32_t)0x00000008U)
#define AOS_TMR0_HTSSR_TRGSEL_4              ((uint32_t)0x00000010U)
#define AOS_TMR0_HTSSR_TRGSEL_5              ((uint32_t)0x00000020U)
#define AOS_TMR0_HTSSR_TRGSEL_6              ((uint32_t)0x00000040U)

/*  Bit definition for AOS_TMRB_HTSSR register  */
#define AOS_TMRB_HTSSR_TRGSEL_POS            (0U)
#define AOS_TMRB_HTSSR_TRGSEL                ((uint32_t)0x0000007FU)
#define AOS_TMRB_HTSSR_TRGSEL_0              ((uint32_t)0x00000001U)
#define AOS_TMRB_HTSSR_TRGSEL_1              ((uint32_t)0x00000002U)
#define AOS_TMRB_HTSSR_TRGSEL_2              ((uint32_t)0x00000004U)
#define AOS_TMRB_HTSSR_TRGSEL_3              ((uint32_t)0x00000008U)
#define AOS_TMRB_HTSSR_TRGSEL_4              ((uint32_t)0x00000010U)
#define AOS_TMRB_HTSSR_TRGSEL_5              ((uint32_t)0x00000020U)
#define AOS_TMRB_HTSSR_TRGSEL_6              ((uint32_t)0x00000040U)

/*  Bit definition for AOS_ADC_ITRGSELR0 register  */
#define AOS_ADC_ITRGSELR0_TRGSEL_POS         (0U)
#define AOS_ADC_ITRGSELR0_TRGSEL             ((uint32_t)0x0000007FU)
#define AOS_ADC_ITRGSELR0_TRGSEL_0           ((uint32_t)0x00000001U)
#define AOS_ADC_ITRGSELR0_TRGSEL_1           ((uint32_t)0x00000002U)
#define AOS_ADC_ITRGSELR0_TRGSEL_2           ((uint32_t)0x00000004U)
#define AOS_ADC_ITRGSELR0_TRGSEL_3           ((uint32_t)0x00000008U)
#define AOS_ADC_ITRGSELR0_TRGSEL_4           ((uint32_t)0x00000010U)
#define AOS_ADC_ITRGSELR0_TRGSEL_5           ((uint32_t)0x00000020U)
#define AOS_ADC_ITRGSELR0_TRGSEL_6           ((uint32_t)0x00000040U)

/*  Bit definition for AOS_ADC_ITRGSELR1 register  */
#define AOS_ADC_ITRGSELR1_TRGSEL_POS         (0U)
#define AOS_ADC_ITRGSELR1_TRGSEL             ((uint32_t)0x0000007FU)
#define AOS_ADC_ITRGSELR1_TRGSEL_0           ((uint32_t)0x00000001U)
#define AOS_ADC_ITRGSELR1_TRGSEL_1           ((uint32_t)0x00000002U)
#define AOS_ADC_ITRGSELR1_TRGSEL_2           ((uint32_t)0x00000004U)
#define AOS_ADC_ITRGSELR1_TRGSEL_3           ((uint32_t)0x00000008U)
#define AOS_ADC_ITRGSELR1_TRGSEL_4           ((uint32_t)0x00000010U)
#define AOS_ADC_ITRGSELR1_TRGSEL_5           ((uint32_t)0x00000020U)
#define AOS_ADC_ITRGSELR1_TRGSEL_6           ((uint32_t)0x00000040U)


