hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*******************************************************************************
                Bit definition for Peripheral CMU
*******************************************************************************/
/*  Bit definition for CMU_PERICKSEL register  */
#define CMU_PERICKSEL_PERICKSEL_POS          (0U)
#define CMU_PERICKSEL_PERICKSEL              ((uint8_t)0x07U)
#define CMU_PERICKSEL_PERICKSEL_0            ((uint8_t)0x01U)
#define CMU_PERICKSEL_PERICKSEL_1            ((uint8_t)0x02U)
#define CMU_PERICKSEL_PERICKSEL_2            ((uint8_t)0x04U)

/*  Bit definition for CMU_XTALSTDSR register  */
#define CMU_XTALSTDSR_XTALSTDF_POS           (0U)
#define CMU_XTALSTDSR_XTALSTDF               ((uint8_t)0x01U)

/*  Bit definition for CMU_SCKDIVR register  */
#define CMU_SCKDIVR_SCKDIV_POS               (0U)
#define CMU_SCKDIVR_SCKDIV                   ((uint8_t)0x07U)
#define CMU_SCKDIVR_SCKDIV_0                 ((uint8_t)0x01U)
#define CMU_SCKDIVR_SCKDIV_1                 ((uint8_t)0x02U)
#define CMU_SCKDIVR_SCKDIV_2                 ((uint8_t)0x04U)

/*  Bit definition for CMU_CKSWR register  */
#define CMU_CKSWR_CKSW_POS                   (0U)
#define CMU_CKSWR_CKSW                       ((uint8_t)0x03U)
#define CMU_CKSWR_CKSW_0                     ((uint8_t)0x01U)
#define CMU_CKSWR_CKSW_1                     ((uint8_t)0x02U)

/*  Bit definition for CMU_XTALCR register  */
#define CMU_XTALCR_XTALSTP_POS               (0U)
#define CMU_XTALCR_XTALSTP                   ((uint8_t)0x01U)

/*  Bit definition for CMU_XTALCFGR register  */
#define CMU_XTALCFGR_XTALDRV_POS             (4U)
#define CMU_XTALCFGR_XTALDRV                 ((uint8_t)0x30U)
#define CMU_XTALCFGR_XTALDRV_0               ((uint8_t)0x10U)
#define CMU_XTALCFGR_XTALDRV_1               ((uint8_t)0x20U)
#define CMU_XTALCFGR_XTALMS_POS              (6U)
#define CMU_XTALCFGR_XTALMS                  ((uint8_t)0x40U)
#define CMU_XTALCFGR_SUPDRV_POS              (7U)
#define CMU_XTALCFGR_SUPDRV                  ((uint8_t)0x80U)

/*  Bit definition for CMU_XTALSTBCR register  */
#define CMU_XTALSTBCR_XTALSTB_POS            (0U)
#define CMU_XTALSTBCR_XTALSTB                ((uint8_t)0x07U)
#define CMU_XTALSTBCR_XTALSTB_0              ((uint8_t)0x01U)
#define CMU_XTALSTBCR_XTALSTB_1              ((uint8_t)0x02U)
#define CMU_XTALSTBCR_XTALSTB_2              ((uint8_t)0x04U)

/*  Bit definition for CMU_HRCCR register  */
#define CMU_HRCCR_HRCSTP_POS                 (0U)
#define CMU_HRCCR_HRCSTP                     ((uint8_t)0x01U)

/*  Bit definition for CMU_OSCSTBSR register  */
#define CMU_OSCSTBSR_HRCSTBF_POS             (0U)
#define CMU_OSCSTBSR_HRCSTBF                 ((uint8_t)0x01U)
#define CMU_OSCSTBSR_XTALSTBF_POS            (3U)
#define CMU_OSCSTBSR_XTALSTBF                ((uint8_t)0x08U)
#define CMU_OSCSTBSR_XTAL32STBF_POS          (4U)
#define CMU_OSCSTBSR_XTAL32STBF              ((uint8_t)0x10U)

/*  Bit definition for CMU_MCO1CFGR register  */
#define CMU_MCO1CFGR_MCO1SEL_POS             (0U)
#define CMU_MCO1CFGR_MCO1SEL                 ((uint8_t)0x0FU)
#define CMU_MCO1CFGR_MCO1SEL_0               ((uint8_t)0x01U)
#define CMU_MCO1CFGR_MCO1SEL_1               ((uint8_t)0x02U)
#define CMU_MCO1CFGR_MCO1SEL_2               ((uint8_t)0x04U)
#define CMU_MCO1CFGR_MCO1SEL_3               ((uint8_t)0x08U)
#define CMU_MCO1CFGR_MCO1DIV_POS             (4U)
#define CMU_MCO1CFGR_MCO1DIV                 ((uint8_t)0x70U)
#define CMU_MCO1CFGR_MCO1DIV_0               ((uint8_t)0x10U)
#define CMU_MCO1CFGR_MCO1DIV_1               ((uint8_t)0x20U)
#define CMU_MCO1CFGR_MCO1DIV_2               ((uint8_t)0x40U)
#define CMU_MCO1CFGR_MCO1EN_POS              (7U)
#define CMU_MCO1CFGR_MCO1EN                  ((uint8_t)0x80U)

/*  Bit definition for CMU_XTALSTDCR register  */
#define CMU_XTALSTDCR_XTALSTDIE_POS          (0U)
#define CMU_XTALSTDCR_XTALSTDIE              ((uint8_t)0x01U)
#define CMU_XTALSTDCR_XTALSTDRE_POS          (1U)
#define CMU_XTALSTDCR_XTALSTDRE              ((uint8_t)0x02U)
#define CMU_XTALSTDCR_XTALSTDRIS_POS         (2U)
#define CMU_XTALSTDCR_XTALSTDRIS             ((uint8_t)0x04U)
#define CMU_XTALSTDCR_XTALSTDE_POS           (7U)
#define CMU_XTALSTDCR_XTALSTDE               ((uint8_t)0x80U)

/*  Bit definition for CMU_FCG register  */
#define CMU_FCG_ADC_POS                      (0U)
#define CMU_FCG_ADC                          ((uint32_t)0x00000001U)
#define CMU_FCG_CTC_POS                      (1U)
#define CMU_FCG_CTC                          ((uint32_t)0x00000002U)
#define CMU_FCG_AOS_POS                      (4U)
#define CMU_FCG_AOS                          ((uint32_t)0x00000010U)
#define CMU_FCG_CRC_POS                      (7U)
#define CMU_FCG_CRC                          ((uint32_t)0x00000080U)
#define CMU_FCG_TIMB1_POS                    (8U)
#define CMU_FCG_TIMB1                        ((uint32_t)0x00000100U)
#define CMU_FCG_TIMB2_POS                    (9U)
#define CMU_FCG_TIMB2                        ((uint32_t)0x00000200U)
#define CMU_FCG_TIMB3_POS                    (10U)
#define CMU_FCG_TIMB3                        ((uint32_t)0x00000400U)
#define CMU_FCG_TIMB4_POS                    (11U)
#define CMU_FCG_TIMB4                        ((uint32_t)0x00000800U)
#define CMU_FCG_TIMB5_POS                    (12U)
#define CMU_FCG_TIMB5                        ((uint32_t)0x00001000U)
#define CMU_FCG_TIMB6_POS                    (13U)
#define CMU_FCG_TIMB6                        ((uint32_t)0x00002000U)
#define CMU_FCG_TIMB7_POS                    (14U)
#define CMU_FCG_TIMB7                        ((uint32_t)0x00004000U)
#define CMU_FCG_TIMB8_POS                    (15U)
#define CMU_FCG_TIMB8                        ((uint32_t)0x00008000U)
#define CMU_FCG_TIM0_POS                     (16U)
#define CMU_FCG_TIM0                         ((uint32_t)0x00010000U)
#define CMU_FCG_RTC_POS                      (23U)
#define CMU_FCG_RTC                          ((uint32_t)0x00800000U)
#define CMU_FCG_UART1_POS                    (24U)
#define CMU_FCG_UART1                        ((uint32_t)0x01000000U)
#define CMU_FCG_UART2_POS                    (25U)
#define CMU_FCG_UART2                        ((uint32_t)0x02000000U)
#define CMU_FCG_UART3_POS                    (26U)
#define CMU_FCG_UART3                        ((uint32_t)0x04000000U)
#define CMU_FCG_UART4_POS                    (27U)
#define CMU_FCG_UART4                        ((uint32_t)0x08000000U)
#define CMU_FCG_IIC_POS                      (28U)
#define CMU_FCG_IIC                          ((uint32_t)0x10000000U)
#define CMU_FCG_SPI_POS                      (29U)
#define CMU_FCG_SPI                          ((uint32_t)0x20000000U)

