hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for CMU_XTAL32CR register  */
#define CMU_XTAL32CR_XTAL32STP_POS           (0U)
#define CMU_XTAL32CR_XTAL32STP               ((uint8_t)0x01U)

/*  Bit definition for CMU_XTAL32CFGR register  */
#define CMU_XTAL32CFGR_XTAL32DRV_POS         (0U)
#define CMU_XTAL32CFGR_XTAL32DRV             ((uint8_t)0x03U)
#define CMU_XTAL32CFGR_XTAL32DRV_0           ((uint8_t)0x01U)
#define CMU_XTAL32CFGR_XTAL32DRV_1           ((uint8_t)0x02U)
#define CMU_XTAL32CFGR_XTAL32SUPDRV_POS      (2U)
#define CMU_XTAL32CFGR_XTAL32SUPDRV          ((uint8_t)0x04U)

/*  Bit definition for CMU_XTAL32NFR register  */
#define CMU_XTAL32NFR_XTAL32NF_POS           (0U)
#define CMU_XTAL32NFR_XTAL32NF               ((uint8_t)0x03U)
#define CMU_XTAL32NFR_XTAL32NF_0             ((uint8_t)0x01U)
#define CMU_XTAL32NFR_XTAL32NF_1             ((uint8_t)0x02U)

/*  Bit definition for CMU_LRCCR register  */
#define CMU_LRCCR_LRCSTP_POS                 (0U)
#define CMU_LRCCR_LRCSTP                     ((uint8_t)0x01U)


/*******************************************************************************
                Bit definition for Peripheral CRC
*******************************************************************************/
/*  Bit definition for CRC_CR register  */
#define CRC_CR_CR_POS                        (0U)
#define CRC_CR_CR                            ((uint32_t)0x00000001U)
#define CRC_CR_FLAG_POS                      (1U)
#define CRC_CR_FLAG                          ((uint32_t)0x00000002U)

/*  Bit definition for CRC_RESLT register  */
#define CRC_RESLT_RESLT                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT0 register  */
#define CRC_DAT0_DAT0                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT1 register  */
#define CRC_DAT1_DAT1                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT2 register  */
#define CRC_DAT2_DAT2                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT3 register  */
#define CRC_DAT3_DAT3                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT4 register  */
#define CRC_DAT4_DAT4                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT5 register  */
#define CRC_DAT5_DAT5                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT6 register  */
#define CRC_DAT6_DAT6                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT7 register  */
#define CRC_DAT7_DAT7                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT8 register  */
#define CRC_DAT8_DAT8                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT9 register  */
#define CRC_DAT9_DAT9                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT10 register  */
#define CRC_DAT10_DAT10                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT11 register  */
#define CRC_DAT11_DAT11                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT12 register  */
#define CRC_DAT12_DAT12                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT13 register  */
#define CRC_DAT13_DAT13                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT14 register  */
#define CRC_DAT14_DAT14                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT15 register  */
#define CRC_DAT15_DAT15                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT16 register  */
#define CRC_DAT16_DAT16                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT17 register  */
#define CRC_DAT17_DAT17                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT18 register  */
#define CRC_DAT18_DAT18                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT19 register  */
#define CRC_DAT19_DAT19                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT20 register  */
#define CRC_DAT20_DAT20                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT21 register  */
#define CRC_DAT21_DAT21                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT22 register  */
#define CRC_DAT22_DAT22                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT23 register  */
#define CRC_DAT23_DAT23                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT24 register  */
#define CRC_DAT24_DAT24                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT25 register  */
#define CRC_DAT25_DAT25                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT26 register  */
#define CRC_DAT26_DAT26                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT27 register  */
#define CRC_DAT27_DAT27                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT28 register  */
#define CRC_DAT28_DAT28                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT29 register  */
#define CRC_DAT29_DAT29                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT30 register  */
#define CRC_DAT30_DAT30                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT31 register  */
#define CRC_DAT31_DAT31                      ((uint32_t)0xFFFFFFFFU)


/*******************************************************************************
                Bit definition for Peripheral CTC
*******************************************************************************/
/*  Bit definition for CTC_CR1 register  */
#define CTC_CR1_REFPSC_POS                   (0U)
#define CTC_CR1_REFPSC                       ((uint32_t)0x00000007U)
#define CTC_CR1_REFPSC_0                     ((uint32_t)0x00000001U)
#define CTC_CR1_REFPSC_1                     ((uint32_t)0x00000002U)
#define CTC_CR1_REFPSC_2                     ((uint32_t)0x00000004U)
#define CTC_CR1_REFCKS_POS                   (4U)
#define CTC_CR1_REFCKS                       ((uint32_t)0x00000030U)
#define CTC_CR1_REFCKS_0                     ((uint32_t)0x00000010U)
#define CTC_CR1_REFCKS_1                     ((uint32_t)0x00000020U)
#define CTC_CR1_ERRIE_POS                    (6U)
#define CTC_CR1_ERRIE                        ((uint32_t)0x00000040U)
#define CTC_CR1_CTCEN_POS                    (7U)
#define CTC_CR1_CTCEN                        ((uint32_t)0x00000080U)
#define CTC_CR1_TRMVAL_POS                   (16U)
#define CTC_CR1_TRMVAL                       ((uint32_t)0x003F0000U)
#define CTC_CR1_TRMVAL_0                     ((uint32_t)0x00010000U)
#define CTC_CR1_TRMVAL_1                     ((uint32_t)0x00020000U)
#define CTC_CR1_TRMVAL_2                     ((uint32_t)0x00040000U)
#define CTC_CR1_TRMVAL_3                     ((uint32_t)0x00080000U)
#define CTC_CR1_TRMVAL_4                     ((uint32_t)0x00100000U)
#define CTC_CR1_TRMVAL_5                     ((uint32_t)0x00200000U)

