hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for CTC_CR2 register  */
#define CTC_CR2_OFSVAL_POS                   (0U)
#define CTC_CR2_OFSVAL                       ((uint32_t)0x000000FFU)
#define CTC_CR2_OFSVAL_0                     ((uint32_t)0x00000001U)
#define CTC_CR2_OFSVAL_1                     ((uint32_t)0x00000002U)
#define CTC_CR2_OFSVAL_2                     ((uint32_t)0x00000004U)
#define CTC_CR2_OFSVAL_3                     ((uint32_t)0x00000008U)
#define CTC_CR2_OFSVAL_4                     ((uint32_t)0x00000010U)
#define CTC_CR2_OFSVAL_5                     ((uint32_t)0x00000020U)
#define CTC_CR2_OFSVAL_6                     ((uint32_t)0x00000040U)
#define CTC_CR2_OFSVAL_7                     ((uint32_t)0x00000080U)
#define CTC_CR2_RLDVAL_POS                   (16U)
#define CTC_CR2_RLDVAL                       ((uint32_t)0xFFFF0000U)
#define CTC_CR2_RLDVAL_0                     ((uint32_t)0x00010000U)
#define CTC_CR2_RLDVAL_1                     ((uint32_t)0x00020000U)
#define CTC_CR2_RLDVAL_2                     ((uint32_t)0x00040000U)
#define CTC_CR2_RLDVAL_3                     ((uint32_t)0x00080000U)
#define CTC_CR2_RLDVAL_4                     ((uint32_t)0x00100000U)
#define CTC_CR2_RLDVAL_5                     ((uint32_t)0x00200000U)
#define CTC_CR2_RLDVAL_6                     ((uint32_t)0x00400000U)
#define CTC_CR2_RLDVAL_7                     ((uint32_t)0x00800000U)
#define CTC_CR2_RLDVAL_8                     ((uint32_t)0x01000000U)
#define CTC_CR2_RLDVAL_9                     ((uint32_t)0x02000000U)
#define CTC_CR2_RLDVAL_10                    ((uint32_t)0x04000000U)
#define CTC_CR2_RLDVAL_11                    ((uint32_t)0x08000000U)
#define CTC_CR2_RLDVAL_12                    ((uint32_t)0x10000000U)
#define CTC_CR2_RLDVAL_13                    ((uint32_t)0x20000000U)
#define CTC_CR2_RLDVAL_14                    ((uint32_t)0x40000000U)
#define CTC_CR2_RLDVAL_15                    ((uint32_t)0x80000000U)

/*  Bit definition for CTC_STR register  */
#define CTC_STR_TRIMOK_POS                   (0U)
#define CTC_STR_TRIMOK                       ((uint32_t)0x00000001U)
#define CTC_STR_TRMOVF_POS                   (1U)
#define CTC_STR_TRMOVF                       ((uint32_t)0x00000002U)
#define CTC_STR_TRMUDF_POS                   (2U)
#define CTC_STR_TRMUDF                       ((uint32_t)0x00000004U)
#define CTC_STR_CTCBSY_POS                   (3U)
#define CTC_STR_CTCBSY                       ((uint32_t)0x00000008U)


/*******************************************************************************
                Bit definition for Peripheral DBGC
*******************************************************************************/
/*  Bit definition for DBGC_MCUDBGSTAT register  */
#define DBGC_MCUDBGSTAT_CDBGPWRUPREQ_POS     (0U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPREQ         ((uint32_t)0x00000001U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPACK_POS     (1U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPACK         ((uint32_t)0x00000002U)

/*  Bit definition for DBGC_MCUSTPCTL register  */
#define DBGC_MCUSTPCTL_SWDTSTP_POS           (0U)
#define DBGC_MCUSTPCTL_SWDTSTP               ((uint32_t)0x00000001U)
#define DBGC_MCUSTPCTL_RTCSTP_POS            (2U)
#define DBGC_MCUSTPCTL_RTCSTP                ((uint32_t)0x00000004U)
#define DBGC_MCUSTPCTL_PVDSTP_POS            (3U)
#define DBGC_MCUSTPCTL_PVDSTP                ((uint32_t)0x00000008U)
#define DBGC_MCUSTPCTL_TMR01STP_POS          (14U)
#define DBGC_MCUSTPCTL_TMR01STP              ((uint32_t)0x00004000U)
#define DBGC_MCUSTPCTL_TMR21STP_POS          (17U)
#define DBGC_MCUSTPCTL_TMR21STP              ((uint32_t)0x00020000U)
#define DBGC_MCUSTPCTL_TMR41STP_POS          (20U)
#define DBGC_MCUSTPCTL_TMR41STP              ((uint32_t)0x00100000U)
#define DBGC_MCUSTPCTL_TMRA1STP_POS          (23U)
#define DBGC_MCUSTPCTL_TMRA1STP              ((uint32_t)0x00800000U)
#define DBGC_MCUSTPCTL_TMRB1STP_POS          (24U)
#define DBGC_MCUSTPCTL_TMRB1STP              ((uint32_t)0x01000000U)
#define DBGC_MCUSTPCTL_TMRB2STP_POS          (25U)
#define DBGC_MCUSTPCTL_TMRB2STP              ((uint32_t)0x02000000U)
#define DBGC_MCUSTPCTL_TMRB3STP_POS          (26U)
#define DBGC_MCUSTPCTL_TMRB3STP              ((uint32_t)0x04000000U)
#define DBGC_MCUSTPCTL_TMRB4STP_POS          (27U)
#define DBGC_MCUSTPCTL_TMRB4STP              ((uint32_t)0x08000000U)
#define DBGC_MCUSTPCTL_TMRB5STP_POS          (28U)
#define DBGC_MCUSTPCTL_TMRB5STP              ((uint32_t)0x10000000U)
#define DBGC_MCUSTPCTL_TMRB6STP_POS          (29U)
#define DBGC_MCUSTPCTL_TMRB6STP              ((uint32_t)0x20000000U)
#define DBGC_MCUSTPCTL_TMRB7STP_POS          (30U)
#define DBGC_MCUSTPCTL_TMRB7STP              ((uint32_t)0x40000000U)
#define DBGC_MCUSTPCTL_TMRB8STP_POS          (31U)
#define DBGC_MCUSTPCTL_TMRB8STP              ((uint32_t)0x80000000U)


/*******************************************************************************
                Bit definition for Peripheral EFM
*******************************************************************************/
/*  Bit definition for EFM_FAPRT register  */
#define EFM_FAPRT_FAPRT_POS                  (0U)
#define EFM_FAPRT_FAPRT                      ((uint32_t)0x0000FFFFU)
#define EFM_FAPRT_FAPRT_0                    ((uint32_t)0x00000001U)
#define EFM_FAPRT_FAPRT_1                    ((uint32_t)0x00000002U)
#define EFM_FAPRT_FAPRT_2                    ((uint32_t)0x00000004U)
#define EFM_FAPRT_FAPRT_3                    ((uint32_t)0x00000008U)
#define EFM_FAPRT_FAPRT_4                    ((uint32_t)0x00000010U)
#define EFM_FAPRT_FAPRT_5                    ((uint32_t)0x00000020U)
#define EFM_FAPRT_FAPRT_6                    ((uint32_t)0x00000040U)
#define EFM_FAPRT_FAPRT_7                    ((uint32_t)0x00000080U)
#define EFM_FAPRT_FAPRT_8                    ((uint32_t)0x00000100U)
#define EFM_FAPRT_FAPRT_9                    ((uint32_t)0x00000200U)
#define EFM_FAPRT_FAPRT_10                   ((uint32_t)0x00000400U)
#define EFM_FAPRT_FAPRT_11                   ((uint32_t)0x00000800U)
#define EFM_FAPRT_FAPRT_12                   ((uint32_t)0x00001000U)
#define EFM_FAPRT_FAPRT_13                   ((uint32_t)0x00002000U)
#define EFM_FAPRT_FAPRT_14                   ((uint32_t)0x00004000U)
#define EFM_FAPRT_FAPRT_15                   ((uint32_t)0x00008000U)

/*  Bit definition for EFM_FSTP register  */
#define EFM_FSTP_FSTP_POS                    (0U)
#define EFM_FSTP_FSTP                        ((uint32_t)0x00000001U)

