hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for PORT_PODR1 register  */
#define PORT_PODR1_POUT0_POS                 (0U)
#define PORT_PODR1_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR1_POUT1_POS                 (1U)
#define PORT_PODR1_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR1_POUT2_POS                 (2U)
#define PORT_PODR1_POUT2                     ((uint8_t)0x04U)
#define PORT_PODR1_POUT3_POS                 (3U)
#define PORT_PODR1_POUT3                     ((uint8_t)0x08U)
#define PORT_PODR1_POUT4_POS                 (4U)
#define PORT_PODR1_POUT4                     ((uint8_t)0x10U)
#define PORT_PODR1_POUT5_POS                 (5U)
#define PORT_PODR1_POUT5                     ((uint8_t)0x20U)
#define PORT_PODR1_POUT6_POS                 (6U)
#define PORT_PODR1_POUT6                     ((uint8_t)0x40U)
#define PORT_PODR1_POUT7_POS                 (7U)
#define PORT_PODR1_POUT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PODR2 register  */
#define PORT_PODR2_POUT0_POS                 (0U)
#define PORT_PODR2_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR2_POUT1_POS                 (1U)
#define PORT_PODR2_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR2_POUT2_POS                 (2U)
#define PORT_PODR2_POUT2                     ((uint8_t)0x04U)
#define PORT_PODR2_POUT3_POS                 (3U)
#define PORT_PODR2_POUT3                     ((uint8_t)0x08U)
#define PORT_PODR2_POUT4_POS                 (4U)
#define PORT_PODR2_POUT4                     ((uint8_t)0x10U)
#define PORT_PODR2_POUT5_POS                 (5U)
#define PORT_PODR2_POUT5                     ((uint8_t)0x20U)
#define PORT_PODR2_POUT6_POS                 (6U)
#define PORT_PODR2_POUT6                     ((uint8_t)0x40U)
#define PORT_PODR2_POUT7_POS                 (7U)
#define PORT_PODR2_POUT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PODR3 register  */
#define PORT_PODR3_POUT0_POS                 (0U)
#define PORT_PODR3_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR3_POUT1_POS                 (1U)
#define PORT_PODR3_POUT1                     ((uint8_t)0x02U)

/*  Bit definition for PORT_PODR4 register  */
#define PORT_PODR4_POUT0_POS                 (0U)
#define PORT_PODR4_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR4_POUT1_POS                 (1U)
#define PORT_PODR4_POUT1                     ((uint8_t)0x02U)

/*  Bit definition for PORT_PODR5 register  */
#define PORT_PODR5_POUT0_POS                 (0U)
#define PORT_PODR5_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR5_POUT1_POS                 (1U)
#define PORT_PODR5_POUT1                     ((uint8_t)0x02U)

/*  Bit definition for PORT_PODR6 register  */
#define PORT_PODR6_POUT0_POS                 (0U)
#define PORT_PODR6_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR6_POUT1_POS                 (1U)
#define PORT_PODR6_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR6_POUT2_POS                 (2U)
#define PORT_PODR6_POUT2                     ((uint8_t)0x04U)
#define PORT_PODR6_POUT3_POS                 (3U)
#define PORT_PODR6_POUT3                     ((uint8_t)0x08U)

/*  Bit definition for PORT_PODR7 register  */
#define PORT_PODR7_POUT0_POS                 (0U)
#define PORT_PODR7_POUT0                     ((uint8_t)0x01U)
#define PORT_PODR7_POUT1_POS                 (1U)
#define PORT_PODR7_POUT1                     ((uint8_t)0x02U)
#define PORT_PODR7_POUT2_POS                 (2U)
#define PORT_PODR7_POUT2                     ((uint8_t)0x04U)
#define PORT_PODR7_POUT3_POS                 (3U)
#define PORT_PODR7_POUT3                     ((uint8_t)0x08U)

/*  Bit definition for PORT_PODR12 register  */
#define PORT_PODR12_POUT0_POS                (0U)
#define PORT_PODR12_POUT0                    ((uint8_t)0x01U)
#define PORT_PODR12_POUT1_POS                (1U)
#define PORT_PODR12_POUT1                    ((uint8_t)0x02U)
#define PORT_PODR12_POUT2_POS                (2U)
#define PORT_PODR12_POUT2                    ((uint8_t)0x04U)
#define PORT_PODR12_POUT3_POS                (3U)
#define PORT_PODR12_POUT3                    ((uint8_t)0x08U)
#define PORT_PODR12_POUT4_POS                (4U)
#define PORT_PODR12_POUT4                    ((uint8_t)0x10U)

/*  Bit definition for PORT_PODR13 register  */
#define PORT_PODR13_POUT7_POS                (7U)
#define PORT_PODR13_POUT7                    ((uint8_t)0x80U)

/*  Bit definition for PORT_PODR14 register  */
#define PORT_PODR14_POUT6_POS                (6U)
#define PORT_PODR14_POUT6                    ((uint8_t)0x40U)
#define PORT_PODR14_POUT7_POS                (7U)
#define PORT_PODR14_POUT7                    ((uint8_t)0x80U)

/*  Bit definition for PORT_POER0 register  */
#define PORT_POER0_POUTE0_POS                (0U)
#define PORT_POER0_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER0_POUTE1_POS                (1U)
#define PORT_POER0_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER1 register  */
#define PORT_POER1_POUTE0_POS                (0U)
#define PORT_POER1_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER1_POUTE1_POS                (1U)
#define PORT_POER1_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER1_POUTE2_POS                (2U)
#define PORT_POER1_POUTE2                    ((uint8_t)0x04U)
#define PORT_POER1_POUTE3_POS                (3U)
#define PORT_POER1_POUTE3                    ((uint8_t)0x08U)
#define PORT_POER1_POUTE4_POS                (4U)
#define PORT_POER1_POUTE4                    ((uint8_t)0x10U)
#define PORT_POER1_POUTE5_POS                (5U)
#define PORT_POER1_POUTE5                    ((uint8_t)0x20U)
#define PORT_POER1_POUTE6_POS                (6U)
#define PORT_POER1_POUTE6                    ((uint8_t)0x40U)
#define PORT_POER1_POUTE7_POS                (7U)
#define PORT_POER1_POUTE7                    ((uint8_t)0x80U)

/*  Bit definition for PORT_POER2 register  */
#define PORT_POER2_POUTE0_POS                (0U)
#define PORT_POER2_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER2_POUTE1_POS                (1U)
#define PORT_POER2_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER2_POUTE2_POS                (2U)
#define PORT_POER2_POUTE2                    ((uint8_t)0x04U)
#define PORT_POER2_POUTE3_POS                (3U)
#define PORT_POER2_POUTE3                    ((uint8_t)0x08U)
#define PORT_POER2_POUTE4_POS                (4U)
#define PORT_POER2_POUTE4                    ((uint8_t)0x10U)
#define PORT_POER2_POUTE5_POS                (5U)
#define PORT_POER2_POUTE5                    ((uint8_t)0x20U)
#define PORT_POER2_POUTE6_POS                (6U)
#define PORT_POER2_POUTE6                    ((uint8_t)0x40U)
#define PORT_POER2_POUTE7_POS                (7U)
#define PORT_POER2_POUTE7                    ((uint8_t)0x80U)

