hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for PORT_POSR12 register  */
#define PORT_POSR12_POS0_POS                 (0U)
#define PORT_POSR12_POS0                     ((uint8_t)0x01U)
#define PORT_POSR12_POS1_POS                 (1U)
#define PORT_POSR12_POS1                     ((uint8_t)0x02U)
#define PORT_POSR12_POS2_POS                 (2U)
#define PORT_POSR12_POS2                     ((uint8_t)0x04U)
#define PORT_POSR12_POS3_POS                 (3U)
#define PORT_POSR12_POS3                     ((uint8_t)0x08U)
#define PORT_POSR12_POS4_POS                 (4U)
#define PORT_POSR12_POS4                     ((uint8_t)0x10U)

/*  Bit definition for PORT_POSR13 register  */
#define PORT_POSR13_POS7_POS                 (7U)
#define PORT_POSR13_POS7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_POSR14 register  */
#define PORT_POSR14_POS6_POS                 (6U)
#define PORT_POSR14_POS6                     ((uint8_t)0x40U)
#define PORT_POSR14_POS7_POS                 (7U)
#define PORT_POSR14_POS7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PORR0 register  */
#define PORT_PORR0_POR0_POS                  (0U)
#define PORT_PORR0_POR0                      ((uint8_t)0x01U)
#define PORT_PORR0_POR1_POS                  (1U)
#define PORT_PORR0_POR1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PORR1 register  */
#define PORT_PORR1_POR0_POS                  (0U)
#define PORT_PORR1_POR0                      ((uint8_t)0x01U)
#define PORT_PORR1_POR1_POS                  (1U)
#define PORT_PORR1_POR1                      ((uint8_t)0x02U)
#define PORT_PORR1_POR2_POS                  (2U)
#define PORT_PORR1_POR2                      ((uint8_t)0x04U)
#define PORT_PORR1_POR3_POS                  (3U)
#define PORT_PORR1_POR3                      ((uint8_t)0x08U)
#define PORT_PORR1_POR4_POS                  (4U)
#define PORT_PORR1_POR4                      ((uint8_t)0x10U)
#define PORT_PORR1_POR5_POS                  (5U)
#define PORT_PORR1_POR5                      ((uint8_t)0x20U)
#define PORT_PORR1_POR6_POS                  (6U)
#define PORT_PORR1_POR6                      ((uint8_t)0x40U)
#define PORT_PORR1_POR7_POS                  (7U)
#define PORT_PORR1_POR7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_PORR2 register  */
#define PORT_PORR2_POR0_POS                  (0U)
#define PORT_PORR2_POR0                      ((uint8_t)0x01U)
#define PORT_PORR2_POR1_POS                  (1U)
#define PORT_PORR2_POR1                      ((uint8_t)0x02U)
#define PORT_PORR2_POR2_POS                  (2U)
#define PORT_PORR2_POR2                      ((uint8_t)0x04U)
#define PORT_PORR2_POR3_POS                  (3U)
#define PORT_PORR2_POR3                      ((uint8_t)0x08U)
#define PORT_PORR2_POR4_POS                  (4U)
#define PORT_PORR2_POR4                      ((uint8_t)0x10U)
#define PORT_PORR2_POR5_POS                  (5U)
#define PORT_PORR2_POR5                      ((uint8_t)0x20U)
#define PORT_PORR2_POR6_POS                  (6U)
#define PORT_PORR2_POR6                      ((uint8_t)0x40U)
#define PORT_PORR2_POR7_POS                  (7U)
#define PORT_PORR2_POR7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_PORR3 register  */
#define PORT_PORR3_POR0_POS                  (0U)
#define PORT_PORR3_POR0                      ((uint8_t)0x01U)
#define PORT_PORR3_POR1_POS                  (1U)
#define PORT_PORR3_POR1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PORR4 register  */
#define PORT_PORR4_POR0_POS                  (0U)
#define PORT_PORR4_POR0                      ((uint8_t)0x01U)
#define PORT_PORR4_POR1_POS                  (1U)
#define PORT_PORR4_POR1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PORR5 register  */
#define PORT_PORR5_POR0_POS                  (0U)
#define PORT_PORR5_POR0                      ((uint8_t)0x01U)
#define PORT_PORR5_POR1_POS                  (1U)
#define PORT_PORR5_POR1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_PORR6 register  */
#define PORT_PORR6_POR0_POS                  (0U)
#define PORT_PORR6_POR0                      ((uint8_t)0x01U)
#define PORT_PORR6_POR1_POS                  (1U)
#define PORT_PORR6_POR1                      ((uint8_t)0x02U)
#define PORT_PORR6_POR2_POS                  (2U)
#define PORT_PORR6_POR2                      ((uint8_t)0x04U)
#define PORT_PORR6_POR3_POS                  (3U)
#define PORT_PORR6_POR3                      ((uint8_t)0x08U)

/*  Bit definition for PORT_PORR7 register  */
#define PORT_PORR7_POR0_POS                  (0U)
#define PORT_PORR7_POR0                      ((uint8_t)0x01U)
#define PORT_PORR7_POR1_POS                  (1U)
#define PORT_PORR7_POR1                      ((uint8_t)0x02U)
#define PORT_PORR7_POR2_POS                  (2U)
#define PORT_PORR7_POR2                      ((uint8_t)0x04U)
#define PORT_PORR7_POR3_POS                  (3U)
#define PORT_PORR7_POR3                      ((uint8_t)0x08U)

/*  Bit definition for PORT_PORR12 register  */
#define PORT_PORR12_POR0_POS                 (0U)
#define PORT_PORR12_POR0                     ((uint8_t)0x01U)
#define PORT_PORR12_POR1_POS                 (1U)
#define PORT_PORR12_POR1                     ((uint8_t)0x02U)
#define PORT_PORR12_POR2_POS                 (2U)
#define PORT_PORR12_POR2                     ((uint8_t)0x04U)
#define PORT_PORR12_POR3_POS                 (3U)
#define PORT_PORR12_POR3                     ((uint8_t)0x08U)
#define PORT_PORR12_POR4_POS                 (4U)
#define PORT_PORR12_POR4                     ((uint8_t)0x10U)

/*  Bit definition for PORT_PORR13 register  */
#define PORT_PORR13_POR7_POS                 (7U)
#define PORT_PORR13_POR7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PORR14 register  */
#define PORT_PORR14_POR6_POS                 (6U)
#define PORT_PORR14_POR6                     ((uint8_t)0x40U)
#define PORT_PORR14_POR7_POS                 (7U)
#define PORT_PORR14_POR7                     ((uint8_t)0x80U)

