hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for PORT_POTR0 register  */
#define PORT_POTR0_POT0_POS                  (0U)
#define PORT_POTR0_POT0                      ((uint8_t)0x01U)
#define PORT_POTR0_POT1_POS                  (1U)
#define PORT_POTR0_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR1 register  */
#define PORT_POTR1_POT0_POS                  (0U)
#define PORT_POTR1_POT0                      ((uint8_t)0x01U)
#define PORT_POTR1_POT1_POS                  (1U)
#define PORT_POTR1_POT1                      ((uint8_t)0x02U)
#define PORT_POTR1_POT2_POS                  (2U)
#define PORT_POTR1_POT2                      ((uint8_t)0x04U)
#define PORT_POTR1_POT3_POS                  (3U)
#define PORT_POTR1_POT3                      ((uint8_t)0x08U)
#define PORT_POTR1_POT4_POS                  (4U)
#define PORT_POTR1_POT4                      ((uint8_t)0x10U)
#define PORT_POTR1_POT5_POS                  (5U)
#define PORT_POTR1_POT5                      ((uint8_t)0x20U)
#define PORT_POTR1_POT6_POS                  (6U)
#define PORT_POTR1_POT6                      ((uint8_t)0x40U)
#define PORT_POTR1_POT7_POS                  (7U)
#define PORT_POTR1_POT7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_POTR2 register  */
#define PORT_POTR2_POT0_POS                  (0U)
#define PORT_POTR2_POT0                      ((uint8_t)0x01U)
#define PORT_POTR2_POT1_POS                  (1U)
#define PORT_POTR2_POT1                      ((uint8_t)0x02U)
#define PORT_POTR2_POT2_POS                  (2U)
#define PORT_POTR2_POT2                      ((uint8_t)0x04U)
#define PORT_POTR2_POT3_POS                  (3U)
#define PORT_POTR2_POT3                      ((uint8_t)0x08U)
#define PORT_POTR2_POT4_POS                  (4U)
#define PORT_POTR2_POT4                      ((uint8_t)0x10U)
#define PORT_POTR2_POT5_POS                  (5U)
#define PORT_POTR2_POT5                      ((uint8_t)0x20U)
#define PORT_POTR2_POT6_POS                  (6U)
#define PORT_POTR2_POT6                      ((uint8_t)0x40U)
#define PORT_POTR2_POT7_POS                  (7U)
#define PORT_POTR2_POT7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_POTR3 register  */
#define PORT_POTR3_POT0_POS                  (0U)
#define PORT_POTR3_POT0                      ((uint8_t)0x01U)
#define PORT_POTR3_POT1_POS                  (1U)
#define PORT_POTR3_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR4 register  */
#define PORT_POTR4_POT0_POS                  (0U)
#define PORT_POTR4_POT0                      ((uint8_t)0x01U)
#define PORT_POTR4_POT1_POS                  (1U)
#define PORT_POTR4_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR5 register  */
#define PORT_POTR5_POT0_POS                  (0U)
#define PORT_POTR5_POT0                      ((uint8_t)0x01U)
#define PORT_POTR5_POT1_POS                  (1U)
#define PORT_POTR5_POT1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POTR6 register  */
#define PORT_POTR6_POT0_POS                  (0U)
#define PORT_POTR6_POT0                      ((uint8_t)0x01U)
#define PORT_POTR6_POT1_POS                  (1U)
#define PORT_POTR6_POT1                      ((uint8_t)0x02U)
#define PORT_POTR6_POT2_POS                  (2U)
#define PORT_POTR6_POT2                      ((uint8_t)0x04U)
#define PORT_POTR6_POT3_POS                  (3U)
#define PORT_POTR6_POT3                      ((uint8_t)0x08U)

/*  Bit definition for PORT_POTR7 register  */
#define PORT_POTR7_POT0_POS                  (0U)
#define PORT_POTR7_POT0                      ((uint8_t)0x01U)
#define PORT_POTR7_POT1_POS                  (1U)
#define PORT_POTR7_POT1                      ((uint8_t)0x02U)
#define PORT_POTR7_POT2_POS                  (2U)
#define PORT_POTR7_POT2                      ((uint8_t)0x04U)
#define PORT_POTR7_POT3_POS                  (3U)
#define PORT_POTR7_POT3                      ((uint8_t)0x08U)

/*  Bit definition for PORT_POTR12 register  */
#define PORT_POTR12_POT0_POS                 (0U)
#define PORT_POTR12_POT0                     ((uint8_t)0x01U)
#define PORT_POTR12_POT1_POS                 (1U)
#define PORT_POTR12_POT1                     ((uint8_t)0x02U)
#define PORT_POTR12_POT2_POS                 (2U)
#define PORT_POTR12_POT2                     ((uint8_t)0x04U)
#define PORT_POTR12_POT3_POS                 (3U)
#define PORT_POTR12_POT3                     ((uint8_t)0x08U)
#define PORT_POTR12_POT4_POS                 (4U)
#define PORT_POTR12_POT4                     ((uint8_t)0x10U)

/*  Bit definition for PORT_POTR13 register  */
#define PORT_POTR13_POT7_POS                 (7U)
#define PORT_POTR13_POT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_POTR14 register  */
#define PORT_POTR14_POT6_POS                 (6U)
#define PORT_POTR14_POT6                     ((uint8_t)0x40U)
#define PORT_POTR14_POT7_POS                 (7U)
#define PORT_POTR14_POT7                     ((uint8_t)0x80U)

/*  Bit definition for PORT_PCR register  */
#define PORT_PCR_POUT_POS                    (0U)
#define PORT_PCR_POUT                        ((uint16_t)0x0001U)
#define PORT_PCR_POUTE_POS                   (1U)
#define PORT_PCR_POUTE                       ((uint16_t)0x0002U)
#define PORT_PCR_NOD_POS                     (2U)
#define PORT_PCR_NOD                         ((uint16_t)0x0004U)
#define PORT_PCR_DRV_POS                     (4U)
#define PORT_PCR_DRV                         ((uint16_t)0x0010U)
#define PORT_PCR_LTE_POS                     (5U)
#define PORT_PCR_LTE                         ((uint16_t)0x0020U)
#define PORT_PCR_PUU_POS                     (6U)
#define PORT_PCR_PUU                         ((uint16_t)0x0040U)
#define PORT_PCR_PIN_POS                     (8U)
#define PORT_PCR_PIN                         ((uint16_t)0x0100U)
#define PORT_PCR_INVE_POS                    (9U)
#define PORT_PCR_INVE                        ((uint16_t)0x0200U)
#define PORT_PCR_CINSEL_POS                  (10U)
#define PORT_PCR_CINSEL                      ((uint16_t)0x0400U)
#define PORT_PCR_INTE_POS                    (11U)
#define PORT_PCR_INTE                        ((uint16_t)0x0800U)
#define PORT_PCR_FSEL_POS                    (12U)
#define PORT_PCR_FSEL                        ((uint16_t)0x7000U)
#define PORT_PCR_FSEL_0                      ((uint16_t)0x1000U)
#define PORT_PCR_FSEL_1                      ((uint16_t)0x2000U)
#define PORT_PCR_FSEL_2                      ((uint16_t)0x4000U)

