hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*******************************************************************************
                Bit definition for Peripheral RMU
*******************************************************************************/
/*  Bit definition for RMU_RSTF0 register  */
#define RMU_RSTF0_PORF_POS                   (0U)
#define RMU_RSTF0_PORF                       ((uint16_t)0x0001U)
#define RMU_RSTF0_PINRF_POS                  (1U)
#define RMU_RSTF0_PINRF                      ((uint16_t)0x0002U)
#define RMU_RSTF0_LVRF_POS                   (2U)
#define RMU_RSTF0_LVRF                       ((uint16_t)0x0004U)
#define RMU_RSTF0_WDRF_POS                   (5U)
#define RMU_RSTF0_WDRF                       ((uint16_t)0x0020U)
#define RMU_RSTF0_SWRF_POS                   (8U)
#define RMU_RSTF0_SWRF                       ((uint16_t)0x0100U)
#define RMU_RSTF0_RAMPERF_POS                (10U)
#define RMU_RSTF0_RAMPERF                    ((uint16_t)0x0400U)
#define RMU_RSTF0_CPULKUPRF_POS              (12U)
#define RMU_RSTF0_CPULKUPRF                  ((uint16_t)0x1000U)
#define RMU_RSTF0_XTALERF_POS                (13U)
#define RMU_RSTF0_XTALERF                    ((uint16_t)0x2000U)
#define RMU_RSTF0_MULTIRF_POS                (14U)
#define RMU_RSTF0_MULTIRF                    ((uint16_t)0x4000U)
#define RMU_RSTF0_CLRF_POS                   (15U)
#define RMU_RSTF0_CLRF                       ((uint16_t)0x8000U)


/*******************************************************************************
                Bit definition for Peripheral RTC
*******************************************************************************/
/*  Bit definition for RTC_CR0 register  */
#define RTC_CR0_RESET_POS                    (0U)
#define RTC_CR0_RESET                        ((uint32_t)0x00000001U)

/*  Bit definition for RTC_CR1 register  */
#define RTC_CR1_PRDS_POS                     (0U)
#define RTC_CR1_PRDS                         ((uint32_t)0x00000007U)
#define RTC_CR1_PRDS_0                       ((uint32_t)0x00000001U)
#define RTC_CR1_PRDS_1                       ((uint32_t)0x00000002U)
#define RTC_CR1_PRDS_2                       ((uint32_t)0x00000004U)
#define RTC_CR1_AMPM_POS                     (3U)
#define RTC_CR1_AMPM                         ((uint32_t)0x00000008U)
#define RTC_CR1_ONEHZOE_POS                  (5U)
#define RTC_CR1_ONEHZOE                      ((uint32_t)0x00000020U)
#define RTC_CR1_START_POS                    (7U)
#define RTC_CR1_START                        ((uint32_t)0x00000080U)

/*  Bit definition for RTC_CR2 register  */
#define RTC_CR2_WAIT_POS                     (0U)
#define RTC_CR2_WAIT                         ((uint32_t)0x00000001U)
#define RTC_CR2_WAITF_POS                    (1U)
#define RTC_CR2_WAITF                        ((uint32_t)0x00000002U)
#define RTC_CR2_PRDF_POS                     (2U)
#define RTC_CR2_PRDF                         ((uint32_t)0x00000004U)
#define RTC_CR2_ALMF_POS                     (3U)
#define RTC_CR2_ALMF                         ((uint32_t)0x00000008U)
#define RTC_CR2_PRDIE_POS                    (5U)
#define RTC_CR2_PRDIE                        ((uint32_t)0x00000020U)
#define RTC_CR2_ALMIE_POS                    (6U)
#define RTC_CR2_ALMIE                        ((uint32_t)0x00000040U)
#define RTC_CR2_ALME_POS                     (7U)
#define RTC_CR2_ALME                         ((uint32_t)0x00000080U)

/*  Bit definition for RTC_CR3 register  */
#define RTC_CR3_LRCEN_POS                    (4U)
#define RTC_CR3_LRCEN                        ((uint32_t)0x00000010U)
#define RTC_CR3_RCKSEL_POS                   (7U)
#define RTC_CR3_RCKSEL                       ((uint32_t)0x00000080U)

/*  Bit definition for RTC_SEC register  */
#define RTC_SEC_SECU_POS                     (0U)
#define RTC_SEC_SECU                         ((uint32_t)0x0000000FU)
#define RTC_SEC_SECU_0                       ((uint32_t)0x00000001U)
#define RTC_SEC_SECU_1                       ((uint32_t)0x00000002U)
#define RTC_SEC_SECU_2                       ((uint32_t)0x00000004U)
#define RTC_SEC_SECU_3                       ((uint32_t)0x00000008U)
#define RTC_SEC_SECD_POS                     (4U)
#define RTC_SEC_SECD                         ((uint32_t)0x00000070U)
#define RTC_SEC_SECD_0                       ((uint32_t)0x00000010U)
#define RTC_SEC_SECD_1                       ((uint32_t)0x00000020U)
#define RTC_SEC_SECD_2                       ((uint32_t)0x00000040U)

/*  Bit definition for RTC_MIN register  */
#define RTC_MIN_MINU_POS                     (0U)
#define RTC_MIN_MINU                         ((uint32_t)0x0000000FU)
#define RTC_MIN_MINU_0                       ((uint32_t)0x00000001U)
#define RTC_MIN_MINU_1                       ((uint32_t)0x00000002U)
#define RTC_MIN_MINU_2                       ((uint32_t)0x00000004U)
#define RTC_MIN_MINU_3                       ((uint32_t)0x00000008U)
#define RTC_MIN_MIND_POS                     (4U)
#define RTC_MIN_MIND                         ((uint32_t)0x00000070U)
#define RTC_MIN_MIND_0                       ((uint32_t)0x00000010U)
#define RTC_MIN_MIND_1                       ((uint32_t)0x00000020U)
#define RTC_MIN_MIND_2                       ((uint32_t)0x00000040U)

/*  Bit definition for RTC_HOUR register  */
#define RTC_HOUR_HOURU_POS                   (0U)
#define RTC_HOUR_HOURU                       ((uint32_t)0x0000000FU)
#define RTC_HOUR_HOURU_0                     ((uint32_t)0x00000001U)
#define RTC_HOUR_HOURU_1                     ((uint32_t)0x00000002U)
#define RTC_HOUR_HOURU_2                     ((uint32_t)0x00000004U)
#define RTC_HOUR_HOURU_3                     ((uint32_t)0x00000008U)
#define RTC_HOUR_HOURD_POS                   (4U)
#define RTC_HOUR_HOURD                       ((uint32_t)0x00000030U)
#define RTC_HOUR_HOURD_0                     ((uint32_t)0x00000010U)
#define RTC_HOUR_HOURD_1                     ((uint32_t)0x00000020U)

/*  Bit definition for RTC_WEEK register  */
#define RTC_WEEK_WEEK_POS                    (0U)
#define RTC_WEEK_WEEK                        ((uint32_t)0x00000007U)
#define RTC_WEEK_WEEK_0                      ((uint32_t)0x00000001U)
#define RTC_WEEK_WEEK_1                      ((uint32_t)0x00000002U)
#define RTC_WEEK_WEEK_2                      ((uint32_t)0x00000004U)

