hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for RTC_DAY register  */
#define RTC_DAY_DAYU_POS                     (0U)
#define RTC_DAY_DAYU                         ((uint32_t)0x0000000FU)
#define RTC_DAY_DAYU_0                       ((uint32_t)0x00000001U)
#define RTC_DAY_DAYU_1                       ((uint32_t)0x00000002U)
#define RTC_DAY_DAYU_2                       ((uint32_t)0x00000004U)
#define RTC_DAY_DAYU_3                       ((uint32_t)0x00000008U)
#define RTC_DAY_DAYD_POS                     (4U)
#define RTC_DAY_DAYD                         ((uint32_t)0x00000030U)
#define RTC_DAY_DAYD_0                       ((uint32_t)0x00000010U)
#define RTC_DAY_DAYD_1                       ((uint32_t)0x00000020U)

/*  Bit definition for RTC_MON register  */
#define RTC_MON_MON_POS                      (0U)
#define RTC_MON_MON                          ((uint32_t)0x0000001FU)
#define RTC_MON_MON_0                        ((uint32_t)0x00000001U)
#define RTC_MON_MON_1                        ((uint32_t)0x00000002U)
#define RTC_MON_MON_2                        ((uint32_t)0x00000004U)
#define RTC_MON_MON_3                        ((uint32_t)0x00000008U)
#define RTC_MON_MON_4                        ((uint32_t)0x00000010U)

/*  Bit definition for RTC_YEAR register  */
#define RTC_YEAR_YEARU_POS                   (0U)
#define RTC_YEAR_YEARU                       ((uint32_t)0x0000000FU)
#define RTC_YEAR_YEARU_0                     ((uint32_t)0x00000001U)
#define RTC_YEAR_YEARU_1                     ((uint32_t)0x00000002U)
#define RTC_YEAR_YEARU_2                     ((uint32_t)0x00000004U)
#define RTC_YEAR_YEARU_3                     ((uint32_t)0x00000008U)
#define RTC_YEAR_YEARD_POS                   (4U)
#define RTC_YEAR_YEARD                       ((uint32_t)0x000000F0U)
#define RTC_YEAR_YEARD_0                     ((uint32_t)0x00000010U)
#define RTC_YEAR_YEARD_1                     ((uint32_t)0x00000020U)
#define RTC_YEAR_YEARD_2                     ((uint32_t)0x00000040U)
#define RTC_YEAR_YEARD_3                     ((uint32_t)0x00000080U)

/*  Bit definition for RTC_ALMMIN register  */
#define RTC_ALMMIN_ALMMINU_POS               (0U)
#define RTC_ALMMIN_ALMMINU                   ((uint32_t)0x0000000FU)
#define RTC_ALMMIN_ALMMINU_0                 ((uint32_t)0x00000001U)
#define RTC_ALMMIN_ALMMINU_1                 ((uint32_t)0x00000002U)
#define RTC_ALMMIN_ALMMINU_2                 ((uint32_t)0x00000004U)
#define RTC_ALMMIN_ALMMINU_3                 ((uint32_t)0x00000008U)
#define RTC_ALMMIN_ALMMIND_POS               (4U)
#define RTC_ALMMIN_ALMMIND                   ((uint32_t)0x00000070U)
#define RTC_ALMMIN_ALMMIND_0                 ((uint32_t)0x00000010U)
#define RTC_ALMMIN_ALMMIND_1                 ((uint32_t)0x00000020U)
#define RTC_ALMMIN_ALMMIND_2                 ((uint32_t)0x00000040U)

/*  Bit definition for RTC_ALMHOUR register  */
#define RTC_ALMHOUR_ALMHOURU_POS             (0U)
#define RTC_ALMHOUR_ALMHOURU                 ((uint32_t)0x0000000FU)
#define RTC_ALMHOUR_ALMHOURU_0               ((uint32_t)0x00000001U)
#define RTC_ALMHOUR_ALMHOURU_1               ((uint32_t)0x00000002U)
#define RTC_ALMHOUR_ALMHOURU_2               ((uint32_t)0x00000004U)
#define RTC_ALMHOUR_ALMHOURU_3               ((uint32_t)0x00000008U)
#define RTC_ALMHOUR_ALMHOURD_POS             (4U)
#define RTC_ALMHOUR_ALMHOURD                 ((uint32_t)0x00000030U)
#define RTC_ALMHOUR_ALMHOURD_0               ((uint32_t)0x00000010U)
#define RTC_ALMHOUR_ALMHOURD_1               ((uint32_t)0x00000020U)

/*  Bit definition for RTC_ALMWEEK register  */
#define RTC_ALMWEEK_ALMWEEK_POS              (0U)
#define RTC_ALMWEEK_ALMWEEK                  ((uint32_t)0x0000007FU)
#define RTC_ALMWEEK_ALMWEEK_0                ((uint32_t)0x00000001U)
#define RTC_ALMWEEK_ALMWEEK_1                ((uint32_t)0x00000002U)
#define RTC_ALMWEEK_ALMWEEK_2                ((uint32_t)0x00000004U)
#define RTC_ALMWEEK_ALMWEEK_3                ((uint32_t)0x00000008U)
#define RTC_ALMWEEK_ALMWEEK_4                ((uint32_t)0x00000010U)
#define RTC_ALMWEEK_ALMWEEK_5                ((uint32_t)0x00000020U)
#define RTC_ALMWEEK_ALMWEEK_6                ((uint32_t)0x00000040U)

/*  Bit definition for RTC_ERRCRH register  */
#define RTC_ERRCRH_COMP8_POS                 (0U)
#define RTC_ERRCRH_COMP8                     ((uint32_t)0x00000001U)
#define RTC_ERRCRH_COMPEN_POS                (7U)
#define RTC_ERRCRH_COMPEN                    ((uint32_t)0x00000080U)

/*  Bit definition for RTC_ERRCRL register  */
#define RTC_ERRCRL_COMP_POS                  (0U)
#define RTC_ERRCRL_COMP                      ((uint32_t)0x000000FFU)
#define RTC_ERRCRL_COMP_0                    ((uint32_t)0x00000001U)
#define RTC_ERRCRL_COMP_1                    ((uint32_t)0x00000002U)
#define RTC_ERRCRL_COMP_2                    ((uint32_t)0x00000004U)
#define RTC_ERRCRL_COMP_3                    ((uint32_t)0x00000008U)
#define RTC_ERRCRL_COMP_4                    ((uint32_t)0x00000010U)
#define RTC_ERRCRL_COMP_5                    ((uint32_t)0x00000020U)
#define RTC_ERRCRL_COMP_6                    ((uint32_t)0x00000040U)
#define RTC_ERRCRL_COMP_7                    ((uint32_t)0x00000080U)


/*******************************************************************************
                Bit definition for Peripheral SPI
*******************************************************************************/
/*  Bit definition for SPI_DR register  */
#define SPI_DR_SPD_POS                       (0U)
#define SPI_DR_SPD                           ((uint32_t)0x0000FFFFU)
#define SPI_DR_SPD_0                         ((uint32_t)0x00000001U)
#define SPI_DR_SPD_1                         ((uint32_t)0x00000002U)
#define SPI_DR_SPD_2                         ((uint32_t)0x00000004U)
#define SPI_DR_SPD_3                         ((uint32_t)0x00000008U)
#define SPI_DR_SPD_4                         ((uint32_t)0x00000010U)
#define SPI_DR_SPD_5                         ((uint32_t)0x00000020U)
#define SPI_DR_SPD_6                         ((uint32_t)0x00000040U)
#define SPI_DR_SPD_7                         ((uint32_t)0x00000080U)
#define SPI_DR_SPD_8                         ((uint32_t)0x00000100U)
#define SPI_DR_SPD_9                         ((uint32_t)0x00000200U)
#define SPI_DR_SPD_10                        ((uint32_t)0x00000400U)
#define SPI_DR_SPD_11                        ((uint32_t)0x00000800U)
#define SPI_DR_SPD_12                        ((uint32_t)0x00001000U)
#define SPI_DR_SPD_13                        ((uint32_t)0x00002000U)
#define SPI_DR_SPD_14                        ((uint32_t)0x00004000U)
#define SPI_DR_SPD_15                        ((uint32_t)0x00008000U)

/*  Bit definition for SPI_CR1 register  */
#define SPI_CR1_SPIMDS_POS                   (0U)
#define SPI_CR1_SPIMDS                       ((uint32_t)0x00000001U)
#define SPI_CR1_TXMDS_POS                    (1U)
#define SPI_CR1_TXMDS                        ((uint32_t)0x00000002U)
#define SPI_CR1_MSTR_POS                     (3U)
#define SPI_CR1_MSTR                         ((uint32_t)0x00000008U)
#define SPI_CR1_SPLPBK_POS                   (4U)
#define SPI_CR1_SPLPBK                       ((uint32_t)0x00000010U)
#define SPI_CR1_SPLPBK2_POS                  (5U)
#define SPI_CR1_SPLPBK2                      ((uint32_t)0x00000020U)
#define SPI_CR1_SPE_POS                      (6U)
#define SPI_CR1_SPE                          ((uint32_t)0x00000040U)
#define SPI_CR1_EIE_POS                      (8U)
#define SPI_CR1_EIE                          ((uint32_t)0x00000100U)
#define SPI_CR1_TXIE_POS                     (9U)
#define SPI_CR1_TXIE                         ((uint32_t)0x00000200U)
#define SPI_CR1_RXIE_POS                     (10U)
#define SPI_CR1_RXIE                         ((uint32_t)0x00000400U)
#define SPI_CR1_IDIE_POS                     (11U)
#define SPI_CR1_IDIE                         ((uint32_t)0x00000800U)
#define SPI_CR1_MODFE_POS                    (12U)
#define SPI_CR1_MODFE                        ((uint32_t)0x00001000U)
#define SPI_CR1_PATE_POS                     (13U)
#define SPI_CR1_PATE                         ((uint32_t)0x00002000U)
#define SPI_CR1_PAOE_POS                     (14U)
#define SPI_CR1_PAOE                         ((uint32_t)0x00004000U)
#define SPI_CR1_PAE_POS                      (15U)
#define SPI_CR1_PAE                          ((uint32_t)0x00008000U)

/*  Bit definition for SPI_CFG1 register  */
#define SPI_CFG1_SS0PV_POS                   (8U)
#define SPI_CFG1_SS0PV                       ((uint32_t)0x00000100U)

/*  Bit definition for SPI_SR register  */
#define SPI_SR_OVRERF_POS                    (0U)
#define SPI_SR_OVRERF                        ((uint32_t)0x00000001U)
#define SPI_SR_IDLNF_POS                     (1U)
#define SPI_SR_IDLNF                         ((uint32_t)0x00000002U)
#define SPI_SR_MODFERF_POS                   (2U)
#define SPI_SR_MODFERF                       ((uint32_t)0x00000004U)
#define SPI_SR_PERF_POS                      (3U)
#define SPI_SR_PERF                          ((uint32_t)0x00000008U)
#define SPI_SR_UDRERF_POS                    (4U)
#define SPI_SR_UDRERF                        ((uint32_t)0x00000010U)
#define SPI_SR_TDEF_POS                      (5U)
#define SPI_SR_TDEF                          ((uint32_t)0x00000020U)
#define SPI_SR_RDFF_POS                      (7U)
#define SPI_SR_RDFF                          ((uint32_t)0x00000080U)

