hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
/*  Bit definition for USART_CR2 register  */
#define USART_CR2_MPE_POS                    (0U)
#define USART_CR2_MPE                        ((uint32_t)0x00000001U)
#define USART_CR2_CLKC_POS                   (11U)
#define USART_CR2_CLKC                       ((uint32_t)0x00001800U)
#define USART_CR2_CLKC_0                     ((uint32_t)0x00000800U)
#define USART_CR2_CLKC_1                     ((uint32_t)0x00001000U)
#define USART_CR2_STOP_POS                   (13U)
#define USART_CR2_STOP                       ((uint32_t)0x00002000U)
#define USART_CR2_LINEN_POS                  (14U)
#define USART_CR2_LINEN                      ((uint32_t)0x00004000U)

/*  Bit definition for USART_CR3 register  */
#define USART_CR3_HDSEL_POS                  (3U)
#define USART_CR3_HDSEL                      ((uint32_t)0x00000008U)
#define USART_CR3_CTSE_POS                   (9U)
#define USART_CR3_CTSE                       ((uint32_t)0x00000200U)

/*  Bit definition for USART_PR register  */
#define USART_PR_PSC_POS                     (0U)
#define USART_PR_PSC                         ((uint32_t)0x00000003U)
#define USART_PR_PSC_0                       ((uint32_t)0x00000001U)
#define USART_PR_PSC_1                       ((uint32_t)0x00000002U)




/******************************************************************************/
/*             Device Specific Registers bit_band structure                   */
/******************************************************************************/

typedef struct
{
    __IO uint32_t STRT;
    uint32_t RESERVED0[7];
} stc_adc_str_bit_t;

typedef struct
{
    __IO uint32_t MS0;
    __IO uint32_t MS1;
    uint32_t RESERVED0[2];
    __IO uint32_t ACCSEL0;
    __IO uint32_t ACCSEL1;
    __IO uint32_t CLREN;
    __IO uint32_t DFMT;
    uint32_t RESERVED1[8];
} stc_adc_cr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t RSCHSEL;
    uint32_t RESERVED1[13];
} stc_adc_cr1_bit_t;

typedef struct
{
    __IO uint32_t TRGSELA0;
    __IO uint32_t TRGSELA1;
    uint32_t RESERVED0[5];
    __IO uint32_t TRGENA;
    __IO uint32_t TRGSELB0;
    __IO uint32_t TRGSELB1;
    uint32_t RESERVED1[5];
    __IO uint32_t TRGENB;
} stc_adc_trgsr_bit_t;

typedef struct
{
    __IO uint32_t CHSELA0;
    __IO uint32_t CHSELA1;
    __IO uint32_t CHSELA2;
    __IO uint32_t CHSELA3;
    __IO uint32_t CHSELA4;
    __IO uint32_t CHSELA5;
    __IO uint32_t CHSELA6;
    __IO uint32_t CHSELA7;
    __IO uint32_t CHSELA8;
    __IO uint32_t CHSELA9;
    __IO uint32_t CHSELA10;
    __IO uint32_t CHSELA11;
    uint32_t RESERVED0[4];
} stc_adc_chselra0_bit_t;

typedef struct
{
    __IO uint32_t CHSELB0;
    __IO uint32_t CHSELB1;
    __IO uint32_t CHSELB2;
    __IO uint32_t CHSELB3;
    __IO uint32_t CHSELB4;
    __IO uint32_t CHSELB5;
    __IO uint32_t CHSELB6;
    __IO uint32_t CHSELB7;
    __IO uint32_t CHSELB8;
    __IO uint32_t CHSELB9;
    __IO uint32_t CHSELB10;
    __IO uint32_t CHSELB11;
    uint32_t RESERVED0[4];
} stc_adc_chselrb0_bit_t;

typedef struct
{
    __IO uint32_t EXCHSEL;
    uint32_t RESERVED0[7];
} stc_adc_exchselr_bit_t;

typedef struct
{
    uint32_t SSTR_0;
    uint32_t SSTR_1;
    uint32_t SSTR_2;
    uint32_t SSTR_3;
    uint32_t SSTR_4;
    uint32_t SSTR_5;
    uint32_t SSTR_6;
    uint32_t SSTR_7;
} stc_adc_sstr_bit_t;

typedef struct
{
    __IO uint32_t EOCAF;
    __IO uint32_t EOCBF;
    uint32_t RESERVED0[6];
} stc_adc_isr_bit_t;

typedef struct
{
    __IO uint32_t EOCAIEN;
    __IO uint32_t EOCBIEN;
    uint32_t RESERVED0[6];
} stc_adc_icr_bit_t;

typedef struct
{
    __IO uint32_t CLREOCAF;
    __IO uint32_t CLREOCBF;
    uint32_t RESERVED0[6];
} stc_adc_isclrr_bit_t;

typedef struct
{
    uint32_t DR0_0;
    uint32_t DR0_1;
    uint32_t DR0_2;
    uint32_t DR0_3;
    uint32_t DR0_4;
    uint32_t DR0_5;
    uint32_t DR0_6;
    uint32_t DR0_7;
    uint32_t DR0_8;
    uint32_t DR0_9;
    uint32_t DR0_10;
    uint32_t DR0_11;
    uint32_t DR0_12;
    uint32_t DR0_13;
    uint32_t DR0_14;
    uint32_t DR0_15;
} stc_adc_dr0_bit_t;

typedef struct
{
    uint32_t DR1_0;
    uint32_t DR1_1;
    uint32_t DR1_2;
    uint32_t DR1_3;
    uint32_t DR1_4;
    uint32_t DR1_5;
    uint32_t DR1_6;
    uint32_t DR1_7;
    uint32_t DR1_8;
    uint32_t DR1_9;
    uint32_t DR1_10;
    uint32_t DR1_11;
    uint32_t DR1_12;
    uint32_t DR1_13;
    uint32_t DR1_14;
    uint32_t DR1_15;
} stc_adc_dr1_bit_t;

typedef struct
{
    uint32_t DR2_0;
    uint32_t DR2_1;
    uint32_t DR2_2;
    uint32_t DR2_3;
    uint32_t DR2_4;
    uint32_t DR2_5;
    uint32_t DR2_6;
    uint32_t DR2_7;
    uint32_t DR2_8;
    uint32_t DR2_9;
    uint32_t DR2_10;
    uint32_t DR2_11;
    uint32_t DR2_12;
    uint32_t DR2_13;
    uint32_t DR2_14;
    uint32_t DR2_15;
} stc_adc_dr2_bit_t;

typedef struct
{
    uint32_t DR3_0;
    uint32_t DR3_1;
    uint32_t DR3_2;
    uint32_t DR3_3;
    uint32_t DR3_4;
    uint32_t DR3_5;
    uint32_t DR3_6;
    uint32_t DR3_7;
    uint32_t DR3_8;
    uint32_t DR3_9;
    uint32_t DR3_10;
    uint32_t DR3_11;
    uint32_t DR3_12;
    uint32_t DR3_13;
    uint32_t DR3_14;
    uint32_t DR3_15;
} stc_adc_dr3_bit_t;

typedef struct
{
    uint32_t DR4_0;
    uint32_t DR4_1;
    uint32_t DR4_2;
    uint32_t DR4_3;
    uint32_t DR4_4;
    uint32_t DR4_5;
    uint32_t DR4_6;
    uint32_t DR4_7;
    uint32_t DR4_8;
    uint32_t DR4_9;
    uint32_t DR4_10;
    uint32_t DR4_11;
    uint32_t DR4_12;
    uint32_t DR4_13;
    uint32_t DR4_14;
    uint32_t DR4_15;
} stc_adc_dr4_bit_t;

typedef struct
{
    uint32_t DR5_0;
    uint32_t DR5_1;
    uint32_t DR5_2;
    uint32_t DR5_3;
    uint32_t DR5_4;
    uint32_t DR5_5;
    uint32_t DR5_6;
    uint32_t DR5_7;
    uint32_t DR5_8;
    uint32_t DR5_9;
    uint32_t DR5_10;
    uint32_t DR5_11;
    uint32_t DR5_12;
    uint32_t DR5_13;
    uint32_t DR5_14;
    uint32_t DR5_15;
} stc_adc_dr5_bit_t;

typedef struct
{
    uint32_t DR6_0;
    uint32_t DR6_1;
    uint32_t DR6_2;
    uint32_t DR6_3;
    uint32_t DR6_4;
    uint32_t DR6_5;
    uint32_t DR6_6;
    uint32_t DR6_7;
    uint32_t DR6_8;
    uint32_t DR6_9;
    uint32_t DR6_10;
    uint32_t DR6_11;
    uint32_t DR6_12;
    uint32_t DR6_13;
    uint32_t DR6_14;
    uint32_t DR6_15;
} stc_adc_dr6_bit_t;

typedef struct
{
    uint32_t DR7_0;
    uint32_t DR7_1;
    uint32_t DR7_2;
    uint32_t DR7_3;
    uint32_t DR7_4;
    uint32_t DR7_5;
    uint32_t DR7_6;
    uint32_t DR7_7;
    uint32_t DR7_8;
    uint32_t DR7_9;
    uint32_t DR7_10;
    uint32_t DR7_11;
    uint32_t DR7_12;
    uint32_t DR7_13;
    uint32_t DR7_14;
    uint32_t DR7_15;
} stc_adc_dr7_bit_t;

typedef struct
{
    uint32_t DR8_0;
    uint32_t DR8_1;
    uint32_t DR8_2;
    uint32_t DR8_3;
    uint32_t DR8_4;
    uint32_t DR8_5;
    uint32_t DR8_6;
    uint32_t DR8_7;
    uint32_t DR8_8;
    uint32_t DR8_9;
    uint32_t DR8_10;
    uint32_t DR8_11;
    uint32_t DR8_12;
    uint32_t DR8_13;
    uint32_t DR8_14;
    uint32_t DR8_15;
} stc_adc_dr8_bit_t;

typedef struct
{
    uint32_t DR9_0;
    uint32_t DR9_1;
    uint32_t DR9_2;
    uint32_t DR9_3;
    uint32_t DR9_4;
    uint32_t DR9_5;
    uint32_t DR9_6;
    uint32_t DR9_7;
    uint32_t DR9_8;
    uint32_t DR9_9;
    uint32_t DR9_10;
    uint32_t DR9_11;
    uint32_t DR9_12;
    uint32_t DR9_13;
    uint32_t DR9_14;
    uint32_t DR9_15;
} stc_adc_dr9_bit_t;

typedef struct
{
    uint32_t DR10_0;
    uint32_t DR10_1;
    uint32_t DR10_2;
    uint32_t DR10_3;
    uint32_t DR10_4;
    uint32_t DR10_5;
    uint32_t DR10_6;
    uint32_t DR10_7;
    uint32_t DR10_8;
    uint32_t DR10_9;
    uint32_t DR10_10;
    uint32_t DR10_11;
    uint32_t DR10_12;
    uint32_t DR10_13;
    uint32_t DR10_14;
    uint32_t DR10_15;
} stc_adc_dr10_bit_t;

typedef struct
{
    uint32_t DR11_0;
    uint32_t DR11_1;
    uint32_t DR11_2;
    uint32_t DR11_3;
    uint32_t DR11_4;
    uint32_t DR11_5;
    uint32_t DR11_6;
    uint32_t DR11_7;
    uint32_t DR11_8;
    uint32_t DR11_9;
    uint32_t DR11_10;
    uint32_t DR11_11;
    uint32_t DR11_12;
    uint32_t DR11_13;
    uint32_t DR11_14;
    uint32_t DR11_15;
} stc_adc_dr11_bit_t;

typedef struct
{
    __IO uint32_t AWD0EN;
    __IO uint32_t AWD0IEN;
    __IO uint32_t AWD0MD;
    uint32_t RESERVED0[1];
    __IO uint32_t AWD1EN;
    __IO uint32_t AWD1IEN;
    __IO uint32_t AWD1MD;
    uint32_t RESERVED1[1];
    __IO uint32_t AWDCM0;
    __IO uint32_t AWDCM1;
    uint32_t RESERVED2[6];
} stc_adc_awdcr_bit_t;

typedef struct
{
    __IO uint32_t AWD0F;
    __IO uint32_t AWD1F;
    uint32_t RESERVED0[2];
    __IO uint32_t AWDCMF;
    uint32_t RESERVED1[3];
} stc_adc_awdsr_bit_t;

typedef struct
{
    __IO uint32_t CLRAWD0F;
    __IO uint32_t CLRAWD1F;
    uint32_t RESERVED0[2];
    __IO uint32_t CLRAWDCMF;
    uint32_t RESERVED1[3];
} stc_adc_awdsclrr_bit_t;

typedef struct
{
    uint32_t AWD0DR0_0;
    uint32_t AWD0DR0_1;
    uint32_t AWD0DR0_2;
    uint32_t AWD0DR0_3;
    uint32_t AWD0DR0_4;
    uint32_t AWD0DR0_5;
    uint32_t AWD0DR0_6;
    uint32_t AWD0DR0_7;
    uint32_t AWD0DR0_8;
    uint32_t AWD0DR0_9;
    uint32_t AWD0DR0_10;
    uint32_t AWD0DR0_11;
    uint32_t AWD0DR0_12;
    uint32_t AWD0DR0_13;
    uint32_t AWD0DR0_14;
    uint32_t AWD0DR0_15;
} stc_adc_awd0dr0_bit_t;

typedef struct
{
    uint32_t AWD0DR1_0;
    uint32_t AWD0DR1_1;
    uint32_t AWD0DR1_2;
    uint32_t AWD0DR1_3;
    uint32_t AWD0DR1_4;
    uint32_t AWD0DR1_5;
    uint32_t AWD0DR1_6;
    uint32_t AWD0DR1_7;
    uint32_t AWD0DR1_8;
    uint32_t AWD0DR1_9;
    uint32_t AWD0DR1_10;
    uint32_t AWD0DR1_11;
    uint32_t AWD0DR1_12;
    uint32_t AWD0DR1_13;
    uint32_t AWD0DR1_14;
    uint32_t AWD0DR1_15;
} stc_adc_awd0dr1_bit_t;

typedef struct
{
    __IO uint32_t AWDCH0;
    __IO uint32_t AWDCH1;
    __IO uint32_t AWDCH2;
    __IO uint32_t AWDCH3;
    __IO uint32_t AWDCH4;
    uint32_t RESERVED0[3];
} stc_adc_awd0chsr_bit_t;

typedef struct
{
    uint32_t AWD1DR0_0;
    uint32_t AWD1DR0_1;
    uint32_t AWD1DR0_2;
    uint32_t AWD1DR0_3;
    uint32_t AWD1DR0_4;
    uint32_t AWD1DR0_5;
    uint32_t AWD1DR0_6;
    uint32_t AWD1DR0_7;
    uint32_t AWD1DR0_8;
    uint32_t AWD1DR0_9;
    uint32_t AWD1DR0_10;
    uint32_t AWD1DR0_11;
    uint32_t AWD1DR0_12;
    uint32_t AWD1DR0_13;
    uint32_t AWD1DR0_14;
    uint32_t AWD1DR0_15;
} stc_adc_awd1dr0_bit_t;

typedef struct
{
    uint32_t AWD1DR1_0;
    uint32_t AWD1DR1_1;
    uint32_t AWD1DR1_2;
    uint32_t AWD1DR1_3;
    uint32_t AWD1DR1_4;
    uint32_t AWD1DR1_5;
    uint32_t AWD1DR1_6;
    uint32_t AWD1DR1_7;
    uint32_t AWD1DR1_8;
    uint32_t AWD1DR1_9;
    uint32_t AWD1DR1_10;
    uint32_t AWD1DR1_11;
    uint32_t AWD1DR1_12;
    uint32_t AWD1DR1_13;
    uint32_t AWD1DR1_14;
    uint32_t AWD1DR1_15;
} stc_adc_awd1dr1_bit_t;

typedef struct
{
    __IO uint32_t AWDCH0;
    __IO uint32_t AWDCH1;
    __IO uint32_t AWDCH2;
    __IO uint32_t AWDCH3;
    __IO uint32_t AWDCH4;
    uint32_t RESERVED0[3];
} stc_adc_awd1chsr_bit_t;

typedef struct
{
    __IO uint32_t STRG;
    uint32_t RESERVED0[31];
} stc_aos_intc_strgcr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    uint32_t RESERVED0[25];
} stc_aos_tmr0_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    uint32_t RESERVED0[25];
} stc_aos_tmrb_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    uint32_t RESERVED0[25];
} stc_aos_adc_itrgselr0_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    uint32_t RESERVED0[25];
} stc_aos_adc_itrgselr1_bit_t;

typedef struct
{
    __IO uint32_t PERICKSEL0;
    __IO uint32_t PERICKSEL1;
    __IO uint32_t PERICKSEL2;
    uint32_t RESERVED0[5];
} stc_cmu_pericksel_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDF;
    uint32_t RESERVED0[7];
} stc_cmu_xtalstdsr_bit_t;

typedef struct
{
    __IO uint32_t SCKDIV0;
    __IO uint32_t SCKDIV1;
    __IO uint32_t SCKDIV2;
    uint32_t RESERVED0[5];
} stc_cmu_sckdivr_bit_t;

typedef struct
{
    __IO uint32_t CKSW0;
    __IO uint32_t CKSW1;
    uint32_t RESERVED0[6];
} stc_cmu_ckswr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTP;
    uint32_t RESERVED0[7];
} stc_cmu_xtalcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t XTALDRV0;
    __IO uint32_t XTALDRV1;
    __IO uint32_t XTALMS;
    __IO uint32_t SUPDRV;
} stc_cmu_xtalcfgr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTB0;
    __IO uint32_t XTALSTB1;
    __IO uint32_t XTALSTB2;
    uint32_t RESERVED0[5];
} stc_cmu_xtalstbcr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_hrccr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTBF;
    uint32_t RESERVED0[2];
    __IO uint32_t XTALSTBF;
    __IO uint32_t XTAL32STBF;
    uint32_t RESERVED1[3];
} stc_cmu_oscstbsr_bit_t;

typedef struct
{
    __IO uint32_t MCO1SEL0;
    __IO uint32_t MCO1SEL1;
    __IO uint32_t MCO1SEL2;
    __IO uint32_t MCO1SEL3;
    __IO uint32_t MCO1DIV0;
    __IO uint32_t MCO1DIV1;
    __IO uint32_t MCO1DIV2;
    __IO uint32_t MCO1EN;
} stc_cmu_mco1cfgr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDIE;
    __IO uint32_t XTALSTDRE;
    __IO uint32_t XTALSTDRIS;
    uint32_t RESERVED0[4];
    __IO uint32_t XTALSTDE;
} stc_cmu_xtalstdcr_bit_t;

typedef struct
{
    __IO uint32_t ADC;
    __IO uint32_t CTC;
    uint32_t RESERVED0[2];
    __IO uint32_t AOS;
    uint32_t RESERVED1[2];
    __IO uint32_t CRC;
    __IO uint32_t TIMB1;
    __IO uint32_t TIMB2;
    __IO uint32_t TIMB3;
    __IO uint32_t TIMB4;
    __IO uint32_t TIMB5;
    __IO uint32_t TIMB6;
    __IO uint32_t TIMB7;
    __IO uint32_t TIMB8;
    __IO uint32_t TIM0;
    uint32_t RESERVED2[6];
    __IO uint32_t RTC;
    __IO uint32_t UART1;
    __IO uint32_t UART2;
    __IO uint32_t UART3;
    __IO uint32_t UART4;
    __IO uint32_t IIC;
    __IO uint32_t SPI;
    uint32_t RESERVED3[2];
} stc_cmu_fcg_bit_t;

typedef struct
{
    __IO uint32_t XTAL32STP;
    uint32_t RESERVED0[7];
} stc_cmu_xtal32cr_bit_t;

typedef struct
{
    __IO uint32_t XTAL32DRV0;
    __IO uint32_t XTAL32DRV1;
    __IO uint32_t XTAL32SUPDRV;
    uint32_t RESERVED0[5];
} stc_cmu_xtal32cfgr_bit_t;

typedef struct
{
    __IO uint32_t XTAL32NF0;
    __IO uint32_t XTAL32NF1;
    uint32_t RESERVED0[6];
} stc_cmu_xtal32nfr_bit_t;

typedef struct
{
    __IO uint32_t LRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_lrccr_bit_t;

typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t FLAG;
    uint32_t RESERVED0[30];
} stc_crc_cr_bit_t;

typedef struct
{
    uint32_t RESLT_0;
    uint32_t RESLT_1;
    uint32_t RESLT_2;
    uint32_t RESLT_3;
    uint32_t RESLT_4;
    uint32_t RESLT_5;
    uint32_t RESLT_6;
    uint32_t RESLT_7;
    uint32_t RESLT_8;
    uint32_t RESLT_9;
    uint32_t RESLT_10;
    uint32_t RESLT_11;
    uint32_t RESLT_12;
    uint32_t RESLT_13;
    uint32_t RESLT_14;
    uint32_t RESLT_15;
    uint32_t RESLT_16;
    uint32_t RESLT_17;
    uint32_t RESLT_18;
    uint32_t RESLT_19;
    uint32_t RESLT_20;
    uint32_t RESLT_21;
    uint32_t RESLT_22;
    uint32_t RESLT_23;
    uint32_t RESLT_24;
    uint32_t RESLT_25;
    uint32_t RESLT_26;
    uint32_t RESLT_27;
    uint32_t RESLT_28;
    uint32_t RESLT_29;
    uint32_t RESLT_30;
    uint32_t RESLT_31;
} stc_crc_reslt_bit_t;

typedef struct
{
    uint32_t DAT0_0;
    uint32_t DAT0_1;
    uint32_t DAT0_2;
    uint32_t DAT0_3;
    uint32_t DAT0_4;
    uint32_t DAT0_5;
    uint32_t DAT0_6;
    uint32_t DAT0_7;
    uint32_t DAT0_8;
    uint32_t DAT0_9;
    uint32_t DAT0_10;
    uint32_t DAT0_11;
    uint32_t DAT0_12;
    uint32_t DAT0_13;
    uint32_t DAT0_14;
    uint32_t DAT0_15;
    uint32_t DAT0_16;
    uint32_t DAT0_17;
    uint32_t DAT0_18;
    uint32_t DAT0_19;
    uint32_t DAT0_20;
    uint32_t DAT0_21;
    uint32_t DAT0_22;
    uint32_t DAT0_23;
    uint32_t DAT0_24;
    uint32_t DAT0_25;
    uint32_t DAT0_26;
    uint32_t DAT0_27;
    uint32_t DAT0_28;
    uint32_t DAT0_29;
    uint32_t DAT0_30;
    uint32_t DAT0_31;
} stc_crc_dat0_bit_t;

typedef struct
{
    uint32_t DAT1_0;
    uint32_t DAT1_1;
    uint32_t DAT1_2;
    uint32_t DAT1_3;
    uint32_t DAT1_4;
    uint32_t DAT1_5;
    uint32_t DAT1_6;
    uint32_t DAT1_7;
    uint32_t DAT1_8;
    uint32_t DAT1_9;
    uint32_t DAT1_10;
    uint32_t DAT1_11;
    uint32_t DAT1_12;
    uint32_t DAT1_13;
    uint32_t DAT1_14;
    uint32_t DAT1_15;
    uint32_t DAT1_16;
    uint32_t DAT1_17;
    uint32_t DAT1_18;
    uint32_t DAT1_19;
    uint32_t DAT1_20;
    uint32_t DAT1_21;
    uint32_t DAT1_22;
    uint32_t DAT1_23;
    uint32_t DAT1_24;
    uint32_t DAT1_25;
    uint32_t DAT1_26;
    uint32_t DAT1_27;
    uint32_t DAT1_28;
    uint32_t DAT1_29;
    uint32_t DAT1_30;
    uint32_t DAT1_31;
} stc_crc_dat1_bit_t;

typedef struct
{
    uint32_t DAT2_0;
    uint32_t DAT2_1;
    uint32_t DAT2_2;
    uint32_t DAT2_3;
    uint32_t DAT2_4;
    uint32_t DAT2_5;
    uint32_t DAT2_6;
    uint32_t DAT2_7;
    uint32_t DAT2_8;
    uint32_t DAT2_9;
    uint32_t DAT2_10;
    uint32_t DAT2_11;
    uint32_t DAT2_12;
    uint32_t DAT2_13;
    uint32_t DAT2_14;
    uint32_t DAT2_15;
    uint32_t DAT2_16;
    uint32_t DAT2_17;
    uint32_t DAT2_18;
    uint32_t DAT2_19;
    uint32_t DAT2_20;
    uint32_t DAT2_21;
    uint32_t DAT2_22;
    uint32_t DAT2_23;
    uint32_t DAT2_24;
    uint32_t DAT2_25;
    uint32_t DAT2_26;
    uint32_t DAT2_27;
    uint32_t DAT2_28;
    uint32_t DAT2_29;
    uint32_t DAT2_30;
    uint32_t DAT2_31;
} stc_crc_dat2_bit_t;

typedef struct
{
    uint32_t DAT3_0;
    uint32_t DAT3_1;
    uint32_t DAT3_2;
    uint32_t DAT3_3;
    uint32_t DAT3_4;
    uint32_t DAT3_5;
    uint32_t DAT3_6;
    uint32_t DAT3_7;
    uint32_t DAT3_8;
    uint32_t DAT3_9;
    uint32_t DAT3_10;
    uint32_t DAT3_11;
    uint32_t DAT3_12;
    uint32_t DAT3_13;
    uint32_t DAT3_14;
    uint32_t DAT3_15;
    uint32_t DAT3_16;
    uint32_t DAT3_17;
    uint32_t DAT3_18;
    uint32_t DAT3_19;
    uint32_t DAT3_20;
    uint32_t DAT3_21;
    uint32_t DAT3_22;
    uint32_t DAT3_23;
    uint32_t DAT3_24;
    uint32_t DAT3_25;
    uint32_t DAT3_26;
    uint32_t DAT3_27;
    uint32_t DAT3_28;
    uint32_t DAT3_29;
    uint32_t DAT3_30;
    uint32_t DAT3_31;
} stc_crc_dat3_bit_t;

typedef struct
{
    uint32_t DAT4_0;
    uint32_t DAT4_1;
    uint32_t DAT4_2;
    uint32_t DAT4_3;
    uint32_t DAT4_4;
    uint32_t DAT4_5;
    uint32_t DAT4_6;
    uint32_t DAT4_7;
    uint32_t DAT4_8;
    uint32_t DAT4_9;
    uint32_t DAT4_10;
    uint32_t DAT4_11;
    uint32_t DAT4_12;
    uint32_t DAT4_13;
    uint32_t DAT4_14;
    uint32_t DAT4_15;
    uint32_t DAT4_16;
    uint32_t DAT4_17;
    uint32_t DAT4_18;
    uint32_t DAT4_19;
    uint32_t DAT4_20;
    uint32_t DAT4_21;
    uint32_t DAT4_22;
    uint32_t DAT4_23;
    uint32_t DAT4_24;
    uint32_t DAT4_25;
    uint32_t DAT4_26;
    uint32_t DAT4_27;
    uint32_t DAT4_28;
    uint32_t DAT4_29;
    uint32_t DAT4_30;
    uint32_t DAT4_31;
} stc_crc_dat4_bit_t;

typedef struct
{
    uint32_t DAT5_0;
    uint32_t DAT5_1;
    uint32_t DAT5_2;
    uint32_t DAT5_3;
    uint32_t DAT5_4;
    uint32_t DAT5_5;
    uint32_t DAT5_6;
    uint32_t DAT5_7;
    uint32_t DAT5_8;
    uint32_t DAT5_9;
    uint32_t DAT5_10;
    uint32_t DAT5_11;
    uint32_t DAT5_12;
    uint32_t DAT5_13;
    uint32_t DAT5_14;
    uint32_t DAT5_15;
    uint32_t DAT5_16;
    uint32_t DAT5_17;
    uint32_t DAT5_18;
    uint32_t DAT5_19;
    uint32_t DAT5_20;
    uint32_t DAT5_21;
    uint32_t DAT5_22;
    uint32_t DAT5_23;
    uint32_t DAT5_24;
    uint32_t DAT5_25;
    uint32_t DAT5_26;
    uint32_t DAT5_27;
    uint32_t DAT5_28;
    uint32_t DAT5_29;
    uint32_t DAT5_30;
    uint32_t DAT5_31;
} stc_crc_dat5_bit_t;

typedef struct
{
    uint32_t DAT6_0;
    uint32_t DAT6_1;
    uint32_t DAT6_2;
    uint32_t DAT6_3;
    uint32_t DAT6_4;
    uint32_t DAT6_5;
    uint32_t DAT6_6;
    uint32_t DAT6_7;
    uint32_t DAT6_8;
    uint32_t DAT6_9;
    uint32_t DAT6_10;
    uint32_t DAT6_11;
    uint32_t DAT6_12;
    uint32_t DAT6_13;
    uint32_t DAT6_14;
    uint32_t DAT6_15;
    uint32_t DAT6_16;
    uint32_t DAT6_17;
    uint32_t DAT6_18;
    uint32_t DAT6_19;
    uint32_t DAT6_20;
    uint32_t DAT6_21;
    uint32_t DAT6_22;
    uint32_t DAT6_23;
    uint32_t DAT6_24;
    uint32_t DAT6_25;
    uint32_t DAT6_26;
    uint32_t DAT6_27;
    uint32_t DAT6_28;
    uint32_t DAT6_29;
    uint32_t DAT6_30;
    uint32_t DAT6_31;
} stc_crc_dat6_bit_t;

typedef struct
{
    uint32_t DAT7_0;
    uint32_t DAT7_1;
    uint32_t DAT7_2;
    uint32_t DAT7_3;
    uint32_t DAT7_4;
    uint32_t DAT7_5;
    uint32_t DAT7_6;
    uint32_t DAT7_7;
    uint32_t DAT7_8;
    uint32_t DAT7_9;
    uint32_t DAT7_10;
    uint32_t DAT7_11;
    uint32_t DAT7_12;
    uint32_t DAT7_13;
    uint32_t DAT7_14;
    uint32_t DAT7_15;
    uint32_t DAT7_16;
    uint32_t DAT7_17;
    uint32_t DAT7_18;
    uint32_t DAT7_19;
    uint32_t DAT7_20;
    uint32_t DAT7_21;
    uint32_t DAT7_22;
    uint32_t DAT7_23;
    uint32_t DAT7_24;
    uint32_t DAT7_25;
    uint32_t DAT7_26;
    uint32_t DAT7_27;
    uint32_t DAT7_28;
    uint32_t DAT7_29;
    uint32_t DAT7_30;
    uint32_t DAT7_31;
} stc_crc_dat7_bit_t;

typedef struct
{
    uint32_t DAT8_0;
    uint32_t DAT8_1;
    uint32_t DAT8_2;
    uint32_t DAT8_3;
    uint32_t DAT8_4;
    uint32_t DAT8_5;
    uint32_t DAT8_6;
    uint32_t DAT8_7;
    uint32_t DAT8_8;
    uint32_t DAT8_9;
    uint32_t DAT8_10;
    uint32_t DAT8_11;
    uint32_t DAT8_12;
    uint32_t DAT8_13;
    uint32_t DAT8_14;
    uint32_t DAT8_15;
    uint32_t DAT8_16;
    uint32_t DAT8_17;
    uint32_t DAT8_18;
    uint32_t DAT8_19;
    uint32_t DAT8_20;
    uint32_t DAT8_21;
    uint32_t DAT8_22;
    uint32_t DAT8_23;
    uint32_t DAT8_24;
    uint32_t DAT8_25;
    uint32_t DAT8_26;
    uint32_t DAT8_27;
    uint32_t DAT8_28;
    uint32_t DAT8_29;
    uint32_t DAT8_30;
    uint32_t DAT8_31;
} stc_crc_dat8_bit_t;

typedef struct
{
    uint32_t DAT9_0;
    uint32_t DAT9_1;
    uint32_t DAT9_2;
    uint32_t DAT9_3;
    uint32_t DAT9_4;
    uint32_t DAT9_5;
    uint32_t DAT9_6;
    uint32_t DAT9_7;
    uint32_t DAT9_8;
    uint32_t DAT9_9;
    uint32_t DAT9_10;
    uint32_t DAT9_11;
    uint32_t DAT9_12;
    uint32_t DAT9_13;
    uint32_t DAT9_14;
    uint32_t DAT9_15;
    uint32_t DAT9_16;
    uint32_t DAT9_17;
    uint32_t DAT9_18;
    uint32_t DAT9_19;
    uint32_t DAT9_20;
    uint32_t DAT9_21;
    uint32_t DAT9_22;
    uint32_t DAT9_23;
    uint32_t DAT9_24;
    uint32_t DAT9_25;
    uint32_t DAT9_26;
    uint32_t DAT9_27;
    uint32_t DAT9_28;
    uint32_t DAT9_29;
    uint32_t DAT9_30;
    uint32_t DAT9_31;
} stc_crc_dat9_bit_t;

typedef struct
{
    uint32_t DAT10_0;
    uint32_t DAT10_1;
    uint32_t DAT10_2;
    uint32_t DAT10_3;
    uint32_t DAT10_4;
    uint32_t DAT10_5;
    uint32_t DAT10_6;
    uint32_t DAT10_7;
    uint32_t DAT10_8;
    uint32_t DAT10_9;
    uint32_t DAT10_10;
    uint32_t DAT10_11;
    uint32_t DAT10_12;
    uint32_t DAT10_13;
    uint32_t DAT10_14;
    uint32_t DAT10_15;
    uint32_t DAT10_16;
    uint32_t DAT10_17;
    uint32_t DAT10_18;
    uint32_t DAT10_19;
    uint32_t DAT10_20;
    uint32_t DAT10_21;
    uint32_t DAT10_22;
    uint32_t DAT10_23;
    uint32_t DAT10_24;
    uint32_t DAT10_25;
    uint32_t DAT10_26;
    uint32_t DAT10_27;
    uint32_t DAT10_28;
    uint32_t DAT10_29;
    uint32_t DAT10_30;
    uint32_t DAT10_31;
} stc_crc_dat10_bit_t;

