hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
typedef struct
{
    __IO uint32_t PE;
    __IO uint32_t SMBUS;
    __IO uint32_t SMBALRTEN;
    __IO uint32_t SMBDEFAULTEN;
    __IO uint32_t SMBHOSTEN;
    __IO uint32_t FACKEN;
    __IO uint32_t GCEN;
    __IO uint32_t RESTART;
    __IO uint32_t START;
    __IO uint32_t STOP;
    __IO uint32_t ACK;
    uint32_t RESERVED0[4];
    __IO uint32_t SWRST;
    uint32_t RESERVED1[16];
} stc_i2c_cr1_bit_t;

typedef struct
{
    __IO uint32_t STARTIE;
    __IO uint32_t SLADDR0IE;
    __IO uint32_t SLADDR1IE;
    __IO uint32_t TENDIE;
    __IO uint32_t STOPIE;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLIE;
    __IO uint32_t TEMPTYIE;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOIE;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKIE;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLIE;
    __IO uint32_t SMBDEFAULTIE;
    __IO uint32_t SMBHOSTIE;
    __IO uint32_t SMBALRTIE;
    uint32_t RESERVED4[8];
} stc_i2c_cr2_bit_t;

typedef struct
{
    __IO uint32_t SLADDR00;
    __IO uint32_t SLADDR01;
    __IO uint32_t SLADDR02;
    __IO uint32_t SLADDR03;
    __IO uint32_t SLADDR04;
    __IO uint32_t SLADDR05;
    __IO uint32_t SLADDR06;
    __IO uint32_t SLADDR07;
    __IO uint32_t SLADDR08;
    __IO uint32_t SLADDR09;
    uint32_t RESERVED0[2];
    __IO uint32_t SLADDR0EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD0;
    uint32_t RESERVED2[16];
} stc_i2c_slr0_bit_t;

typedef struct
{
    __IO uint32_t SLADDR10;
    __IO uint32_t SLADDR11;
    __IO uint32_t SLADDR12;
    __IO uint32_t SLADDR13;
    __IO uint32_t SLADDR14;
    __IO uint32_t SLADDR15;
    __IO uint32_t SLADDR16;
    __IO uint32_t SLADDR17;
    __IO uint32_t SLADDR18;
    __IO uint32_t SLADDR19;
    uint32_t RESERVED0[2];
    __IO uint32_t SLADDR1EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD1;
    uint32_t RESERVED2[16];
} stc_i2c_slr1_bit_t;

typedef struct
{
    __IO uint32_t STARTF;
    __IO uint32_t SLADDR0F;
    __IO uint32_t SLADDR1F;
    __IO uint32_t TENDF;
    __IO uint32_t STOPF;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLF;
    __IO uint32_t TEMPTYF;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOF;
    __IO uint32_t ACKRF;
    uint32_t RESERVED2[1];
    __IO uint32_t NACKF;
    uint32_t RESERVED3[3];
    __IO uint32_t MSL;
    __IO uint32_t BUSY;
    __IO uint32_t TRA;
    uint32_t RESERVED4[1];
    __IO uint32_t GENCALLF;
    __IO uint32_t SMBDEFAULTF;
    __IO uint32_t SMBHOSTF;
    __IO uint32_t SMBALRTF;
    uint32_t RESERVED5[8];
} stc_i2c_sr_bit_t;

typedef struct
{
    __IO uint32_t STARTFCLR;
    __IO uint32_t SLADDR0FCLR;
    __IO uint32_t SLADDR1FCLR;
    __IO uint32_t TENDFCLR;
    __IO uint32_t STOPFCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLFCLR;
    __IO uint32_t TEMPTYFCLR;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOFCLR;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKFCLR;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLFCLR;
    __IO uint32_t SMBDEFAULTFCLR;
    __IO uint32_t SMBHOSTFCLR;
    __IO uint32_t SMBALRTFCLR;
    uint32_t RESERVED4[8];
} stc_i2c_clr_bit_t;

typedef struct
{
    __IO uint32_t DT0;
    __IO uint32_t DT1;
    __IO uint32_t DT2;
    __IO uint32_t DT3;
    __IO uint32_t DT4;
    __IO uint32_t DT5;
    __IO uint32_t DT6;
    __IO uint32_t DT7;
} stc_i2c_dtr_bit_t;

typedef struct
{
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t DR4;
    __IO uint32_t DR5;
    __IO uint32_t DR6;
    __IO uint32_t DR7;
} stc_i2c_drr_bit_t;

typedef struct
{
    __IO uint32_t SLOWW0;
    __IO uint32_t SLOWW1;
    __IO uint32_t SLOWW2;
    __IO uint32_t SLOWW3;
    __IO uint32_t SLOWW4;
    uint32_t RESERVED0[3];
    __IO uint32_t SHIGHW0;
    __IO uint32_t SHIGHW1;
    __IO uint32_t SHIGHW2;
    __IO uint32_t SHIGHW3;
    __IO uint32_t SHIGHW4;
    uint32_t RESERVED1[3];
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    uint32_t RESERVED2[13];
} stc_i2c_ccr_bit_t;

typedef struct
{
    __IO uint32_t DNF0;
    __IO uint32_t DNF1;
    uint32_t RESERVED0[2];
    __IO uint32_t DNFEN;
    __IO uint32_t ANFEN;
    uint32_t RESERVED1[26];
} stc_i2c_fltr_bit_t;

typedef struct
{
    __IO uint32_t SWDTAUTS;
    __IO uint32_t SWDTITS;
    __IO uint32_t SWDTPERI0;
    __IO uint32_t SWDTPERI1;
    __IO uint32_t SWDTCKS0;
    __IO uint32_t SWDTCKS1;
    __IO uint32_t SWDTCKS2;
    __IO uint32_t SWDTCKS3;
    __IO uint32_t SWDTWDPT0;
    __IO uint32_t SWDTWDPT1;
    __IO uint32_t SWDTWDPT2;
    __IO uint32_t SWDTWDPT3;
    __IO uint32_t SWDTSLPOFF;
    uint32_t RESERVED0[3];
    __IO uint32_t HRCREQS0;
    __IO uint32_t HRCREQS1;
    __IO uint32_t HRCREQS2;
    __IO uint32_t HRCREQS3;
    uint32_t RESERVED1[6];
    __IO uint32_t NMIFCLK0;
    __IO uint32_t NMIFCLK1;
    __IO uint32_t NMIFEN;
    __IO uint32_t NMITRG;
    __IO uint32_t NMIEN;
    __IO uint32_t NMIICGENA;
} stc_icg_icg0_bit_t;

typedef struct
{
    __IO uint32_t DFS0;
    __IO uint32_t DFS1;
    __IO uint32_t DFDIS;
    uint32_t RESERVED0[5];
    __IO uint32_t LVDLVL0;
    __IO uint32_t LVDLVL1;
    __IO uint32_t LVDLVL2;
    __IO uint32_t LVDLVL3;
    __IO uint32_t NMIS;
    __IO uint32_t IRS;
    __IO uint32_t IRDIS;
    __IO uint32_t LVDDIS;
    uint32_t RESERVED1[16];
} stc_icg_icg1_bit_t;

typedef struct
{
    uint32_t ICG2_0;
    uint32_t ICG2_1;
    uint32_t ICG2_2;
    uint32_t ICG2_3;
    uint32_t ICG2_4;
    uint32_t ICG2_5;
    uint32_t ICG2_6;
    uint32_t ICG2_7;
    uint32_t ICG2_8;
    uint32_t ICG2_9;
    uint32_t ICG2_10;
    uint32_t ICG2_11;
    uint32_t ICG2_12;
    uint32_t ICG2_13;
    uint32_t ICG2_14;
    uint32_t ICG2_15;
    uint32_t ICG2_16;
    uint32_t ICG2_17;
    uint32_t ICG2_18;
    uint32_t ICG2_19;
    uint32_t ICG2_20;
    uint32_t ICG2_21;
    uint32_t ICG2_22;
    uint32_t ICG2_23;
    uint32_t ICG2_24;
    uint32_t ICG2_25;
    uint32_t ICG2_26;
    uint32_t ICG2_27;
    uint32_t ICG2_28;
    uint32_t ICG2_29;
    uint32_t ICG2_30;
    uint32_t ICG2_31;
} stc_icg_icg2_bit_t;

typedef struct
{
    uint32_t ICG3_0;
    uint32_t ICG3_1;
    uint32_t ICG3_2;
    uint32_t ICG3_3;
    uint32_t ICG3_4;
    uint32_t ICG3_5;
    uint32_t ICG3_6;
    uint32_t ICG3_7;
    uint32_t ICG3_8;
    uint32_t ICG3_9;
    uint32_t ICG3_10;
    uint32_t ICG3_11;
    uint32_t ICG3_12;
    uint32_t ICG3_13;
    uint32_t ICG3_14;
    uint32_t ICG3_15;
    uint32_t ICG3_16;
    uint32_t ICG3_17;
    uint32_t ICG3_18;
    uint32_t ICG3_19;
    uint32_t ICG3_20;
    uint32_t ICG3_21;
    uint32_t ICG3_22;
    uint32_t ICG3_23;
    uint32_t ICG3_24;
    uint32_t ICG3_25;
    uint32_t ICG3_26;
    uint32_t ICG3_27;
    uint32_t ICG3_28;
    uint32_t ICG3_29;
    uint32_t ICG3_30;
    uint32_t ICG3_31;
} stc_icg_icg3_bit_t;

typedef struct
{
    uint32_t ICG4_0;
    uint32_t ICG4_1;
    uint32_t ICG4_2;
    uint32_t ICG4_3;
    uint32_t ICG4_4;
    uint32_t ICG4_5;
    uint32_t ICG4_6;
    uint32_t ICG4_7;
    uint32_t ICG4_8;
    uint32_t ICG4_9;
    uint32_t ICG4_10;
    uint32_t ICG4_11;
    uint32_t ICG4_12;
    uint32_t ICG4_13;
    uint32_t ICG4_14;
    uint32_t ICG4_15;
    uint32_t ICG4_16;
    uint32_t ICG4_17;
    uint32_t ICG4_18;
    uint32_t ICG4_19;
    uint32_t ICG4_20;
    uint32_t ICG4_21;
    uint32_t ICG4_22;
    uint32_t ICG4_23;
    uint32_t ICG4_24;
    uint32_t ICG4_25;
    uint32_t ICG4_26;
    uint32_t ICG4_27;
    uint32_t ICG4_28;
    uint32_t ICG4_29;
    uint32_t ICG4_30;
    uint32_t ICG4_31;
} stc_icg_icg4_bit_t;

typedef struct
{
    uint32_t ICG5_0;
    uint32_t ICG5_1;
    uint32_t ICG5_2;
    uint32_t ICG5_3;
    uint32_t ICG5_4;
    uint32_t ICG5_5;
    uint32_t ICG5_6;
    uint32_t ICG5_7;
    uint32_t ICG5_8;
    uint32_t ICG5_9;
    uint32_t ICG5_10;
    uint32_t ICG5_11;
    uint32_t ICG5_12;
    uint32_t ICG5_13;
    uint32_t ICG5_14;
    uint32_t ICG5_15;
    uint32_t ICG5_16;
    uint32_t ICG5_17;
    uint32_t ICG5_18;
    uint32_t ICG5_19;
    uint32_t ICG5_20;
    uint32_t ICG5_21;
    uint32_t ICG5_22;
    uint32_t ICG5_23;
    uint32_t ICG5_24;
    uint32_t ICG5_25;
    uint32_t ICG5_26;
    uint32_t ICG5_27;
    uint32_t ICG5_28;
    uint32_t ICG5_29;
    uint32_t ICG5_30;
    uint32_t ICG5_31;
} stc_icg_icg5_bit_t;

typedef struct
{
    uint32_t ICG6_0;
    uint32_t ICG6_1;
    uint32_t ICG6_2;
    uint32_t ICG6_3;
    uint32_t ICG6_4;
    uint32_t ICG6_5;
    uint32_t ICG6_6;
    uint32_t ICG6_7;
    uint32_t ICG6_8;
    uint32_t ICG6_9;
    uint32_t ICG6_10;
    uint32_t ICG6_11;
    uint32_t ICG6_12;
    uint32_t ICG6_13;
    uint32_t ICG6_14;
    uint32_t ICG6_15;
    uint32_t ICG6_16;
    uint32_t ICG6_17;
    uint32_t ICG6_18;
    uint32_t ICG6_19;
    uint32_t ICG6_20;
    uint32_t ICG6_21;
    uint32_t ICG6_22;
    uint32_t ICG6_23;
    uint32_t ICG6_24;
    uint32_t ICG6_25;
    uint32_t ICG6_26;
    uint32_t ICG6_27;
    uint32_t ICG6_28;
    uint32_t ICG6_29;
    uint32_t ICG6_30;
    uint32_t ICG6_31;
} stc_icg_icg6_bit_t;

typedef struct
{
    __IO uint32_t NMITRG;
    uint32_t RESERVED0[3];
    __IO uint32_t NMIFCLK0;
    __IO uint32_t NMIFCLK1;
    uint32_t RESERVED1[1];
    __IO uint32_t NMIFEN;
    uint32_t RESERVED2[24];
} stc_intc_nmicr_bit_t;

typedef struct
{
    __IO uint32_t NMIEN;
    __IO uint32_t XTALSTPEN;
    __IO uint32_t SWDTEN;
    __IO uint32_t PVDEN;
    uint32_t RESERVED0[28];
} stc_intc_nmier_bit_t;

typedef struct
{
    __IO uint32_t NMIF;
    __IO uint32_t XTALSTPF;
    __IO uint32_t SWDTF;
    __IO uint32_t PVDF;
    uint32_t RESERVED0[28];
} stc_intc_nmifr_bit_t;

typedef struct
{
    __IO uint32_t NMICL;
    __IO uint32_t XTALSTPCL;
    __IO uint32_t SWDTCL;
    __IO uint32_t PVDCL;
    uint32_t RESERVED0[28];
} stc_intc_nmiclr_bit_t;

typedef struct
{
    __IO uint32_t EVTEN0;
    __IO uint32_t EVTEN1;
    __IO uint32_t EVTEN2;
    __IO uint32_t EVTEN3;
    __IO uint32_t EVTEN4;
    __IO uint32_t EVTEN5;
    __IO uint32_t EVTEN6;
    __IO uint32_t EVTEN7;
    uint32_t RESERVED0[24];
} stc_intc_evter_bit_t;

typedef struct
{
    __IO uint32_t EKEY0EN;
    __IO uint32_t EKEY1EN;
    __IO uint32_t EKEY2EN;
    __IO uint32_t EKEY3EN;
    __IO uint32_t EKEY4EN;
    __IO uint32_t EKEY5EN;
    uint32_t RESERVED0[26];
} stc_intc_ekeycr_bit_t;

typedef struct
{
    __IO uint32_t FPRC0;
    __IO uint32_t FPRC1;
    __IO uint32_t FPRC2;
    __IO uint32_t FPRC3;
    __IO uint32_t FPRC4;
    __IO uint32_t FPRC5;
    __IO uint32_t FPRC6;
    __IO uint32_t FPRC7;
    uint32_t RESERVED0[24];
} stc_intc_fprcr_bit_t;

typedef struct
{
    __IO uint32_t EIRQTRG0;
    __IO uint32_t EIRQTRG1;
    uint32_t RESERVED0[2];
    __IO uint32_t EIRQFCLK0;
    __IO uint32_t EIRQFCLK1;
    uint32_t RESERVED1[1];
    __IO uint32_t EIRQFEN;
    uint32_t RESERVED2[24];
} stc_intc_eirqcr_bit_t;

typedef struct
{
    __IO uint32_t EIRQWUEN0;
    __IO uint32_t EIRQWUEN1;
    __IO uint32_t EIRQWUEN2;
    __IO uint32_t EIRQWUEN3;
    __IO uint32_t EIRQWUEN4;
    __IO uint32_t EIRQWUEN5;
    __IO uint32_t EIRQWUEN6;
    __IO uint32_t EIRQWUEN7;
    __IO uint32_t EIRQWUEN8;
    __IO uint32_t EIRQWUEN9;
    uint32_t RESERVED0[6];
    __IO uint32_t SWDTWUEN;
    __IO uint32_t EKEYWUEN;
    __IO uint32_t TMR0CMPWUEN;
    uint32_t RESERVED1[3];
    __IO uint32_t PVDWUEN;
    __IO uint32_t RTCALMWUEN;
    __IO uint32_t RTCPRDWUEN;
    uint32_t RESERVED2[7];
} stc_intc_wupenr_bit_t;

typedef struct
{
    __IO uint32_t EIRQF0;
    __IO uint32_t EIRQF1;
    __IO uint32_t EIRQF2;
    __IO uint32_t EIRQF3;
    __IO uint32_t EIRQF4;
    __IO uint32_t EIRQF5;
    __IO uint32_t EIRQF6;
    __IO uint32_t EIRQF7;
    __IO uint32_t EIRQF8;
    __IO uint32_t EIRQF9;
    uint32_t RESERVED0[22];
} stc_intc_eirqfr_bit_t;

typedef struct
{
    __IO uint32_t EIRQCL0;
    __IO uint32_t EIRQCL1;
    __IO uint32_t EIRQCL2;
    __IO uint32_t EIRQCL3;
    __IO uint32_t EIRQCL4;
    __IO uint32_t EIRQCL5;
    __IO uint32_t EIRQCL6;
    __IO uint32_t EIRQCL7;
    __IO uint32_t EIRQCL8;
    __IO uint32_t EIRQCL9;
    uint32_t RESERVED0[22];
} stc_intc_eirqclr_bit_t;

typedef struct
{
    __IO uint32_t ISEL0;
    __IO uint32_t ISEL1;
    __IO uint32_t ISEL2;
    __IO uint32_t ISEL3;
    uint32_t RESERVED0[28];
} stc_intc_iselar_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t ISEL1;
    __IO uint32_t ISEL2;
    __IO uint32_t ISEL3;
    __IO uint32_t ISEL4;
    __IO uint32_t ISEL5;
    __IO uint32_t ISEL6;
    __IO uint32_t ISEL7;
    __IO uint32_t ISEL8;
    __IO uint32_t ISEL9;
    __IO uint32_t ISEL10;
    __IO uint32_t ISEL11;
    __IO uint32_t ISEL12;
    __IO uint32_t ISEL13;
    __IO uint32_t ISEL14;
    __IO uint32_t ISEL15;
    uint32_t RESERVED1[16];
} stc_intc_iselbr_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_port_pidr0_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    __IO uint32_t PIN4;
    __IO uint32_t PIN5;
    __IO uint32_t PIN6;
    __IO uint32_t PIN7;
} stc_port_pidr1_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    __IO uint32_t PIN4;
    __IO uint32_t PIN5;
    __IO uint32_t PIN6;
    __IO uint32_t PIN7;
} stc_port_pidr2_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_port_pidr3_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_port_pidr4_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    uint32_t RESERVED0[6];
} stc_port_pidr5_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    uint32_t RESERVED0[4];
} stc_port_pidr6_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    uint32_t RESERVED0[4];
} stc_port_pidr7_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    __IO uint32_t PIN4;
    uint32_t RESERVED0[3];
} stc_port_pidr12_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t PIN7;
} stc_port_pidr13_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t PIN6;
    __IO uint32_t PIN7;
} stc_port_pidr14_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_port_podr0_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_port_podr1_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_port_podr2_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_port_podr3_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_port_podr4_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    uint32_t RESERVED0[6];
} stc_port_podr5_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    uint32_t RESERVED0[4];
} stc_port_podr6_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    uint32_t RESERVED0[4];
} stc_port_podr7_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    uint32_t RESERVED0[3];
} stc_port_podr12_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t POUT7;
} stc_port_podr13_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_port_podr14_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_port_poer0_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    __IO uint32_t POUTE5;
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_port_poer1_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    __IO uint32_t POUTE5;
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_port_poer2_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_port_poer3_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_port_poer4_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    uint32_t RESERVED0[6];
} stc_port_poer5_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    uint32_t RESERVED0[4];
} stc_port_poer6_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    uint32_t RESERVED0[4];
} stc_port_poer7_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    uint32_t RESERVED0[3];
} stc_port_poer12_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t POUTE7;
} stc_port_poer13_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_port_poer14_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_port_posr0_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    __IO uint32_t POS4;
    __IO uint32_t POS5;
    __IO uint32_t POS6;
    __IO uint32_t POS7;
} stc_port_posr1_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    __IO uint32_t POS4;
    __IO uint32_t POS5;
    __IO uint32_t POS6;
    __IO uint32_t POS7;
} stc_port_posr2_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_port_posr3_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_port_posr4_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    uint32_t RESERVED0[6];
} stc_port_posr5_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    uint32_t RESERVED0[4];
} stc_port_posr6_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    uint32_t RESERVED0[4];
} stc_port_posr7_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    __IO uint32_t POS4;
    uint32_t RESERVED0[3];
} stc_port_posr12_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t POS7;
} stc_port_posr13_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t POS6;
    __IO uint32_t POS7;
} stc_port_posr14_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_port_porr0_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    __IO uint32_t POR4;
    __IO uint32_t POR5;
    __IO uint32_t POR6;
    __IO uint32_t POR7;
} stc_port_porr1_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    __IO uint32_t POR4;
    __IO uint32_t POR5;
    __IO uint32_t POR6;
    __IO uint32_t POR7;
} stc_port_porr2_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_port_porr3_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_port_porr4_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    uint32_t RESERVED0[6];
} stc_port_porr5_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    uint32_t RESERVED0[4];
} stc_port_porr6_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    uint32_t RESERVED0[4];
} stc_port_porr7_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    __IO uint32_t POR4;
    uint32_t RESERVED0[3];
} stc_port_porr12_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t POR7;
} stc_port_porr13_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t POR6;
    __IO uint32_t POR7;
} stc_port_porr14_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_port_potr0_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    __IO uint32_t POT2;
    __IO uint32_t POT3;
    __IO uint32_t POT4;
    __IO uint32_t POT5;
    __IO uint32_t POT6;
    __IO uint32_t POT7;
} stc_port_potr1_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    __IO uint32_t POT2;
    __IO uint32_t POT3;
    __IO uint32_t POT4;
    __IO uint32_t POT5;
    __IO uint32_t POT6;
    __IO uint32_t POT7;
} stc_port_potr2_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_port_potr3_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_port_potr4_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_port_potr5_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    __IO uint32_t POT2;
    __IO uint32_t POT3;
    uint32_t RESERVED0[4];
} stc_port_potr6_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    __IO uint32_t POT2;
    __IO uint32_t POT3;
    uint32_t RESERVED0[4];
} stc_port_potr7_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    __IO uint32_t POT2;
    __IO uint32_t POT3;
    __IO uint32_t POT4;
    uint32_t RESERVED0[3];
} stc_port_potr12_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t POT7;
} stc_port_potr13_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t POT6;
    __IO uint32_t POT7;
} stc_port_potr14_bit_t;

typedef struct
{
    __IO uint32_t SPFE0;
    __IO uint32_t SPFE1;
    uint32_t RESERVED0[14];
} stc_port_pspcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t RDWT0;
    __IO uint32_t RDWT1;
} stc_port_pccr_bit_t;

typedef struct
{
    __IO uint32_t PINAE0;
    __IO uint32_t PINAE1;
    __IO uint32_t PINAE2;
    __IO uint32_t PINAE3;
    __IO uint32_t PINAE4;
    __IO uint32_t PINAE5;
    __IO uint32_t PINAE6;
    __IO uint32_t PINAE7;
    uint32_t RESERVED0[4];
    __IO uint32_t PINAE12;
    __IO uint32_t PINAE13;
    __IO uint32_t PINAE14;
    uint32_t RESERVED1[1];
} stc_port_pinaer_bit_t;

typedef struct
{
    __IO uint32_t WE;
    uint32_t RESERVED0[7];
    __IO uint32_t WP0;
    __IO uint32_t WP1;
    __IO uint32_t WP2;
    __IO uint32_t WP3;
    __IO uint32_t WP4;
    __IO uint32_t WP5;
    __IO uint32_t WP6;
    __IO uint32_t WP7;
} stc_port_pwpr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t CKSHRC;
    uint32_t RESERVED1[1];
    __IO uint32_t HAPORDIS;
    uint32_t RESERVED2[3];
    __IO uint32_t STOP;
} stc_pwc_stpmcr_bit_t;

