hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/common/hc32f120.h
typedef struct
{
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    uint32_t                                 RESERVED0[64];
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED1[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    stc_i2c_dtr_bit_t                        DTR_b;
    uint32_t                                 RESERVED2[24];
    stc_i2c_drr_bit_t                        DRR_b;
    uint32_t                                 RESERVED3[24];
    stc_i2c_ccr_bit_t                        CCR_b;
    stc_i2c_fltr_bit_t                       FLTR_b;
} bM0P_I2C_TypeDef;

typedef struct
{
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
    stc_icg_icg2_bit_t                       ICG2_b;
    stc_icg_icg3_bit_t                       ICG3_b;
    stc_icg_icg4_bit_t                       ICG4_b;
    stc_icg_icg5_bit_t                       ICG5_b;
    stc_icg_icg6_bit_t                       ICG6_b;
} bM0P_ICG_TypeDef;

typedef struct
{
    stc_intc_nmicr_bit_t                     NMICR_b;
    stc_intc_nmier_bit_t                     NMIER_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmiclr_bit_t                    NMICLR_b;
    uint32_t                                 RESERVED0[128];
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ekeycr_bit_t                    EKEYCR_b;
    uint32_t                                 RESERVED1[160];
    stc_intc_fprcr_bit_t                     FPRCR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    uint32_t                                 RESERVED2[64];
    stc_intc_wupenr_bit_t                    WUPENR_b;
    stc_intc_eirqfr_bit_t                    EIRQFR_b;
    stc_intc_eirqclr_bit_t                   EIRQCLR_b;
    uint32_t                                 RESERVED3[288];
    stc_intc_iselar_bit_t                    ISELAR8_b;
    stc_intc_iselar_bit_t                    ISELAR9_b;
    stc_intc_iselar_bit_t                    ISELAR10_b;
    stc_intc_iselar_bit_t                    ISELAR11_b;
    stc_intc_iselar_bit_t                    ISELAR12_b;
    stc_intc_iselar_bit_t                    ISELAR13_b;
    stc_intc_iselar_bit_t                    ISELAR14_b;
    stc_intc_iselar_bit_t                    ISELAR15_b;
    stc_intc_iselar_bit_t                    ISELAR16_b;
    stc_intc_iselar_bit_t                    ISELAR17_b;
    stc_intc_iselar_bit_t                    ISELAR18_b;
    stc_intc_iselar_bit_t                    ISELAR19_b;
    stc_intc_iselar_bit_t                    ISELAR20_b;
    stc_intc_iselar_bit_t                    ISELAR21_b;
    stc_intc_iselar_bit_t                    ISELAR22_b;
    stc_intc_iselar_bit_t                    ISELAR23_b;
    stc_intc_iselbr_bit_t                    ISELBR24_b;
    stc_intc_iselbr_bit_t                    ISELBR25_b;
    stc_intc_iselbr_bit_t                    ISELBR26_b;
    stc_intc_iselbr_bit_t                    ISELBR27_b;
    stc_intc_iselbr_bit_t                    ISELBR28_b;
    stc_intc_iselbr_bit_t                    ISELBR29_b;
    stc_intc_iselbr_bit_t                    ISELBR30_b;
    stc_intc_iselbr_bit_t                    ISELBR31_b;
} bM0P_INTC_TypeDef;

typedef struct
{
    stc_port_pidr0_bit_t                     PIDR0_b;
    stc_port_pidr1_bit_t                     PIDR1_b;
    stc_port_pidr2_bit_t                     PIDR2_b;
    stc_port_pidr3_bit_t                     PIDR3_b;
    stc_port_pidr4_bit_t                     PIDR4_b;
    stc_port_pidr5_bit_t                     PIDR5_b;
    stc_port_pidr6_bit_t                     PIDR6_b;
    stc_port_pidr7_bit_t                     PIDR7_b;
    uint32_t                                 RESERVED0[32];
    stc_port_pidr12_bit_t                    PIDR12_b;
    stc_port_pidr13_bit_t                    PIDR13_b;
    stc_port_pidr14_bit_t                    PIDR14_b;
    uint32_t                                 RESERVED1[8];
    stc_port_podr0_bit_t                     PODR0_b;
    stc_port_podr1_bit_t                     PODR1_b;
    stc_port_podr2_bit_t                     PODR2_b;
    stc_port_podr3_bit_t                     PODR3_b;
    stc_port_podr4_bit_t                     PODR4_b;
    stc_port_podr5_bit_t                     PODR5_b;
    stc_port_podr6_bit_t                     PODR6_b;
    stc_port_podr7_bit_t                     PODR7_b;
    uint32_t                                 RESERVED2[32];
    stc_port_podr12_bit_t                    PODR12_b;
    stc_port_podr13_bit_t                    PODR13_b;
    stc_port_podr14_bit_t                    PODR14_b;
    uint32_t                                 RESERVED3[8];
    stc_port_poer0_bit_t                     POER0_b;
    stc_port_poer1_bit_t                     POER1_b;
    stc_port_poer2_bit_t                     POER2_b;
    stc_port_poer3_bit_t                     POER3_b;
    stc_port_poer4_bit_t                     POER4_b;
    stc_port_poer5_bit_t                     POER5_b;
    stc_port_poer6_bit_t                     POER6_b;
    stc_port_poer7_bit_t                     POER7_b;
    uint32_t                                 RESERVED4[32];
    stc_port_poer12_bit_t                    POER12_b;
    stc_port_poer13_bit_t                    POER13_b;
    stc_port_poer14_bit_t                    POER14_b;
    uint32_t                                 RESERVED5[8];
    stc_port_posr0_bit_t                     POSR0_b;
    stc_port_posr1_bit_t                     POSR1_b;
    stc_port_posr2_bit_t                     POSR2_b;
    stc_port_posr3_bit_t                     POSR3_b;
    stc_port_posr4_bit_t                     POSR4_b;
    stc_port_posr5_bit_t                     POSR5_b;
    stc_port_posr6_bit_t                     POSR6_b;
    stc_port_posr7_bit_t                     POSR7_b;
    uint32_t                                 RESERVED6[32];
    stc_port_posr12_bit_t                    POSR12_b;
    stc_port_posr13_bit_t                    POSR13_b;
    stc_port_posr14_bit_t                    POSR14_b;
    uint32_t                                 RESERVED7[8];
    stc_port_porr0_bit_t                     PORR0_b;
    stc_port_porr1_bit_t                     PORR1_b;
    stc_port_porr2_bit_t                     PORR2_b;
    stc_port_porr3_bit_t                     PORR3_b;
    stc_port_porr4_bit_t                     PORR4_b;
    stc_port_porr5_bit_t                     PORR5_b;
    stc_port_porr6_bit_t                     PORR6_b;
    stc_port_porr7_bit_t                     PORR7_b;
    uint32_t                                 RESERVED8[32];
    stc_port_porr12_bit_t                    PORR12_b;
    stc_port_porr13_bit_t                    PORR13_b;
    stc_port_porr14_bit_t                    PORR14_b;
    uint32_t                                 RESERVED9[8];
    stc_port_potr0_bit_t                     POTR0_b;
    stc_port_potr1_bit_t                     POTR1_b;
    stc_port_potr2_bit_t                     POTR2_b;
    stc_port_potr3_bit_t                     POTR3_b;
    stc_port_potr4_bit_t                     POTR4_b;
    stc_port_potr5_bit_t                     POTR5_b;
    stc_port_potr6_bit_t                     POTR6_b;
    stc_port_potr7_bit_t                     POTR7_b;
    uint32_t                                 RESERVED10[32];
    stc_port_potr12_bit_t                    POTR12_b;
    stc_port_potr13_bit_t                    POTR13_b;
    stc_port_potr14_bit_t                    POTR14_b;
    uint32_t                                 RESERVED11[9480];
    stc_port_pspcr_bit_t                     PSPCR_b;
    uint32_t                                 RESERVED12[16];
    stc_port_pccr_bit_t                      PCCR_b;
    stc_port_pinaer_bit_t                    PINAER_b;
    stc_port_pwpr_bit_t                      PWPR_b;
} bM0P_PORT_TypeDef;

typedef struct
{
    stc_pwc_stpmcr_bit_t                     STPMCR_b;
    uint32_t                                 RESERVED0[24];
    stc_pwc_pwrc_bit_t                       PWRC_b;
    uint32_t                                 RESERVED1[56];
    stc_pwc_ramcr_bit_t                      RAMCR_b;
    uint32_t                                 RESERVED2[24];
    stc_pwc_lvdcsr_bit_t                     LVDCSR_b;
    uint32_t                                 RESERVED3[120];
    stc_pwc_fprc_bit_t                       FPRC_b;
    uint32_t                                 RESERVED4[240];
    stc_pwc_dbgc_bit_t                       DBGC_b;
} bM0P_PWC_TypeDef;

typedef struct
{
    stc_rmu_rstf0_bit_t                      RSTF0_b;
} bM0P_RMU_TypeDef;

typedef struct
{
    stc_rtc_cr0_bit_t                        CR0_b;
    stc_rtc_cr1_bit_t                        CR1_b;
    stc_rtc_cr2_bit_t                        CR2_b;
    stc_rtc_cr3_bit_t                        CR3_b;
    stc_rtc_sec_bit_t                        SEC_b;
    stc_rtc_min_bit_t                        MIN_b;
    stc_rtc_hour_bit_t                       HOUR_b;
    stc_rtc_week_bit_t                       WEEK_b;
    stc_rtc_day_bit_t                        DAY_b;
    stc_rtc_mon_bit_t                        MON_b;
    stc_rtc_year_bit_t                       YEAR_b;
    stc_rtc_almmin_bit_t                     ALMMIN_b;
    stc_rtc_almhour_bit_t                    ALMHOUR_b;
    stc_rtc_almweek_bit_t                    ALMWEEK_b;
    stc_rtc_errcrh_bit_t                     ERRCRH_b;
    stc_rtc_errcrl_bit_t                     ERRCRL_b;
} bM0P_RTC_TypeDef;

typedef struct
{
    stc_spi_dr_bit_t                         DR_b;
    stc_spi_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED0[32];
    stc_spi_cfg1_bit_t                       CFG1_b;
    uint32_t                                 RESERVED1[32];
    stc_spi_sr_bit_t                         SR_b;
    stc_spi_cfg2_bit_t                       CFG2_b;
} bM0P_SPI_TypeDef;

typedef struct
{
    stc_swdt_cr_bit_t                        CR_b;
    stc_swdt_sr_bit_t                        SR_b;
    stc_swdt_rr_bit_t                        RR_b;
} bM0P_SWDT_TypeDef;

typedef struct
{
    stc_tmr0_cntar_bit_t                     CNTAR_b;
    uint32_t                                 RESERVED0[32];
    stc_tmr0_cmpar_bit_t                     CMPAR_b;
    uint32_t                                 RESERVED1[32];
    stc_tmr0_bconr_bit_t                     BCONR_b;
    stc_tmr0_stflr_bit_t                     STFLR_b;
} bM0P_TMR0_TypeDef;

typedef struct
{
    stc_tmrb_cnter_bit_t                     CNTER_b;
    uint32_t                                 RESERVED0[16];
    stc_tmrb_perar_bit_t                     PERAR_b;
    uint32_t                                 RESERVED1[464];
    stc_tmrb_cmpar_bit_t                     CMPAR_b;
    uint32_t                                 RESERVED2[496];
    stc_tmrb_bcstr_bit_t                     BCSTR_b;
    uint32_t                                 RESERVED3[16];
    stc_tmrb_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED4[16];
    stc_tmrb_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED5[16];
    stc_tmrb_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED6[16];
    stc_tmrb_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED7[16];
    stc_tmrb_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED8[48];
    stc_tmrb_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED9[784];
    stc_tmrb_cconr_bit_t                     CCONR_b;
    uint32_t                                 RESERVED10[496];
    stc_tmrb_pconr_bit_t                     PCONR_b;
} bM0P_TMRB_TypeDef;

typedef struct
{
    stc_usart_sr_bit_t                       SR_b;
    stc_usart_dr_bit_t                       DR_b;
    stc_usart_brr_bit_t                      BRR_b;
    stc_usart_cr1_bit_t                      CR1_b;
    stc_usart_cr2_bit_t                      CR2_b;
    stc_usart_cr3_bit_t                      CR3_b;
    stc_usart_pr_bit_t                       PR_b;
} bM0P_USART_TypeDef;



/******************************************************************************/
/*      Device Specific Peripheral bit_band declaration & memory map          */
/******************************************************************************/

#define bM0P_ADC                             ((bM0P_ADC_TypeDef *)0x42170000UL)
#define bM0P_AOS                             ((bM0P_AOS_TypeDef *)0x42018000UL)
#define bM0P_CMU                             ((bM0P_CMU_TypeDef *)0x42288000UL)
#define bM0P_CRC                             ((bM0P_CRC_TypeDef *)0x422A8000UL)
#define bM0P_CTC                             ((bM0P_CTC_TypeDef *)0x42000000UL)
#define bM0P_DBGC                            ((bM0P_DBGC_TypeDef *)0x422A0000UL)
#define bM0P_EFM                             ((bM0P_EFM_TypeDef *)0x42010000UL)
#define bM0P_I2C                             ((bM0P_I2C_TypeDef *)0x42090000UL)
#define bM0P_INTC                            ((bM0P_INTC_TypeDef *)0x42220000UL)
#define bM0P_PORT                            ((bM0P_PORT_TypeDef *)0x42270000UL)
#define bM0P_PWC                             ((bM0P_PWC_TypeDef *)0x42280000UL)
#define bM0P_RMU                             ((bM0P_RMU_TypeDef *)0x42282000UL)
#define bM0P_RTC                             ((bM0P_RTC_TypeDef *)0x421A8000UL)
#define bM0P_SPI                             ((bM0P_SPI_TypeDef *)0x42070000UL)
#define bM0P_SWDT                            ((bM0P_SWDT_TypeDef *)0x42198000UL)
#define bM0P_TMR0                            ((bM0P_TMR0_TypeDef *)0x420B0000UL)
#define bM0P_TMRB1                           ((bM0P_TMRB_TypeDef *)0x420F0000UL)
#define bM0P_TMRB2                           ((bM0P_TMRB_TypeDef *)0x420F8000UL)
#define bM0P_TMRB3                           ((bM0P_TMRB_TypeDef *)0x42100000UL)
#define bM0P_TMRB4                           ((bM0P_TMRB_TypeDef *)0x42108000UL)
#define bM0P_TMRB5                           ((bM0P_TMRB_TypeDef *)0x42110000UL)
#define bM0P_TMRB6                           ((bM0P_TMRB_TypeDef *)0x42118000UL)
#define bM0P_TMRB7                           ((bM0P_TMRB_TypeDef *)0x42120000UL)
#define bM0P_TMRB8                           ((bM0P_TMRB_TypeDef *)0x42128000UL)
#define bM0P_USART1                          ((bM0P_USART_TypeDef *)0x42030000UL)
#define bM0P_USART2                          ((bM0P_USART_TypeDef *)0x42038000UL)
#define bM0P_USART3                          ((bM0P_USART_TypeDef *)0x42040000UL)
#define bM0P_USART4                          ((bM0P_USART_TypeDef *)0x42048000UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32F120_H__ */

